[{"id":"cd93c40b-d5e9-418a-9103-e61f51a65c73","name":"1-India Family Mart","description":"1-India Family Mart is a chain of value retail stores in India operated by Nysaa Retail Pvt. Ltd.[3][4] The chain has the total of 100 stores across East and North of India.[5] 1-India Family Mart has established the first store in Uttar Pradesh and later has expanded operations across Bihar, Chhattisgarh, Uttrakhand, Jharkhand, Madhya Pradesh, Odisha and the North East.[6][7]\n","country":"India","industry":"Retail","source":"https://en.wikipedia.org/wiki/1-India_Family_Mart"},{"id":"5572b128-64be-4d74-88a8-35e8dd03c980","name":"Aashirvaad","description":"Aashirvaad is a brand of staple food and kitchen ingredients owned by ITC Ltd.[1] The Aashirvaad range of products include Atta with halal certification, Salt, Spices and Instant mixes.\n","country":"India","source":"https://en.wikipedia.org/wiki/Aashirvaad"},{"id":"ed428739-f740-4966-8b9e-6c9510d4d9c6","name":"Aavin","description":"Aavin is the trademark of Tamil Nadu Co-operative Milk Producers' Federation Limited, a Tamil Nadu-based milk producer's union. Aavin procures milk, processes it and sells milk and milk products to consumers.\n","country":"India","source":"https://en.wikipedia.org/wiki/Aavin"},{"id":"d8a79496-9e90-4f64-803c-a84ffdf90be2","name":"Action Construction Equipment","description":"Action Construction Equipment Ltd. is an Indian material handling and construction equipment manufacturing company, incorporated in 1995.[1][2][3][4]\n","country":"India","industry":"Heavy Equipment","source":"https://en.wikipedia.org/wiki/Action_Construction_Equipment"},{"id":"85d67eb1-ff7f-4fcf-a2ab-9b574b5aeb16","name":"Aditya Birla Payments Bank","description":"Aditya Birla Payments Bank Limited (ABPB) was a payments bank started as a joint venture by Aditya Birla Nuvo Ltd. and Idea Cellular.[1] Launched on February 22, 2018, it is the fourth payments bank to begin operations since issuance of licenses to 11 firms by the Reserve Bank of India in August 2015.[2][3] Payments Banks are a special category of banks that can accept deposits of up to 1 lakh but cannot give loans or credit cards.[4]\n","country":"India","industry":"Financial services","source":"https://en.wikipedia.org/wiki/Aditya_Birla_Payments_Bank"},{"id":"985a8db9-1090-472f-8534-5e3a6f8f03fe","name":"Air Deccan","description":"Air Deccan is an Indian regional commuter airline currently operating from Ahmedabad, Gujarat. It flies to a total of four destinations using Beech 1900D aircraft, as of November 2019.[4]\n","country":"India","source":"https://en.wikipedia.org/wiki/Air_Deccan"},{"id":"73ed3fc0-eb3d-4c06-aed0-e83f5942f215","name":"Air India","description":"Air India is the flag carrier airline of India, headquartered at New Delhi.[9] It is owned by Air India Limited, a government-owned enterprise, and operates a fleet of Airbus and Boeing aircraft serving 102 domestic and international destinations. The airline has its hub at Indira Gandhi International Airport, New Delhi, alongside several focus cities across India. Air India is the largest international carrier out of India with an 18.6% market share.[10] Over 60 international destinations are served by Air India across four continents. The airline became the 27th member of Star Alliance on 11 July 2014.\n","country":"India","source":"https://en.wikipedia.org/wiki/Air_India"},{"id":"317aec46-6ad2-4879-9e96-947fe52346c2","name":"Air Ink","description":"AIR-INK is a proprietary brand of ink and composites products made by condensing carbon-based gaseous effluents generated by air pollution due to incomplete combustion of fossil fuels.[1] Founded by Graviky Labs, a spin-off group of MIT Media Lab, AIR-INK produces its materials through a step-by-step process which primarily involves capturing of emissions, separation of carbon from the emissions, and then mixing of this carbon with different types of oils and solutions to achieve advanced material properties. It uses a patented device and technique called 'KAALINK' to carry out the filtration of soot, which contains carbon and other polluting agents like heavy metals and Polycyclic aromatic hydrocarbon.\n","country":"India","industry":"Material Science, Industrial inks","source":"https://en.wikipedia.org/wiki/Air_Ink"},{"id":"1448d6de-df02-474d-a8ff-6c7b329a45d5","name":"Airtel digital TV","description":"Bharti Telemedia Limited d/b/a Airtel digital TV is an Indian direct-broadcast satellite service provider owned and operated by Bharti Airtel.[3] Its satellite service, launched in October 2008, transmits digital satellite television and audio to households in India.[4] It has a total subscriber base of 10.07 million as of 30 March 2015.[5][6]\n","country":"India","industry":"Satellite television","source":"https://en.wikipedia.org/wiki/Airtel_digital_TV"},{"id":"79526edd-38fa-48fd-b5dd-468bf35ffe31","name":"Airtel Payments Bank","description":"Airtel Payments Bank is a public limited company with its headquarters in New Delhi, India. The company is a subsidiary of Bharti Airtel. It is the first company in India to receive a payments bank license from the Reserve Bank of India and it became the first live payments bank in the country.[2] On April 11, 2016 the Reserve Bank of India issued the license under Section 22 (1) of Banking Regulation Act, 1949 to Airtel Payments Bank.[3] Airtel Payments Bank is a joint venture between Bharti Airtel Ltd. and Kotak Mahindra Bank Ltd.. Kotak Mahindra Bank holds 19.9% stake in the Airtel Payments Bank.\n","country":"India","industry":"Financial services","source":"https://en.wikipedia.org/wiki/Airtel_Payments_Bank"},{"id":"a5eb1f49-eb3c-4e18-89c2-97f180b6f658","name":"Alembic Pharmaceuticals Ltd","description":"Alembic Pharmaceuticals Ltd. is an Indian multinational pharmaceutical company headquartered in Vadodara city of Gujarat – India.[2] Alembic Pharmaceuticals Ltd. is involved in manufacture of pharmaceutical products, pharmaceutical substances and intermediates. It is also termed to be a market leader in macrolides segment of anti-infective drugs in India.[2]\n","country":"India","industry":"Pharmaceuticals","source":"https://en.wikipedia.org/wiki/Alembic_Pharmaceuticals_Ltd"},{"id":"8cfc1fd7-7f90-4cf7-9f2e-2dc6ecf00b0f","name":"Alkem Laboratories","description":"Alkem Laboratories is a multinational pharmaceutical company headquartered in Mumbai, Maharashtra that manufactures and sells pharmaceutical generics, formulations and nutraceuticals in India.\n","country":"India","industry":"Pharmaceuticals","source":"https://en.wikipedia.org/wiki/Alkem_Laboratories"},{"id":"69f1ec1b-a4c0-415b-896a-671168a53633","name":"Ambuja Cements","description":"Ambuja Cements Limited, formerly known as Gujarat Ambuja Cement Limited, is an Indian major cement producing company.[3] The Group's market cement and clinker for both domestic and export markets.\n","country":"India","industry":"Cement","source":"https://en.wikipedia.org/wiki/Ambuja_Cements"},{"id":"d04bd945-b241-4cc2-a5cf-16f2faa48923","name":"Amco Batteries","description":"AMCO Batteries Limited is an automobile and commercial Battery manufacturing company headquartered in Chennai, Tamil Nadu.[2][3] It is a part of Rs. 15,000-crore Amalgamations Group, one of India's biggest light engineering groups in India.[4][5] Started in year 1932, today AMCO is the leading supplier of two-wheeler batteries to companies like Honda, Hero Motor Corp, Bajaj Auto, TVS, Yamaha, Royal Enfield, Mahindra Two Wheelers etc. It also supplies four-wheeler batteries to TAFE Tractors, Eicher Tractors, Sonalika Tractors etc. The product profile of AMCO includes Automotive, Inverter, Genset and UPS Batteries. It manufactures wide variety of batteries across all these product categories. AMCO is a market leader in two-wheeler battery segment[citation needed] with most of the two-wheelers coming with AMCO Battery's O.E, fitment. The company also manufactures four-wheeler Batteries with product range consisting of Factory Charged, Dry Charged and Maintenance Free batteries.\n","country":"India","industry":"Battery","source":"https://en.wikipedia.org/wiki/Amco_Batteries"},{"id":"65b04434-9b76-4733-93fa-115f03c91543","name":"Amrapali Jewels","description":"Amrapali Jewels, is a jewellery house founded in the year 1978 by Rajiv Arora and Rajesh Ajmera in Jaipur.[2] Amrapali designs, produces and distributes tribal, fine and uncut gemstone jewellery. The brand has stores in India, Pakistan and London.[3][4][5][6] The brand also operates a museum of Indian jewellery in Jaipur.[7][8]\n","country":"India","industry":"Gems & Jewellery","source":"https://en.wikipedia.org/wiki/Amrapali_Jewels"},{"id":"2de4963d-e03b-4693-8c61-ef49521bb5ad","name":"Amrutanjan Healthcare","description":"Amrutanjan Healthcare Limited is an Indian pharmaceutical company established by Kasinadhuni Nageswara Rao in Mumbai in 1893.\n","country":"India","industry":"Ayurvedic health-care products, beauty products, Informational Technology, Business process outsourcing","source":"https://en.wikipedia.org/wiki/Amrutanjan_Healthcare"},{"id":"2b284d69-c898-418c-a47c-15bb7a16df38","name":"Amul","description":"Amul, is an Indian dairy cooperative society, based at Anand in the state of Gujarat.[3]\nFormed in 1946, it is a cooperative brand managed by a cooperative body, the Gujarat Co-operative Milk Marketing Federation Ltd. (GCMMF), which today is jointly owned by 3.6 million milk producers in Gujarat.[4]\nAmul spurred India's White Revolution, which made the country the world's largest producer of milk and milk products.[5] \n","country":"India","industry":"\nDairy\nFMCG\n","source":"https://en.wikipedia.org/wiki/Amul"},{"id":"0f8f05fb-04bf-4cf9-8534-e4c74d3c81de","name":"Anikspray","description":"Anikspray or Anik Spray was one of the most popular skimmed milk powder brand in India originally developed by Lipton India and later sold to other players.\nThe brand is still active; however, it has lost major market share, due to the fierce competition in the post-1991 liberalization era.\nThe milk powder was made from fresh milk to guarantee instant lump-free mixing when in contact with water. Therefore it became popular in the Indian kitchen, given the convenience and distinct taste - especially, when used to prepare Chai (Indian milk tea) as an easy replacement to fresh milk.[1][2]\n","country":"India","source":"https://en.wikipedia.org/wiki/Anikspray"},{"id":"dc693653-3531-4050-8731-2d71b303f280","name":"Anokhi","description":"Anokhi (Hindi for \"remarkable\" or \"unique\") is an Indian retailer based in Jaipur, Rajasthan, which retails textiles, clothing, furnishings and accessories, made with traditional Indian motifs and techniques.[1] It was founded in 1970 by husband and wife, John and Faith Singh, with a focus on reviving traditional Rajasthani hand-block or woodcut printing techniques, and the use of natural vegetable dyes.[2] In the 1970s, Anokhi helped revive traditional Rajasthani block-printing, which was then in decline due to industrialisation and the proliferation of machine-made garments.[3][4][5] Anokhi works directly with Rajasthani craftspeople, and retails through its 25 stores in India and a few stockists in Europe and the United States.\n","country":"India","industry":"Textiles, Home furnishings, handloom apparel, jewellery","source":"https://en.wikipedia.org/wiki/Anokhi"},{"id":"bea56045-a8f5-4164-9d7a-28cc6a5741b3","name":"Apollo Tyres","description":"Apollo Tyres Ltd is the world's seventh largest tyre manufacturer, with annual consolidated revenues of ₹172.76 billion (US$2.46 billion) in March 2018.[4] It was incorporated in 1972. Its first plant was commissioned in Perambra, Thrissur, Kerala, India. The company now has four manufacturing units in India, one in Netherlands[5]  and one in Hungary.[6] It has a network of nearly 5,000 dealerships in India, of which over 2,500 are exclusive outlets.\n","country":"India","industry":"Tyres","source":"https://en.wikipedia.org/wiki/Apollo_Tyres"},{"id":"cc435d52-8352-4402-b86d-2306d0c86b5e","name":"Arise India","description":"Arise India Ltd. is a manufacturer of electrical goods based in Delhi, India and provides a range of consumer electronics. The company deals with a variety of products including televisions, inverters (UPS and sinewave), water pumps (monobloc, submersible, and centrifugal), home and kitchen appliances (mixer grinder, induction cook tops, juicer mixer grinders, water heaters, and smart Android based televisions.\n","country":"India","industry":"Consumer Electronics","source":"https://en.wikipedia.org/wiki/Arise_India"},{"id":"9a3351d7-a018-43fd-ad66-46e285d678e0","name":"Arre (brand)","description":"Arré (/ɑːreɪ/) (stylized as Arré) is an Indian OTT platform based in Mumbai.[3] It produces and publishes videos, audio series, web series, documentaries, text and doodles through its online channel.[4] Founded by former Network 18 and TV 18 executives B. Sai Kumar, Ajay Chacko, and Sanjay Ray Chaudhari, it is a content-based startup and was launched in April 2016.[5][1]\n","country":"India","industry":"Entertainment, Infotainment, digital content","source":"https://en.wikipedia.org/wiki/Arre_(brand)"},{"id":"fb41687a-6b65-47ac-8526-625ee3a98350","name":"Ashok Leyland","description":"Ashok Leyland is an Indian automobile company headquartered in Chennai, India. It is owned by the Hinduja Group.[3]\n","country":"India","industry":"Automotive Commercial","source":"https://en.wikipedia.org/wiki/Ashok_Leyland"},{"id":"76864c2a-0bb8-4ba5-b1ad-e35b8cb44037","name":"Asia MotorWorks","description":"Asia Motor Works Ltd (AMW) is an Indian automotive company that manufactures commercial vehicles, auto components, fully built vehicles and forged components. Founded in 2002, AMW has won Commercial Vehicle (CV) of the year 2008 from NDTV Profit Car and Bike Awards[3] & \"CV Innovation of the Year\" for 2010 from CV Magazine & Zee Business News.[4]\n","country":"India","industry":"Automotive and auto-components","source":"https://en.wikipedia.org/wiki/Asia_MotorWorks"},{"id":"9e42266b-a0e6-4c5e-a4d1-07c53748eb38","name":"Asian Paints","description":"Asian Paints Limited, (BSE: 500820, NSE: ASIANPAINT) is an Indian multinational paint company headquartered in Mumbai, Maharashtra.[2] The company is engaged in the business of manufacturing, selling and distribution of paints, coatings, products related to home decor, bath fittings and providing of related services. Asian Paints is India's largest and Asia's third largest paints corporation.[3][4][5] As of 2015, it has the largest market share with 54.1% in the Indian paint industry.[6] Asian Paints is the holding company of Berger International.[7]\n","country":"India","industry":"Chemicals","source":"https://en.wikipedia.org/wiki/Asian_Paints"},{"id":"e58137ef-9dc7-40e2-9e14-044e5ead2983","name":"Aurobindo Pharma","description":"Aurobindo Pharma Limited is a pharmaceutical manufacturing company headquartered in HITEC City, Hyderabad, India. The company manufactures generic pharmaceuticals and active pharmaceutical ingredients. The company’s area of activity includes six major therapeutic/product areas: antibiotics, anti-retrovirals, cardiovascular products, central nervous system products, gastroenterologicals, and anti-allergics.[3] The company markets these products in over 125 countries.[3] Its marketing partners include AstraZeneca[4] and Pfizer.[5]\n","country":"India","industry":"Pharmaceuticals","source":"https://en.wikipedia.org/wiki/Aurobindo_Pharma"},{"id":"2fd10fe0-24ab-4f46-82e5-10285a2775bd","name":"Axis Bank","description":"Axis Bank is the third-largest[citation needed] Indian bank offering a wide assortment of financial products. The bank has its head office in Mumbai, Maharashtra. It has 4,800 branches, 17,801 ATMs and 4,917 cash recyclers spread across the country as of 31 March 2020 and nine international offices. The bank employs over 1,30,000 people and had a market capitalization of ₹2.31 trillion (US$32 billion) (as on 31 March 2020).[5] It sells financial services to large and mid-size corporates, SME and retail businesses.[1]\n","country":"India","industry":"Finance, banking industry, financial services ","source":"https://en.wikipedia.org/wiki/Axis_Bank"},{"id":"d325ceaa-0b16-4251-bb99-dec7102e3b68","name":"Axis Forex Online","description":"Axis Forex is an online money transfer service by the Axis Bank that provides outward remittance services.[1][2]\n","country":"India","source":"https://en.wikipedia.org/wiki/Axis_Forex_Online"},{"id":"7c3dcc5b-4643-4783-a8df-4002b5573f51","name":"Babool (brand)","description":"\n\nBabool is a toothpaste brand which was launched in India by Balsara Hygiene in 1987.[1] Babool is made from the bark of the Babool tree, which has traditionally been used to clean teeth in India.[2] The brand was positioned as an economic toothpaste with the tagline \"Babool Babool paisa vasool\".[3] Babool was relaunched with the tagline \"Begin a great day, the Babool way\" in 2002, when Babool was Balsara's biggest brand.[2] In 2005, Babool was sold by Balsara to Dabur along with other Balsara toothpaste brands Promise and Meswak in a ₹1.43 billion (US$20 million) deal.[4][5] As of 2007, the Babool brand was valued at ₹1 billion (US$14 million).[6]\n","country":"India","source":"https://en.wikipedia.org/wiki/Babool_(brand)"},{"id":"1b833335-aeb5-4c0d-8e9a-b9060521639b","name":"Bajaj Auto","description":"Bajaj Auto Limited is an Indian global two-wheeler company and three-wheeler manufacturing company based in Pune, Maharashtra.[2] It manufactures motorcycles, scooters and auto rickshaws. Bajaj Auto is a part of the Bajaj Group. It was founded by Jamnalal Bajaj in Rajasthan in the 1940s. It is based in Pune, Maharashtra, with plants in Chakan (Pune), Waluj (near Aurangabad) and Pantnagar in Uttarakhand.[3] The oldest plant at Akurdi (Pune) now houses the R&D centre 'Ahead'.\n","country":"India","industry":"Automotive","source":"https://en.wikipedia.org/wiki/Bajaj_Auto"},{"id":"f27ab9f9-33a7-42eb-a920-c5365292c790","name":"Bajaj Consumer Care","description":"Bajaj Consumer Care Ltd.(Formerly known as Bajaj Corp Ltd.) (Marathi: बजाज कंझ्युमर लिमिटेड) is an Indian consumer goods company with major brands in hair care. It is part of the Bajaj Group, founded by Jamnalal Bajaj.  Bajaj Group has interests in varied industries including Sugar, Consumer Goods, Power Generation and Infrastructure Development.\n","country":"India","industry":"Consumer goods,","source":"https://en.wikipedia.org/wiki/Bajaj_Consumer_Care"},{"id":"9f3ec6e8-eda9-441e-9747-82cc2b209740","name":"Bajaj Nomarks","description":"Bajaj Nomarks is an Indian beauty brand of skin-care products, established and headquartered in Mumbai, India.[1][2][3] Founded in 2001, the product range includes  anti-marks creams, face washes, scrubs, sunscreen, soaps, and face packs for the consumer and professional markets.[4][5] The brand was initially launched as Nomarks by Ozone Ayurvedics, which was later acquired by Bajaj Corp in 2013 to enter the skin care industry.[6][7] As of 2017, the brand is available in more than 37 countries includes SAARC, Gulf & Middle-East, ASEAN and African regions. It is sold in over 2 lakhs outlets in India.[8]\n","country":"India","source":"https://en.wikipedia.org/wiki/Bajaj_Nomarks"},{"id":"31f22ee6-6b36-4f4c-a3b7-e18620c2b11a","name":"Bakeys","description":"Bakeys (sometimes also known as Bakey's) is an Indian edible cutlery manufacturing startup company based in Hyderabad, Telangana.[1][2] Bakeys was founded in 2010 by former ICRISAT researcher Narayana Peesapaty as an eco-friendly alternative to disposable utensils prepared with plastic, wood and bamboo, such as bamboo chopsticks.[3][4]\n","country":"India","industry":"Food, tableware","source":"https://en.wikipedia.org/wiki/Bakeys"},{"id":"04c7146f-152f-4bf6-bdab-f70b954bffa6","name":"Balaji Wafers","description":"Balaji Wafers and Namkeen group, based in Rajkot, Gujarat, India, manufactures and distributes potato chips and other grain-based bagged snacks in various flavours.[3] Started as a micro-business, it has evolved into a ₹2,000 crore (US$280 million) company of products with an indigenous taste.[4]\n","country":"India","industry":"Food products","source":"https://en.wikipedia.org/wiki/Balaji_Wafers"},{"id":"9005f5f5-55c6-4c2e-b9e6-d37df6f8dfee","name":"Balkrishna Industries","description":"Balkrishna Industries Limited (BKT) is a tire manufacturing company based in Mumbai, India. Balkrishna Industries manufactures off-highway tires used in specialist segments like mining, earthmoving, agriculture and gardening in five factories located in Aurangabad, Bhiwadi, Chopanki, Dombivali and Bhuj. In 2013, it was ranked 41st among the world’s tire makers.[4]\n","country":"India","industry":"Auto and Truck parts","source":"https://en.wikipedia.org/wiki/Balkrishna_Industries"},{"id":"86b9e0b0-964b-436d-8dd9-fee0a199f0cf","name":"Banas Dairy","description":"Coordinates: 24°08′09″N 72°26′27″E﻿ / ﻿24.135827°N 72.440929°E﻿ / 24.135827; 72.440929\n","country":"India","industry":"Milk and milk items","source":"https://en.wikipedia.org/wiki/Banas_Dairy"},{"id":"5acaab5c-23f4-43b9-b6ff-ecd9d4f6d759","name":"Bank of Baroda","description":"Bank of Baroda (BOB) is an Indian Multinational, public sector Banking and financial services company.  It is the third largest public sector bank in India.[6] with a business mix of close to US$225 billion.\n","country":"India","industry":"BankingFinancial services","source":"https://en.wikipedia.org/wiki/Bank_of_Baroda"},{"id":"e3cbf449-d44c-45a1-a173-04e7e255d0e4","name":"Bellatrix Aerospace","description":"\n\nBellatrix Aerospace is a private Indian aerospace manufacturer and smallsat launcher headquartered in Bangalore, India. The company was established in 2015.[1] They are planning the first launch of their Chetak rocket in 2023[2]. The two-stage Chetak rocket is powered by a number of their own Aeon engines. The Chetak rocket will use liquid methane as fuel.[3]\nRecently they have reported plans to use water as fuel.[1] \n","country":"India","source":"https://en.wikipedia.org/wiki/Bellatrix_Aerospace"},{"id":"7368d9e7-b56d-43fb-92c3-0c82f8832613","name":"BEML Limited","description":"\n\nCoordinates: 12°58′17″N 77°39′34″E﻿ / ﻿12.971403°N 77.659518°E﻿ / 12.971403; 77.659518\n","country":"India","industry":"Mining & Construction, Defence, Rolling stock","source":"https://en.wikipedia.org/wiki/BEML_Limited"},{"id":"21767cd7-e6ce-4f20-81e7-b81c55026256","name":"Berger Paints","description":"\n\n","country":"India","industry":"Paints","source":"https://en.wikipedia.org/wiki/Berger_Paints"},{"id":"0777ba7f-9ef0-4e94-816d-01d9fe324238","name":"Bharat Aluminium Company","description":"Bharat Aluminium Company Ltd. (BALCO) is an Indian aluminium company. BALCO was incorporated in the year 1965 as a Public Sector Undertaking (PSU) and it was the Public sector until 2001, when it was taken over by Vedanta Resources, a company listed on the London Stock Exchange. The Company has been closely associated with the Indian Aluminium Industry, in a pivotal role. Mr. Vikas Sharma is the current CEO & Whole Time Director of the company.[1]\n","country":"India","source":"https://en.wikipedia.org/wiki/Bharat_Aluminium_Company"},{"id":"e8ff58b7-399c-4970-bb08-1a8ac30441c6","name":"Bharat Heavy Electricals Limited","description":"Bharat Heavy Electricals Limited (BHEL) owned and founded by the Government of India, is an engineering and manufacturing company based in New Delhi, India. Established in 1964, BHEL is India's largest power generation equipment manufacturer. As of 2020 BHEL's revenue stood at ₹22,066.64 crore (US$ 3.1 billion) and their net income stood at ₹-1,472.97 (US$ -210 million).\n","country":"India","industry":"Electrical equipments","source":"https://en.wikipedia.org/wiki/Bharat_Heavy_Electricals_Limited"},{"id":"d3ff3133-1b33-426d-a4d4-d3a774daab0a","name":"Bharat Petroleum","description":"History:\n\n \n","country":"India","industry":"Oil and Gas","source":"https://en.wikipedia.org/wiki/Bharat_Petroleum"},{"id":"3c8f2256-4266-4406-a316-c9f33516fe69","name":"Bharti Airtel","description":"Bharti Airtel Limited, also known as Airtel, is an Indian global telecommunications services company based in New Delhi, India. It operates in 18 countries across South Asia and Africa, and also in the Channel Islands. Airtel provides GSM, 3G, 4G LTE, 4G+ mobile services, fixed line broadband and voice services depending upon the country of operation. Airtel had also rolled out its VoLTE technology across all Indian telecom circles.[8] It is the third largest mobile network operator in India and the second largest mobile network operator in the world with over 411.42 million subscribers.[3][4][5] Airtel was named India's 2nd most valuable brand in the first ever Brandz ranking by Millward Brown and WPP plc.[9]\n","country":"India","industry":"Telecommunications","source":"https://en.wikipedia.org/wiki/Bharti_Airtel"},{"id":"dbc0f674-78af-463d-88c3-d1f660e3ab77","name":"Bhima Jewellers","description":"Bhima Jewellers is a jewellery retail company based in India. It was established by late Sri Bhima Bhattar in the year 1925.[2] Currently the group has 36 jewellery shops[3]  across South India and with a work-force greater than 2000 people. Bhima Jewellers were the first jewellery store to introduce ready made jewellery concept under the guidance of its founder Bhima Bhattar.[4]\n","country":"India","industry":"Jewelers","source":"https://en.wikipedia.org/wiki/Bhima_Jewellers"},{"id":"80e48c80-fcc9-4ef3-b023-2256db4486c2","name":"Biba Apparels","description":"Biba Apparels is an Indian fashion brand for women and girls founded by Meena Bindra in 1988 from her home in New Delhi, India.[1][2][3] It has more than 150 brand outlets and 225 multi-brand outlets.[citation needed] Biba recorded sales of INR 600 crore in 2014-15.[3]\n","country":"India","industry":"Fashion","source":"https://en.wikipedia.org/wiki/Biba_Apparels"},{"id":"47bd1667-57bb-4235-8a01-a92fee41f192","name":"Binaca (brand)","description":"Binaca is an oral hygiene brand that is marketed in India and owned by Dabur.[1]\n","country":"India","source":"https://en.wikipedia.org/wiki/Binaca_(brand)"},{"id":"7c397bdd-39c5-4d03-9307-8a8ca83c85d9","name":"Biocon","description":"Biocon Limited is an Indian biopharmaceutical company based in Bangalore, India.[2] The Company manufactures generic active pharmaceutical ingredients (APIs) that are sold in over 120 countries [no proof provided] across the globe, including the developed markets of the United States and Europe.[2] It also manufactures novel biologics, as well as, biosimilar insulins and antibodies, which are sold in India as branded formulations. Biocon's biosimilar products are also sold in both bulk and formulation forms in several emerging markets [provide reference]. In research services, Syngene International Limited (Syngene), a publicly listed subsidiary of Biocon.\n","country":"India","industry":"Biotechnology","source":"https://en.wikipedia.org/wiki/Biocon"},{"id":"6fd8a955-2509-4657-b615-42f16afb975b","name":"Birla Tyres","description":"\nBirla Tyres, a division of Kesoram Industries Limited,[1] was first established in 1991.[2] They manufacture tyres[3] for automobiles, motorcycles, commercial vehicles, farm vehicles and heavy earth-moving machinery.[4]\n","country":"India","industry":"Tyres","source":"https://en.wikipedia.org/wiki/Birla_Tyres"},{"id":"daa77760-a839-46f2-9d1f-34321d754471","name":"Bisk Farm","description":"Bisk Farm is a brand which is owned by SAJ Food Products (P) Ltd, a part of the Aparna Group of Companies. It is a fast-moving consumer goods (FMCG) company, headquartered in the city of Kolkata in the Indian State of West Bengal.\n","country":"India","industry":"Manufacturing","source":"https://en.wikipedia.org/wiki/Bisk_Farm"},{"id":"8931619a-37c4-4445-a8af-0239e2b870d5","name":"Bisleri","description":"Bisleri International is an Indian brand bottled water formed in 1969 by Jayantilal Chauhan and Felice Bisleri.  Bisleri conducts its major businesses in India, with 135 operational plants and a network of 3000 distributors & 5000 distribution trucks.[3] The company conducts business across India and neighbouring countries. The company sells bottled water and flavoured drinks.\n","country":"India","industry":"Beverages","source":"https://en.wikipedia.org/wiki/Bisleri"},{"id":"af9434ac-861b-4a09-bc28-71cc28f23104","name":"Blue Dart Express","description":"Blue Dart Express, is an Indian Logistics Company providing courier delivery services.[1][2][3] It is headquartered in Mumbai, Maharashtra.[4] It has a subsidiary cargo airline, Blue Dart Aviation that operates in South Asian countries.[5]\nIn 2002, Blue Dart had a business alliance with DHL Express and on 8 November 2004, DHL Express invested €120 million in it, and since then has been a major shareholder in the company.[6][7][8]\n","country":"India","industry":"Courier","source":"https://en.wikipedia.org/wiki/Blue_Dart_Express"},{"id":"62275418-efd4-484b-8909-e5bf57c9b0ab","name":"Blue Star (company)","description":"Blue Star Limited is a company specialising in designing, developing, manufacturing and marketing a wide variety of products in the air conditioning and commercial refrigeration industry and is headquartered in Mumbai, India. It is the country's second largest homegrown player in the air conditioning space.[4]\n","country":"India","industry":"Air Conditioning and Refrigeration","source":"https://en.wikipedia.org/wiki/Blue_Star_(company)"},{"id":"a2406c5e-4331-48e0-a29a-2f1d3f3f55b3","name":"Boroline","description":"Boroline is an over the counter antiseptic perfumed cream sold in India. The product was launched in 1929[2] in Kolkata by Gourmohan Dutta,[3] a Bengali merchant. Over the years, the brand's popularity soared, and it became an icon of national economic self-sufficiency in a nation that was still under the British rule. It is still one of the most popular brands in India.\n","country":"India","source":"https://en.wikipedia.org/wiki/Boroline"},{"id":"875cbe24-9360-4a67-a3ba-42014927c060","name":"Borosil","description":"Borosil Glass Works Ltd. (BGWL) is an Indian glassware company based in Mumbai. The company is one of the largest glassware producing companies in India with a significant presence in USA and Netherlands.\n","country":"India","industry":"Houseware","source":"https://en.wikipedia.org/wiki/Borosil"},{"id":"2092a02a-e236-4630-a97d-caf6552a8802","name":"Bovonto","description":"Bovonto is a soft drink popular in Tamil Nadu, India.\n","country":"India","source":"https://en.wikipedia.org/wiki/Bovonto"},{"id":"ef01e48b-a9d0-4879-b15e-e86bf3344e8e","name":"BPL Group","description":"British Physical Laboratories, doing business as BPL Ltd., is an Indian electronics company. It makes health care equipment. It was founded in 1963 in Palakkad, Kerala, and is headquartered at Bangalore, Karnataka.\n","country":"India","industry":"Electronics","source":"https://en.wikipedia.org/wiki/BPL_Group"},{"id":"b8795acd-001c-4dd4-92d8-ccaec290f1d7","name":"Brand India","description":"\nBrand world India is a phrase used to describe the campaign India is using to attract business. Basically the campaign is to project the attractiveness of India as an emerging destination for business in the fields of service sector, manufacturing, information technology, infrastructure, information technology enabled services, etc. The campaign uses both India as market for products and services as well as a destination for investment. The federal government is spearheading the campaign.\n","country":"India","source":"https://en.wikipedia.org/wiki/Brand_India"},{"id":"0c5f72fb-7d63-469f-aae8-96b8ba390181","name":"Brihan Maharashtra Sugar Syndicate Ltd.","description":"The Brihan Maharashtra Sugar Syndicate Ltd. is an Indian sugar company headquartered in Pune, India.\n","country":"India","industry":"Sugar, liquor, metal printing, ayurvedic products, health care products, real estate","source":"https://en.wikipedia.org/wiki/Brihan_Maharashtra_Sugar_Syndicate_Ltd."},{"id":"5e2d87be-e11c-4778-b59a-41e52dd1793a","name":"Brihans Natural Products","description":"Brihans Natural Products Ltd. is an Indian natural cosmetics and consumer products company based in Shaniwar Peth, Pune, Maharashtra, India. The company manufactures skin care, hair care and health care products.[2]\n","country":"India","industry":"Natural products","source":"https://en.wikipedia.org/wiki/Brihans_Natural_Products"},{"id":"63841107-8d96-4021-8f80-d1b2bd3d9bbb","name":"Britannia Industries","description":"Britannia Industries Limited is an Indian food-products corporation. Founded in 1892 and headquartered in Kolkata, it is one of India's oldest existing companies. It is now part of the Wadia Group headed by Nusli Wadia. The company sells its Britannia and Tiger brands of biscuits, breads and dairy products throughout India and in more than 60 countries across the world.[2] Beginning with the circumstances of its takeover by the Wadia group in the early 1990s, the company has been mired in several controversies connected to its management. However, it enjoys a large market share and is exceedingly profitable.\n","country":"India","industry":"Food processing","source":"https://en.wikipedia.org/wiki/Britannia_Industries"},{"id":"58f5f584-9576-4536-9559-838a59441ebe","name":"Cadila Pharmaceuticals","description":"Cadila Pharmaceuticals is a multinational research based pharmaceutical group in India with more than 6 decades of experience. Company's integrated operations covers entire gamut from manufacturing products ranging from API's-Intermediates, finished formulations, OTC-Food Supplements, Biotechnology Products and pharmaceutical Machinery. Cadila Pharmaceuticals manufacturing facilities are approved by most stringent International bodies like WHO-GMP, UK-MHRA, USFDA-API, TGA-Australia, and AIFA-Italy. International operation of Cadila Pharmaceuticals is spread across 58 countries including Americas, Japan, Asia, CIS and Africa.[1]\n","country":"India","industry":"Pharmaceuticals","source":"https://en.wikipedia.org/wiki/Cadila_Pharmaceuticals"},{"id":"92c2dc6e-63cf-4813-891a-b54a07e0ef26","name":"Café Coffee Day","description":"Café Coffee Day (CCD) is an Indian café chain. It is a subsidiary of Coffee Day Enterprises Limited. Coffee Day serves 1.6 billion cups of coffee annually in six countries. Internationally, CCDs are present in Austria, Czech Republic, Malaysia, Nepal and Egypt.[2]\n","country":"India","industry":"Coffeehouse","source":"https://en.wikipedia.org/wiki/Caf%C3%A9_Coffee_Day"},{"id":"8eb2972d-a9f4-4885-9503-ff2d52ea3f1f","name":"Camlin Fine Sciences","description":"Camlin Fine Sciences Ltd. was formerly known as Camlin Fine Chemicals Ltd. CFS produces chemical substance to improve the shelf life of food and other products[clarification needed], aroma compounds, and performance chemicals. Led by Mr. Ashish Dandekar, currently serving as Managing Director in the organisation, CFS has emerged as the largest producer of food antioxidants like TBHQ tert-Butylhydroquinone and BHA Butylated hydroxyanisole and is also one of the world's leading Vanillin producer.[3][4]\n","country":"India","industry":"Speciality chemicals","source":"https://en.wikipedia.org/wiki/Camlin_Fine_Sciences"},{"id":"876806aa-d1a6-447d-85e0-5fdffaa4ad4e","name":"CEAT (company)","description":"Cavi Electrici e Affini Torino, commonly known by the abbreviation CEAT, is the flagship company of RPG Group. It was established in 1924 in Turin, Italy. As of date, CEAT is one of India's leading tyre manufacturers and has presence in global markets. CEAT produces over 165 million tyres a year and manufactures tyres for passenger cars, two-wheelers, trucks and buses, light commercial vehicles, earth-movers, forklifts, tractors, trailers, and auto-rickshaws.The current capacity of CEAT tyres' plants is over 800 tonnes per day.[3]\n","country":"India","industry":"Tyres & Tubes","source":"https://en.wikipedia.org/wiki/CEAT_(company)"},{"id":"71c41437-876c-496a-9da4-ef7776ce1399","name":"Celkon","description":"Celkon was a mobile phone manufacturing company in India based at Hyderabad. It manufactured dual-sim smartphones, feature phones and tablets..[1] Its smartphones were sold under two brands: CAMPUS and a high-end series MILLENNIA.\n","country":"India","industry":"Telecommunications, Consumer Electronics","source":"https://en.wikipedia.org/wiki/Celkon"},{"id":"53d4dc7a-c308-4b6b-aec9-efe169ce5444","name":"Century Plyboards","description":"Century Plyboards (India) Ltd. is an Indian manufacturer, seller and exporter of plywoods and veneers.[1][2][3][4] The company offers plywood products under the brand name, Century Ply, and exports its range of products to over 20 countries.[5] Spread into a 6.6 acre area, its ISO 9002 plant is located at Bishnupur, near Joka, Kolkata. It has also started the commercial production of MDF (Medium Density Fibre) at its newly set-up unit at Punjab. Century Ply (Singapore) Pte. Ltd., a subsidiary of Century Plyboards, has also acquired 49% stake in Huesoulin Wood Processing Factory Co. Ltd., making it as its associate company.[6]\n","country":"India","industry":"Plywood and Veneers","source":"https://en.wikipedia.org/wiki/Century_Plyboards"},{"id":"cf1c4c98-2c3f-4ee6-8add-363c83920a20","name":"Changalikodan","description":"Changalikodan Nendran Banana or famously known as Changalikodan is a banana variety originated and cultivated in Chengazhikodu village of Thrissur District in Kerala state of India.  Changalikodan, now are cultivated on the banks of the Bharathapuzha river. It is grown in Erumapetty, Wadakkancherry, Mundoor, Kaiparambu, Desamangalam and Thayyur of Thrissur District. It is the Kaazhchakula to the presiding deity of the Guruvayur Temple Sree Krishna Temple. The average bunch bears 20 to 25 fruits per hand. Newly, bananas are being brought from Honolulu. In Honolulu they use them as flavor for the traditional American dish - hamburger, and of course for Coca-Cola mustard type bottles. Changalikodan got Geographical indication registration from the Geographical Indications Registry, Chennai.[1] The Chengalikodan Banana Growers’ Association, Erumapetty, was given the registration.\n","country":"India","source":"https://en.wikipedia.org/wiki/Changalikodan"},{"id":"cfb0b9fe-ab2c-4832-934b-54e82de4e731","name":"Chelpark","description":"Chelpark Company Private Ltd. is an Indian manufacturing company of stationery products. Based in Bangalore, Chelpark is one of the oldest manufacturers of fountain pen ink in the country.[4] The company is located in Bangalore, Karnataka.\n","country":"India","industry":"Stationery","source":"https://en.wikipedia.org/wiki/Chelpark"},{"id":"7ead2b87-7f39-4a98-abfc-d89293f51c08","name":"Ching's Secret","description":"Ching’s Secret is an Indian brand of Indian Chinese cuisine aka Desi Chinese cuisine with products which include instant noodles, instant soups, cook up soups, Desi Chinese masala, sauces and schezwan chutney.[1][2] Ching's Secret is owned by Capital Foods Pvt. Ltd.[1][3]\n","country":"India","industry":"Food Manufacture","source":"https://en.wikipedia.org/wiki/Ching%27s_Secret"},{"id":"c9ce0838-26c4-451b-a681-671d3db6ef90","name":"Chinkara Motors","description":"Chinkara Motors, officially Chinkara Motors PVT Ltd, is a Mumbai, Maharashtra-based auto, marine, ATV and aviation manufacturer.\n","country":"India","industry":"automotive, marine, aviation, ATV","source":"https://en.wikipedia.org/wiki/Chinkara_Motors"},{"id":"97873a39-563c-461c-9df3-ae61de32f528","name":"Chlormint","description":"Chlormint is a product line of chewing gum and breath mint candies made by Perfetti Van Melle, India.  It was used in a show called \"Deal Ya No Deal\" as one of the prizes, and it was a best mint selling company in India at its time.[clarification needed]\n","country":"India","source":"https://en.wikipedia.org/wiki/Chlormint"},{"id":"12d195bd-1bbe-4ebb-8c5c-2a346177a236","name":"Cibaca (brand)","description":"Cibaca is an oral hygiene brand in India. Originally owned by Ciba Geigy which marketed Cibaca toothpastes and toothbrushes, the brand was bought by Colgate-Palmolive in 1994.[1] After the acquisition, Colgate relaunched the brand as Colgate Cibaca to indicate the change of ownership.[2] The brand is strong in rural India, where it sells in high volumes.[3]\n","country":"India","source":"https://en.wikipedia.org/wiki/Cibaca_(brand)"},{"id":"45cb5248-8ff4-4e53-8b62-1a332207cbbd","name":"Cipla","description":"Cipla Limited is an Indian multinational pharmaceutical and biotechnology company, headquartered in Mumbai, India. Cipla primarily develops medicines to treat respiratory, cardiovascular disease, arthritis, diabetes, weight control and depression; other medical conditions.[2]\n","country":"India","industry":"Pharmaceuticals","source":"https://en.wikipedia.org/wiki/Cipla"},{"id":"3c87f928-f3a5-4bb9-9156-7ff3d5c993a4","name":"Classmate Stationery","description":"Classmate is an Indian brand of student stationery products. ITC Limited (formerly Indian Tobacco Company) launched its Classmate brand in 2003 with the notebooks category. Subsequently, Classmate added pens, pencils, mechanical pencils and geometry boxes to its portfolio.\n","country":"India","industry":"Consumer goods","source":"https://en.wikipedia.org/wiki/Classmate_Stationery"},{"id":"ffe4687a-95e6-44c9-8def-bced865afaee","name":"Cords Cable Industries Limited","description":"Cords Cable Industries Limited (BSE: 532941, NSE: CORDSCABLE, ISIN: INE792I01017) is the largest instrumentation cable maker in India.[1]\n","country":"India","source":"https://en.wikipedia.org/wiki/Cords_Cable_Industries_Limited"},{"id":"a03b757c-afa5-40a8-9c48-fb29332c870c","name":"Cosco (India) Limited","description":"Cosco (India) Ltd. is an Indian Sports Equipment Manufacturer based in Delhi.[4]\n","country":"India","industry":"Sports & Fitness Equipments","source":"https://en.wikipedia.org/wiki/Cosco_(India)_Limited"},{"id":"357cc7aa-e6fa-4ca6-9663-b55c8f54523c","name":"CREO","description":"CREO is an Indian technology company based in Bangalore that designs, develops and sells consumer electronics and is in the business of licensing operating systems.[1]  Its hardware products include the streaming media dongle Teewe and the smartphone Mark 1 that operates on a proprietary Android based operating system called Fuel OS that updates itself every month by building features from ideas and suggestions given by its community of users.[2]\n","country":"India","industry":"Consumer electronics","source":"https://en.wikipedia.org/wiki/CREO"},{"id":"a4d352e0-7dd0-4baf-92dc-8f6cf1d59ed7","name":"Cromā","description":"Cromā  is an Indian retail chain for consumer electronics and durables. Infiniti Retail, a subsidiary of the Tata Group, runs Cromā stores in India.[2][3] \nPresently, there are a total of 142 Cromā stores in 32 cities in India.\n","country":"India","industry":"Retail","source":"https://en.wikipedia.org/wiki/Crom%C4%81"},{"id":"bdb1b9e1-ffeb-4c57-a1f0-881e714b205a","name":"Cyient","description":"Cyient Limited (formerly Infotech Enterprises Limited) is focused on engineering, manufacturing, data analytics, and networks & operations. Infotech Enterprises Ltd. was established in 1991 in Hyderabad, India.[1] Infotech Enterprises was re-branded Cyient in 2014 and featured among the top 30 outsourcing companies in the world as of 2018.[2]\n","country":"India","industry":"Aerospace & Defence,Consumer, CYIENT DLM , EnergyTransportation, Communications,Utilities, Medical, Navigation, Mining, Oil & Gas, Off-Highway,Semiconductors.","source":"https://en.wikipedia.org/wiki/Cyient"},{"id":"f1b49a6e-3a7f-4b35-b04f-2d20e4d98db9","name":"D2h","description":"d2h  is an Indian direct broadcast satellite service provider owned by Dish TV and Videocon. As of December 31, 2017, d2h has a market share of 19% among the pay DTH operators.[3] Dish TV India and d2h merger has been concluded, which has created the largest DTH service provider in the country with a subscriber base of about 29 million.[4][5]\n","country":"India","industry":"Satellite television","source":"https://en.wikipedia.org/wiki/D2h"},{"id":"0aa4ef02-0cc1-4090-9b04-955d4e9aceb3","name":"Dabur","description":"Dabur (derived from Daktar Burman)[4][5] is an Indian consumer goods company founded in 1884 by S. K. Burman. It manufactures Ayurvedic medicine and natural consumer products.[6] It is one of the largest fast-moving consumer goods companies in India.[7]\n","country":"India","industry":"Consumer goods","source":"https://en.wikipedia.org/wiki/Dabur"},{"id":"9c455654-5a25-403e-be6f-0ced478914fc","name":"Dalda","description":"Dalda is a brand of hydrogenated vegetable oil popular in South Asia.\n","country":"India","source":"https://en.wikipedia.org/wiki/Dalda"},{"id":"55e38bcb-f635-4d4d-8fe9-4412d3b72524","name":"Delhivery","description":"Delhivery is a supply chain service provider  encompassing over 18,000 PIN Codes in India.[3] It was founded in 2011 by Sahil Barua, Mohit Tandon, Bhavesh Manglani, Suraj Saharan, and Kapil Bharati and is backed by the Carlyle Group, Tiger Global, Fosun International, SoftBank Vision Fund[4], Nexus Venture Partners[5], Multiples[6], and CCP Investment Board as investors. The Gurugram-based company has 75 fulfilment centres, 24 automated sort centres, 70 hubs, 2,500+ delivery centres, 8000+ partner centres, 14000+ vehicles, and 40,000+  employees. At present, Delhivery has the capacity to process more than 1M+ parcels per day[7].\n","country":"India","industry":"Courier/Supply Chain","source":"https://en.wikipedia.org/wiki/Delhivery"},{"id":"ba0d9cb6-21e3-445d-a826-9d859ab9402a","name":"Dipper (brand)","description":"Dipper is an Indian condom brand marketed by Tata Motors and Rediffusion Y&R to promote safe sex among truck drivers in India. Manufactured by HLL Lifecare, it is part of an award-winning AIDS awareness campaign that was initiated by Tata. The name, \"Dipper\", was inspired by the iconic message, \"Use Dipper at Night\" (meaning the recommended usage of dim headlights at night) - that are painted at the back of inter- as well as intrastate trucks in India.\n","country":"India","industry":"Condoms","source":"https://en.wikipedia.org/wiki/Dipper_(brand)"},{"id":"e26321f8-7170-46ec-9faa-915d9ffcfbfd","name":"Dish TV","description":"DishTV India (stylised as dishtv) is an Indian direct broadcast satellite service provider in India owned and operated by the Zee Group and the Videocon Group. DishTV was launched by the Zee Group on 2 October 2003. It ranked # 437 and # 5 on the list of media companies in Fortune India 500 roster of India's largest corporations in 2011.[3] Dish TV was also voted India's most trusted DTH brand according to the Brand Trust Report 2014, a study conducted by Trust Research Advisory.[4][5] On 22 March 2018, Dish TV completed a merger with Videocon d2h, creating the largest DTH provider in India.\n","country":"India","industry":"Satellite television","source":"https://en.wikipedia.org/wiki/Dish_TV"},{"id":"38cb9160-4488-42cf-9634-95a61565807e","name":"Dr. Reddy's Laboratories","description":"Dr. Reddy's Laboratories is a multinational pharmaceutical company. The company was founded by Anji Reddy, who  previously worked in the mentor institute Indian Drugs and Pharmaceuticals Limited, of Hyderabad, India.[2] Dr. Reddy's manufactures and markets a wide range of pharmaceuticals in India and overseas. The company has over 190 medications, 60 active pharmaceutical ingredients (APIs) for drug manufacture, diagnostic kits, critical care, and biotechnology products.\n","country":"India","industry":"Pharmaceuticals","source":"https://en.wikipedia.org/wiki/Dr._Reddy%27s_Laboratories"},{"id":"4a1e2738-02a1-4fdd-b8ce-c4fd0ea01fde","name":"DSK Group","description":"DSK Group was a business conglomerate headquartered in Pune, India having its presence in domains including real estate, automobile, technology, sports, information technology, and education. The Group was founded by Deepak Sakharam Kulkarni, born and studied in Pune, is the Chairman and Managing Director of the Group.[1] The Group was a multi-crore business with a turnover of over INR 4,000 crores.[2] It had operations in India (Pune, Mumbai, Nashik, Bengaluru and Chennai) and the US.[3]\n","country":"India","industry":"Conglomerate","source":"https://en.wikipedia.org/wiki/DSK_Group"},{"id":"b88245c5-b2d2-4272-af6c-110fc5109b8d","name":"DTDC","description":"Desk to Desk Courier & Cargo (also known as DTDC or DTDC Express Limited) is an Indian courier delivery services company, headquartered in Bangalore, Karnataka.[2][6][7][8][9]\nDTDC handles 12 million shipments every month.[2] In 2012, it acquired a 52 percent stake in Eurostar Express of Eurostar of UAE.[10] In April 2013, DTDC acquired 70% of Nikkos logistics.[11] In June 2013, French courier company GeoPost (owned by La Poste) acquired a 42 percent stake in DTDC.[12]\n","country":"India","industry":"Courier","source":"https://en.wikipedia.org/wiki/DTDC"},{"id":"0cea1e35-5254-44f2-ad50-37c2ad2165f8","name":"Durian Furniture","description":"Durian Furniture is a home and office furniture company based in Mumbai, India.\n","country":"India","source":"https://en.wikipedia.org/wiki/Durian_Furniture"},{"id":"d317d753-2cbc-4d80-9b52-21ea2e8c07cf","name":"Dwarkin","description":"\n\nDwarkin formally known as Dwarkin & Son, founded in 1875, was a pioneering Indian enterprise for the sale of Western and Indian musical instruments, which attained a legendary status in the music world at Kolkata (then known, in English, as Calcutta), particularly with the development of the hand-held harmonium.\n","country":"India","source":"https://en.wikipedia.org/wiki/Dwarkin"},{"id":"d80c40ec-2795-4bda-8f33-d6316fb470b1","name":"Easyday","description":"Easyday is an Indian retail brand that runs chains of consumer retail supermarkets and convenience stores. The brand is wholly owned by Future Retail Ltd[1]. Bharti Enterprises announced its foray into retail in February 2007[2] and the first store was opened in Punjab in April 2008.[3] Easyday presently has 523 stores across 12 states.[4]\n","country":"India","industry":"Retailing","source":"https://en.wikipedia.org/wiki/Easyday"},{"id":"d3c49986-fd56-4ab9-bc6b-6d541f35ccef","name":"Eicher Motors","description":"Eicher Motors Limited (EML) (BSE: 505200, NSE: EICHERMOT) is an Indian manufacturer of motorcycles and commercial vehicles. Eicher is the parent company of Royal Enfield, a manufacturer of middleweight motorcycles.\n","country":"India","industry":"Automotive","source":"https://en.wikipedia.org/wiki/Eicher_Motors"},{"id":"116084f7-53d8-439d-a866-fc03fe57edbf","name":"Ekart","description":"Ekart logistics or Ekart courier is an Indian courier delivery services company, headquartered in Bangalore, Karnataka.[1][4] A subsidiary of electronic commerce company Flipkart Pvt. Ltd., it is run by Instakart services Pvt. Ltd.[5][6]\n","country":"India","industry":"Courier","source":"https://en.wikipedia.org/wiki/Ekart"},{"id":"89014aa6-3176-4948-ab86-dc329dcb713a","name":"Emcure Pharmaceuticals","description":"Emcure Pharmaceuticals, headquartered at Pune in West India, is an Indian pharmaceutical company. The company's products include tablets, capsules (both softgel capsules and hard-gel capsules), and injectables.\n","country":"India","industry":"Pharmaceutical","source":"https://en.wikipedia.org/wiki/Emcure_Pharmaceuticals"},{"id":"fa44248d-4579-46bf-a6ba-f4ad4d48d949","name":"Epic (web browser)","description":"Epic is a privacy-centric web browser. It was developed by Hidden Reflex (a software product company founded by Alok Bhardwaj, based in Washington DC and Bangalore, India) from Chromium source code.[3] Epic is always in \"private browsing mode\". Exiting the browser deletes all browser data. Even during browsing as little as possible is stored. Epic developers removed all Google tracking code, binaries from the chromium source code to compile a clean executable and blocks other companies from tracking users.[4]\n","country":"India","source":"https://en.wikipedia.org/wiki/Epic_(web_browser)"},{"id":"eb2cd450-57a0-4c00-96cc-82c33397c476","name":"Escorts Group","description":"Escorts Group, is an Indian multinational conglomerate and automotive engineering company that operates in the sectors of agri-machinery, construction and material handling equipment, and railway equipment. Headquartered in Faridabad, Haryana, the company was launched in 1944 and has marketing operations in more than 40 countries. Escorts Group's management team includes Nikhil Nanda as the Chairman and Managing Director.[1][2][3]\nEscorts manufactures a wide range of tractors, automotive components, railway equipment and construction & material handling equipment.\n","country":"India","industry":"\nConglomerate\nAutomotive\nEngineering\n","source":"https://en.wikipedia.org/wiki/Escorts_Group"},{"id":"a6d42774-885e-478c-b491-9956762d1387","name":"Everest Spices","description":"Everest Food Products Pvt Ltd (Everest Spices) is an Indian manufacturer, distributor and exporter of ground spices and spice mixtures under the brand name Everest.[1]\n","country":"India","industry":"Food","source":"https://en.wikipedia.org/wiki/Everest_Spices"},{"id":"f67316df-0ac9-4d4a-bc06-b48f7fd491ba","name":"Exide Industries","description":"Exide Industries Limited is a Indian storage battery producing company and a life insurance company headquartered in Kolkata, India. It is the largest manufacturer of automotive and industrial lead-acid batteries in India and fourth largest in the world.[4] It has plants in India and Sri Lanka and dealership network in 46 countries spanning across 5 continents. Exide also has four major lead-acid battery recycling facilities — two of which are in the United States, and Spain and Portugal each have one as well. The company claims that 99 percent of lead processed through these facilities is recycled.[4][5]\n","country":"India","industry":"Battery Manufacturing, Insurance services","source":"https://en.wikipedia.org/wiki/Exide_Industries"},{"id":"6e37ee11-6091-4802-973e-daf330a9820a","name":"Fabindia","description":"Fabindia (or Fabindia Overseas Pvt. Ltd.) is an Indian chain store retailing garments, furnishings, fabrics and ethnic products handmade by craftspeople across rural India. Established in 1960 by John Bissell, an American working for the Ford Foundation, New Delhi, Fabindia started out exporting home furnishings, before stepping into domestic retail in 1976, when it opened its first retail store in Greater Kailash, New Delhi. Today it has over 250 stores across India and abroad, and is managed by his son, William Nanda Bissell.\n","country":"India","industry":"Textiles, Home furnishings, handloom apparel, jewellery","source":"https://en.wikipedia.org/wiki/Fabindia"},{"id":"bb2b4fe0-0203-4e09-8280-87c69c99953e","name":"Fastrack (fashion accessories)","description":"Fastrack, is a Indian fashion accessory retail brand in India. The company was launched in 1998 as a sub-brand of Titan Watches. In 2005, Fastrack was spun off as an independent brand targeting the urban youth and growing fashion industry in India.[1].\nFastrack began opening retail stores throughout the country. The first store opened  in early 2009.[2][3]\n","country":"India","industry":"Fashion Accessories","source":"https://en.wikipedia.org/wiki/Fastrack_(fashion_accessories)"},{"id":"526d0bb4-e476-4f6d-94e4-92ae07b44925","name":"Fevicol","description":"Fevicol is a brand of adhesives owned by the Indian company Pidilite Industries Limited.\n","country":"India","source":"https://en.wikipedia.org/wiki/Fevicol"},{"id":"cd53b476-28f0-4a77-b6d5-2f17fe86f93c","name":"Finolex Cables","description":"Finolex Cables Ltd is an Indian manufacturer of electrical and telecommunication cables based in Pune, Maharashtra.[5] It is the flagship company of the Finolex Group, established in 1958.\n","country":"India","industry":"Electrical cables, CFL and electrical switches","source":"https://en.wikipedia.org/wiki/Finolex_Cables"},{"id":"e5a70a8f-c784-4872-b640-363c976441cf","name":"Flipkart","description":"Flipkart is an Indian e-commerce company based in Bangalore, Karnataka, India. It was founded by Sachin Bansal and Binny Bansal in 2007. The company initially focused on book sales, before expanding into other product categories such as consumer electronics, fashion, home essentials & groceries, and lifestyle products.\n","country":"India","source":"https://en.wikipedia.org/wiki/Flipkart"},{"id":"3914a272-f67b-4fb2-b7a2-e57468e57d0a","name":"Force Motors","description":"\nForce Motors Limited, is an Indian automotive manufacturer, the flagship company of the Dr. Abhay Firodia Group.[1] From 1958 until 2005 the company was known as Bajaj Tempo Motors, because it originated as a joint venture between Bachraj Trading Ltd. and Germany's Tempo.[2].\nThe company is known for brands like the Tempo, Matador, Minidor and Traveller. Over the last five decades it has partnered with global manufacturers including Daimler, ZF, Bosch, and MAN. These associations have enabled the company to move away from its outdated products.\n","country":"India","industry":"\nAutomobile\nCommercial Vehicles\n","source":"https://en.wikipedia.org/wiki/Force_Motors"},{"id":"44cbbc49-a378-4c2a-a6d6-b02a3383eb3e","name":"Forest Essentials","description":"Forest Essentials is an Indian cosmetics, skincare and perfume company that specialises in Ayurvedic preparations for its products. It was founded in 2000 by Mira Kulkarni in New Delhi, India.[1]\n","country":"India","industry":"Wellness, Cosmetics","source":"https://en.wikipedia.org/wiki/Forest_Essentials"},{"id":"c7d5f741-d778-458c-a42d-49b1528a108f","name":"Funskool","description":"Funskool (India) Ltd. is an Indian toy manufacturing company founded in 1987 with headquarters in Chennai, Tamil Nadu. Apart from its own brands, the company also manufactures and distributes products in the Indian market under license from foreign toy brands including Hasbro,Disney, Warner Bros., Takara Tomy, and Ravensburger.[1]\n","country":"India","industry":"ToysEntertainment","source":"https://en.wikipedia.org/wiki/Funskool"},{"id":"7bde6a94-a295-4568-8e96-06dadad2ff44","name":"General Insurance Corporation of India","description":"GIC Re or GIC of India is a state owned enterprise in India. It was incorporated on 22 November 1972 under Companies Act, 1956. GIC Re has its registered office and headquarters in Mumbai. It was the sole reinsurance company in the Indian insurance market until the insurance market was open to foreign reinsurance players by late 2016 including companies from Germany, Switzerland and France. GIC Re's shares are listed on BSE Limited and National Stock Exchange of India Ltd. GIC Re was ranked in Forbes'[4] list of World's Best Employers and Top Regarded Companies in 2019. \n","country":"India","industry":"Insurance","source":"https://en.wikipedia.org/wiki/General_Insurance_Corporation_of_India"},{"id":"b8ab75a0-c8be-44da-9190-49bd78e51226","name":"Ghari Detergent","description":"Ghari Detergent powder is manufactured by RSPL Limited (RSPL), a Gurugram based is more than 8000 crore diversified conglomerate in India. The detergent brand was founded by Muralidhar Gyanchandani (Chairman RSPL Group) and Bimal Kumar Gyanchandani (Vice Chairman) in 1988.  When Ghari was launched, market was already dominated by big brands like Surf and Nirma. Over the years since the launch of Ghari detergent powder, till date there have been introduction of plethora of brands from biggies like HUL and P&G and many local players. It came to limelight in late 2012 when it surpassed HUL's wheel detergent and grabbed top spot in terms of market share. It took almost 25 years for Ghari to be the market leader in detergent market. In November 2012, Ghari had a 17.4% share compared with Wheel's 16.9%. And followed by Tide and henko Namaste India, Red Chief, Furo Sports, Expert dish wash, Venus Creme Bar, Glori Bathing Soaps/toilet soaps are also RSPL subsidiary. RSPL has also forayed in the renewable energy as well as real estate business. Latest product launches are Glori bathing soap and Ghadi Machine Wash detergent powder that fulfills its promise of Continuous improvement and Thorough Planning and Execution. RSPL Group has shifted to Gurugram under its expansion plan. RSPL manufactures its products through 34 units across  India. A green field project for Soda Ash which is a raw material for detergent has been established at Kuranga, Gujarat by RSPL Group. Through the backward integration RSPL Group is looking to improve its market share in detergent industry and to retain its position as the Market leader. Manoj Gyanchandani (Managing Director RSPL Group) spearheads entities like Namaste India Pvt Ltd and Leayan Global Pvt Ltd; Currently the Indian market for Ghadi detergent is managed by Rahul Gyanchandani (Joint Managing Director of RSPL Group), International Markets and Hygiene care division (Brands like Proease, Xpert), are taken care of by Rohit Gyanchandani (Director RSPL Group)\n","country":"India","source":"https://en.wikipedia.org/wiki/Ghari_Detergent"},{"id":"a5331fdc-bbd9-4c86-bafd-82c8ecbbc7e1","name":"GoAir","description":"GoAir is an Indian low-cost airline based in Mumbai, Maharashtra. It is owned by the Indian business conglomerate Wadia Group. In October 2017 it was the fifth largest airline in India with an 8.4% passenger market share.[3] It commenced operations in November 2005 and operates a fleet of Airbus A320 aircraft in all economy configuration. As of March 2020, the airline operates over 330 daily flights to 36 destinations, including 27 domestic and 9 international destinations, from its hubs at Mumbai, Delhi, Bangalore, Kolkata and Kannur.[4][5]\n","country":"India","source":"https://en.wikipedia.org/wiki/GoAir"},{"id":"33d4341a-47a3-4651-a8b1-c27c1c66f21c","name":"Godrej & Boyce","description":"Godrej and Boyce, a Godrej Group Company, began in 1897 with the manufacture of locks, then extending to other durables (refrigerators, washing machines, air conditioners, home security systems and safes, furniture), products for institutions (office furniture, audio-visual products, access control systems, perimeter security products, bank security products, beverage vending machines, interior products, hospital and laboratory furniture) and industrial products (process equipment, materials handling equipment, industrial storage products, tooling, precision equipment).[citation needed]\n","country":"India","industry":"Consumer durables, products for institutions, Industrial products","source":"https://en.wikipedia.org/wiki/Godrej_%26_Boyce"},{"id":"c5f5b3af-8189-4610-8bc8-c48b21860ec6","name":"Godrej Group","description":"Godrej Group, is an Indian conglomerate company headquartered in Mumbai, Maharashtra, India, managed and largely owned by the Godrej family. It was founded by Ardeshir Godrej and Pirojsha Burjorji Godrej in 1897, and operates in sectors as diverse as real estate, consumer products, industrial engineering, appliances, furniture, security and agricultural products.[4] Subsidiaries and affiliated companies include Godrej Industries and its subsidiaries Godrej Consumer Products, Godrej Agrovet, and Godrej Properties, as well as the private holding company Godrej & Boyce Mfg. Co. Ltd.\n","country":"India","industry":"Conglomerate","source":"https://en.wikipedia.org/wiki/Godrej_Group"},{"id":"3200c806-7b8d-4698-adb9-939ece43123e","name":"Gold Spot","description":"Gold Spot was one of the three brands of carbonated soft drink started in India by Parle Bisleri under the initiative of its founder Ramesh Chauhan in 1977 after the exit of Coca-Cola and PepsiCo from the Indian market. Gold Spot was introduced along with Thums Up and Limca.[1] \n","country":"India","source":"https://en.wikipedia.org/wiki/Gold_Spot"},{"id":"a70de2b6-9efd-43b2-9c33-f7d7f1c9c798","name":"Gold Winner","description":"\n\nGold Winner is a sunflower oil brand produced by Kaleesuwari Refinery Pvt Ltd. The history of the company goes back to 1970s with a small grocery store started by G. Munusamy Nadar. He bought Kaleesuwari Refinery Private Limited near Chennai[1] in 1993 and has markets in India, Singapore, Malaysia, Brunei, Kuwait, UAE, Australia, UK and Sri Lanka. The company also sells other products such as vanaspati, soybean oil and groundnut oil CARDIALIFE.[2] In 2005, it has received HACCP (Hazard Analysis Critical Control Points) certification which certifies that the oil does not have any physical, chemical or biological contamination and valid for 5 years. It was also awarded ISO 9001:2000 for its oil manufacturing plant at Vengaivasal, near to Chennai by TUV Management Services Gmbh, Germany.[3]\n","country":"India","source":"https://en.wikipedia.org/wiki/Gold_Winner"},{"id":"bcd0a764-45b7-4f92-8324-76ab87669646","name":"Goldmedal Electricals Pvt. Ltd.","description":"Goldmedal Electricals Pvt. Ltd. is one of the leading home-grown fast moving electrical goods company in India. Established in 1979, the company offers a wide range of electrical products including LED lights, modular switches, home automation systems, entertainment devices, security systems, wires & cables and electrical accessories for residential and commercial establishments.\nGoldmedal Electricals is headquartered in Mumbai, Maharashtra[3] and has a pan India presence with branches in all 29 states of India. The company has 13 company-owned experience centres across the country.\n","country":"India","industry":"Electrical equipment","source":"https://en.wikipedia.org/wiki/Goldmedal_Electricals_Pvt._Ltd."},{"id":"aac74abf-fd0b-4839-b537-d88d4ae324d1","name":"Gyan Dairy","description":"\n\nGyan Dairy is a North Indian diary company headquartered in UP, India and is known for the processing and distribution of dairy products produced in regionally located facilities. Gyan Dairy manufactures, markets and sells a full line of dairy products such as Milk, Lassi, Curd, Butter, and Ghee. Its tagline \"always fresh, always pure\" was unveiled in 2017, along with the company's theme song 'Shuddh aur taaza, Gyan ka waada'.[1]\n","country":"India","source":"https://en.wikipedia.org/wiki/Gyan_Dairy"},{"id":"a42ee2d2-e8ed-4695-b519-66cfb3dd18bd","name":"Haathi Chaap","description":"Haathi Chaap is a brand of paper manufactured in Rajasthan, India, out of elephant dung. The name comes from 'Haathi', meaning 'Elephant' in Hindi and 'Chaap' which means 'press' or 'imprint'. Elephant dung paper was probably first made in Thailand.[dubious  – discuss] Other than in India, elephant dung paper is also being manufactured in Sri Lanka and South Africa.[1]\n","country":"India","source":"https://en.wikipedia.org/wiki/Haathi_Chaap"},{"id":"dc63ceee-d176-4713-a801-38cd07d73217","name":"Haldiram's","description":"Haldiram's is a major potato chips and Indian sweets and snacks manufacturer [2][3] based out of Delhi and Nagpur. The company has  manufacturing plants in a wide variety of locations such as Nagpur, New Delhi, Gurgaon, Rudrapur and Noida.[3] Haldiram's has its own retail chain stores[4][5] and a range of restaurants in Nagpur, Kolkata, Noida and Delhi. [6] [7]. \nHaldiram's was founded in 1937 by Shri Ganga Bhishen Agarwal, fondly known as Haldiram in his household; as a retail sweets and namkeen shop in Bikaner, Rajasthan.[8].\n","country":"India","industry":"Food industry","source":"https://en.wikipedia.org/wiki/Haldiram%27s"},{"id":"f5b88ccf-6e9d-4b6d-8346-bcd649c29cb8","name":"Haldyn Glass","description":"Haldyn Glass Gujarat Limited (HGGL) is a public limited company in India (BSE: 515147) [1] (ISIN Code 506D01012) manufacturing clear glass bottles and containers. The company is owned by Haldyn Glass Limited and has its manufacturing plant in  Vadodara, Gujarat while its administrative office is located in Goregaon East, Mumbai.\n","country":"India","source":"https://en.wikipedia.org/wiki/Haldyn_Glass"},{"id":"8a74b45b-db4c-4314-8f03-d80acf0b8576","name":"Hamdard (Wakf) Laboratories","description":"Hamdard Laboratories (India),  is a Unani and Ayurvedic pharmaceutical company in India (following the independence of India from Britain, \"Hamdard\" Unani branches were established in Bangladesh(erstwhile East Pakistan) & Pakistan). It was established in 1906 by Hakeem Hafiz Abdul Majeed in Delhi, and became a waqf (non-profitable trust) in 1948. Some of its most famous products include Sharbat Rooh Afza, Safi, Roghan Badam Shirin, Sualin, Joshina and Cinkara. It is associated with Hamdard Foundation, a charitable educational trust.\n","country":"India","industry":"Healthcare, Food","source":"https://en.wikipedia.org/wiki/Hamdard_(Wakf)_Laboratories"},{"id":"fc667d0c-8b65-4594-9c9f-29b6ecdefabe","name":"Havells","description":"Havells India Limited, is Indian electrical equipment company based in Noida, India. In business since 1958, the company has products ranging from home and kitchen appliances, lighting for domestic, commercial and industrial applications, LED lighting, fans, modular switches and wiring accessories, water heaters, industrial and domestic circuit protection switchgear, industrial and domestic cables and wires, induction motors, and capacitors among others.\nHavells India owns some brands like Havells, Lloyd, Crabtree, Standard Electric and Promptech. \n","country":"India","industry":"Electrical equipment","source":"https://en.wikipedia.org/wiki/Havells"},{"id":"ba5c4b55-d347-4b4b-bc1a-d20bebbff3a2","name":"Hawkins Cookers","description":"Hawkins Cookers Limited is an Indian company, based in Mumbai and manufactures pressure cookers and cookware,[6] The company has three manufacturing plants at Thane, Hoshiarpur and Jaunpur. It manufactures under brand names of Hawkins, Futura, Contura, Hevibase, Big Boy and Ventura. Hawkins is one of  the largest pressure cooker manufacturers in India and exports its products to more than 40 countries.[7]\n","country":"India","industry":"Consumer Product Manufacturers","source":"https://en.wikipedia.org/wiki/Hawkins_Cookers"},{"id":"49674f0c-a519-4c7c-bafa-f359e20ada67","name":"HCL Technologies","description":"HCL Technologies Limited, is an Indian multinational information technology (IT) service and consulting company headquartered in Noida, Uttar Pradesh. It is a subsidiary of HCL Enterprise. Originally a research and development division of HCL, it emerged as an independent company in 1991 when HCL entered into the software services business.[5]\nThe company has offices in 44 countries including the United Kingdom, the United States, France, and Germany with a worldwide network of R&D, \"innovation labs\" and \"delivery centers\", and 147,123 employees and its customers include 250 of the Fortune 500 and 650 of the Global 2000 companies. \n","country":"India","industry":"IT services, IT consulting","source":"https://en.wikipedia.org/wiki/HCL_Technologies"},{"id":"5a234192-4775-4d2f-bd1e-13491a94010c","name":"HDFC Bank","description":"HDFC Bank Ltd. is an Indian banking and financial services company headquartered in Mumbai, Maharashtra. It has a base of 104154 permanent employees as of 30 June 2019.[8] HDFC Bank is India’s largest private sector lender by assets.[9] It is the largest bank in India by market capitalisation as of March 2020.[10]\n","country":"India","industry":"financial services","source":"https://en.wikipedia.org/wiki/HDFC_Bank"},{"id":"00cee9c0-2f83-4222-ace6-031963f14855","name":"Hero Cycles","description":"Hero Cycles Limited, based in Ludhiana Punjab, India is a manufacturer of bicycles and bicycle related products.[7] Mr Pankaj M Munjal[8] is the Chairman & Managing Director of Hero Cycles.\n","country":"India","industry":"Bicycles","source":"https://en.wikipedia.org/wiki/Hero_Cycles"},{"id":"552f9687-64d2-4c1f-aead-214085c915a8","name":"Hero MotoCorp","description":"Hero Motocorp Ltd., formerly Hero Honda, is an Indian motorcycle and scooter manufacturer based in New Delhi, India. The company is the largest two-wheeler manufacturer in the world,[3] and also in India, where it has a market share of about 46% in the two-wheeler category.[3][4] The 2006 Forbes list of the 200 World's Most Respected Companies has Hero Honda Motors ranked at #108.[5] On 31 March 2013, the market capitalisation of the company was ₹308 billion (US$4.3 billion).[6]\n","country":"India","industry":"Automotive","source":"https://en.wikipedia.org/wiki/Hero_MotoCorp"},{"id":"68e47a13-58b9-432a-9d7e-d85e6f3246ee","name":"Hero Motors Company","description":"Hero Motors Company (HMC), is group identity of businesses controlled by Pankaj M Munjal.[5][6]\n","country":"India","source":"https://en.wikipedia.org/wiki/Hero_Motors_Company"},{"id":"6edaf8d4-bb2c-4cc1-a0cb-dc7b310140ac","name":"Hike Messenger","description":"Hike Messenger, also called Hike Sticker Chat, is an Indian freeware, cross-platform instant messaging (IM), Voice over IP (VoIP) application which was launched on 12 December 2012 by Kavin Bharti Mittal and is now owned by Hike Private Limited.[3] Hike can work offline through SMS and has multi-platform support.[4] The app registration uses standard one time password (OTP) based authentication process.[5] With abundance of low-cost data, Hike decided to go from a single super app strategy to multiple app approach, so that it can focus more on the core messaging capabilities.[6] From version 6, the user-interface was revised and the app no longer supports features like news, mobile payment, games or jokes.[7] As per CB Insights, $1.4 billion is the valuation of Hike[8] with more than 100 million registered users till August 2016 and 350 employees working from Bengaluru and Delhi.[9][10]\n","country":"India","industry":"Internet","source":"https://en.wikipedia.org/wiki/Hike_Messenger"},{"id":"67c76a3c-e857-47a5-8793-9213d00bc10c","name":"Hindalco Industries","description":"Hindalco Industries Ltd., an Indian aluminium and copper manufacturing company, is a subsidiary of the Aditya Birla Group.[4] Its headquarters are at Mumbai, Maharashtra, India. It is the Flagship company in the metals business.\n","country":"India","industry":"Metals","source":"https://en.wikipedia.org/wiki/Hindalco_Industries"},{"id":"aa4c0b4d-dce8-4d94-83ec-f33641c24cd8","name":"Hindustan Aeronautics Limited","description":"Hindustan Aeronautics Limited (HAL)  is an Indian state-owned aerospace and defence company headquartered in Bangalore (Bengaluru), India. It is governed under the management of the Indian Ministry of Defence.\n","country":"India","industry":"Aerospace and Defence","source":"https://en.wikipedia.org/wiki/Hindustan_Aeronautics_Limited"},{"id":"d5a33b72-a590-48e9-9712-7da51e9ce1cd","name":"Hindustan Motors","description":"Pin1Code\n\n","country":"India","industry":"Automotive","source":"https://en.wikipedia.org/wiki/Hindustan_Motors"},{"id":"0439effd-847c-4c12-9746-c75c0be433d4","name":"Hindustan National Glass & Industries Limited","description":" Hindustan National Glass & Industries Limited  (HNGIL) is an Indian container glassmaker based in Kolkata. The company is the largest and one of the oldest glass manufacturing companies in India.[citation needed] \n","country":"India","industry":"Glass production","source":"https://en.wikipedia.org/wiki/Hindustan_National_Glass_%26_Industries_Limited"},{"id":"52d1e296-58c3-4d00-9c67-248417a4dada","name":"Hindustan Petroleum","description":"Hindustan Petroleum Corporation Limited (HPCL) is an Indian oil and natural gas company with its headquarters at Mumbai, Maharashtra. It has about 25% market-share in India among public-sector companies (PSUs) and a strong marketing infrastructure. Oil and Natural Gas Corporation, also second promoter of the company (first promotor is The President of India) , owns 51.11% shares in HPCL and others are distributed amongst financial institutes, public and other investors.[2][3][4] The company is ranked 367th on the Fortune Global 500 list of the world's biggest corporations as of 2016. HPCL got removed from NIFTY 50 INDEX in March 2019 [5] Recently on 24 October 2019 the company has conferred with Maharatna status.\n","country":"India","industry":"Oil and Gas","source":"https://en.wikipedia.org/wiki/Hindustan_Petroleum"},{"id":"ad431b39-73b5-4443-9cd7-18cec9d63dab","name":"Hindustan Platinum","description":"Hindustan Platinum Private Limited (HPPL), is a manufacturer and refiner of precious metal products at Navi Mumbai set up in 1961. The company is located at TTC Industrial Area, Pawane, Navi Mumbai.\n","country":"India","industry":"Precious metals","source":"https://en.wikipedia.org/wiki/Hindustan_Platinum"},{"id":"28de75e7-de02-4b7d-a6f5-8dd91cc6c45b","name":"HLL Lifecare","description":"HLL Lifecare Limited (formerly Hindustan Latex Limited) (HLL) is an Indian healthcare product manufacturing company based in Thiruvananthapuram, Kerala, India.[1]  A Government of India-owned corporation (Public-sector undertaking).\n","country":"India","industry":"Health Care","source":"https://en.wikipedia.org/wiki/HLL_Lifecare"},{"id":"095cca24-ee83-4d1d-a370-2cedaf5ca19c","name":"HMT (company)","description":"HMT Limited, formerly Hindustan Machine Tools Limited, is a state-owned holding company under the Ministry of Heavy Industries and Public Enterprises in India.[5] The company's wholly owned subsidiaries include HMT Machine Tools Limited and HMT International Limited. HMT also holds a majority stake in Praga Tools Limited (51%).[4]\n","country":"India","industry":"Engineering","source":"https://en.wikipedia.org/wiki/HMT_(company)"},{"id":"0edce292-4b93-4910-a818-3ae58ce4dc33","name":"Hoichoi","description":"Hoichoi is an Indian On-demand video streaming platform, owned and maintained by SVF Entertainment Pvt Ltd, launched on 20 September 2017.\nHoichoi is currently available for Android, iOS, Apple TV, Amazon Fire TV and recently for Android TV and Roku as well. It is the first OTT platform from Bengal focusing exclusively on Bengali language content, worldwide.[2]\n","country":"India","industry":"Streaming","source":"https://en.wikipedia.org/wiki/Hoichoi"},{"id":"fc742822-dfc9-43d3-9dc2-cd18b5fcb10c","name":"Hradyesh","description":"Hradyesh is an automobile manufacturing company based in India, specialising in custom made luxury cars.[1]\n","country":"India","industry":"LuxuryManufacturingDistribution","source":"https://en.wikipedia.org/wiki/Hradyesh"},{"id":"44acbbb4-8cfd-4af0-a7f9-f50eaf1fe24c","name":"I-shakti","description":"i-Shakti was launched in October 2006 by Tata Chemicals to satisfy the iodised salt needs of the Indian masses.[1]\nThe brand is now the second biggest packaged salt brand in India after Tata Salt, with a market share of around 14.3%.\n","country":"India","industry":"FMCG, Food","source":"https://en.wikipedia.org/wiki/I-shakti"},{"id":"f9a75fe9-8736-4921-9967-d85a86e81257","name":"IBall (company)","description":"iBall is an Indian consumer electronics company owned by Anil Parasrampuria, Varun Daga & Shreans Daga headquartered in Mumbai, Maharashtra, India, which imports computer peripherals, smartphones and tablets from original equipment manufacturers (OEMs).[1][2][3][4] iBall started operations in September 2001, initially selling computer mice. As of 2011[update], the company sold consumer electronics products in 27 different product categories.[5][6][7][8]\nIn 2014, iBall launched the Andi Uddaan smartphone for women. An SOS button located at the back of the phone sounds a loud siren and automatically sends text messages (SMS) to five pre-selected contacts when pressed.[9]\n","country":"India","industry":"Consumer Electronics","source":"https://en.wikipedia.org/wiki/IBall_(company)"},{"id":"13061b54-62d4-4b82-a3b8-03f11805e909","name":"ICICI Bank","description":"ICICI Bank Limited is an Indian multinational banking and financial services company with its registered office in Vadodara, Gujarat and corporate office  in Mumbai, Maharashtra . It offers a wide range of banking products and financial services for corporate and retail customers through a variety of delivery channels and specialised subsidiaries in the areas of investment banking, life, non-life insurance, venture capital and asset management. The bank has a network of 5,275 branches and 15,589 ATMs across India and has a presence in 17 countries.[6]\n","country":"India","industry":"Banking, Financial services","source":"https://en.wikipedia.org/wiki/ICICI_Bank"},{"id":"20d3b753-294e-4a54-aa79-15db4255b481","name":"ID Fresh Food","description":"ID Fresh foods is a food products company based in Bangalore, India. The company manufactures a range of fresh foods including Idly/Dosa Batter, Parotas, chapatis, curd, and paneer. \n","country":"India","industry":"Food","source":"https://en.wikipedia.org/wiki/ID_Fresh_Food"},{"id":"11c65ccb-0ac2-4157-a9ec-877ae528d374","name":"Idea Cellular","description":"Idea Cellular Limited[4] \n(commonly referred to as Idea, and stylised as !dea) was an Indian mobile network operator based at Mumbai, Maharashtra. Idea was a pan-India integrated GSM operator and had 220.00 million subscribers as of June 2018.[5]\n","country":"India","industry":"Telecommunications","source":"https://en.wikipedia.org/wiki/Idea_Cellular"},{"id":"6f73f312-0c67-4c76-8284-2d480626cfac","name":"IFB Home Appliances","description":"IFB Home Appliances is a division of IFB Industries Ltd which provides products and services across a range of product categories.[5] It has its manufacturing location in Kolkata, and Verna[6]India. The company has a chain of ~530 retail outlets called ‘IFB Point’.[7]\n","country":"India","industry":"\nConsumer electronics\nHome Appliances\n","source":"https://en.wikipedia.org/wiki/IFB_Home_Appliances"},{"id":"2c07749c-32af-471c-b124-21766c590897","name":"Incredible India","description":"Incredible India (styled as Incredıble!ndıa) is the name of an international tourism campaign maintained by the Government of India since 2002, to promote tourism in India.\n","country":"India","source":"https://en.wikipedia.org/wiki/Incredible_India"},{"id":"8ae9fd70-be99-42ec-b4f8-98172ea2884f","name":"Indane (LPG)","description":"Indane,[3][4] is a Liquefied Petroleum Gas (LPG) brand developed and owned by Indian Oil Corporation in India. It is the world's second largest LPG marketer.[5] The brand was conceived in 1964 to bring modern cooking to Indian kitchens. The first Indane LPG connection was released on 22 October 1965 at Kolkata. Indane serves more than 90 million families through a network of 9100 distributors. 27% of its customers reside in semi-urban or rural markets and every second LPG cooking gas connection in India is that of Indane. The sales network is backed by 45 Indane Area Offices. The brand has been awarded the title of \"Superbrand\" by Superbrand India.[6]\n","country":"India","source":"https://en.wikipedia.org/wiki/Indane_(LPG)"},{"id":"62ca0918-c297-4426-9d7a-3e1d55428fb3","name":"Independent TV (India)","description":"Independent TV, formerly Reliance Big TV, was an Indian direct to home (DTH) television operator. It was a subsidiary of Reliance Communications.[1]\n","country":"India","industry":"Satellite television","source":"https://en.wikipedia.org/wiki/Independent_TV_(India)"},{"id":"3e09bdc7-3673-4277-aa18-622c8875f5d7","name":"India Is","description":"India Is is a series of photography and video challenges organized by the Public Diplomacy Division (PDD) of the Ministry of External Affairs (MEA), Government of India.[1][2] Both of the contests invite photo and video entries, respectively, on given themes.[3]\n","country":"India","source":"https://en.wikipedia.org/wiki/India_Is"},{"id":"47b276fa-e529-435a-9b3b-dc0cfe72d3a6","name":"India's Most Attractive Brands","description":"India's Most Attractive Brands - 2013 is an annual study based on a primary research conducted across 16 Indian cities [3] based on TRA's (Trust Research Advisory)[4] proprietary 36-attribute Attractiveness Matrix.[5] The research report is available in hardcase. The research studies the magnetic property of attractiveness that a brand displays and its influences and preferences on brand influencers. The report also lists the 1200 of India's Most Attractive Brands.\n","country":"India","source":"https://en.wikipedia.org/wiki/India%27s_Most_Attractive_Brands"},{"id":"b76b226d-e9f4-43f5-97cb-6eecbe6cf3b5","name":"IndiaMART","description":"IndiaMART InterMESH Ltd. is an Indian e-commerce company that provides B2C, B2B and customer to customer sales services via its web portal.[3] The group began in 1996 when Dinesh Agarwal and Brijesh Agrawal founded the website IndiaMART.com,[4] a business-to-business portal to connect Indian manufacturers with buyers.[5][6] The company is headquartered in Noida, Uttar Pradesh, India.\n","country":"India","industry":"\nInternet Marketing\nB2B Marketplace\n","source":"https://en.wikipedia.org/wiki/IndiaMART"},{"id":"24f41bce-37c5-40b3-b6a4-5a7f302a4394","name":"Indian Overseas Bank","description":"Indian Overseas Bank (IOB) is a major public sector bank based in Chennai, India, with about 3,400 domestic branches,\nabout 6 foreign branches and representative office\n","country":"India","industry":"Bankingcapital markets","source":"https://en.wikipedia.org/wiki/Indian_Overseas_Bank"},{"id":"93544150-9443-4761-9fc6-a346e5ed0ed3","name":"IndiGo","description":"IndiGo is an Indian low-cost airline headquartered in Gurgaon, Haryana. It is the largest airline in India by passengers carried and fleet size, with a 47.5% domestic market share as of November 2019.[4] It is also the largest individual Asian low-cost carrier in terms of jet fleet size and passengers carried, and the sixth largest carrier in Asia with over 64 million passengers carried in financial year 2018–19. The airline operates 1500 flights  everyday[5] to 87 destinations – 63 domestic and 24 international.[6] It has its primary hub at Indira Gandhi International Airport, Delhi.[7]\n","country":"India","source":"https://en.wikipedia.org/wiki/IndiGo"},{"id":"027dd4b0-dc7e-42da-8035-4eabbaa9d483","name":"Indosolar","description":"Indosolar Limited is an Indian photovoltaic cell and solar panel manufacturer. It is the largest PV cell manufacturer in India by capacity.[3]\n","country":"India","industry":"Solar power","source":"https://en.wikipedia.org/wiki/Indosolar"},{"id":"ae3bbe86-79e7-4b71-b28f-b9b986f4d617","name":"Infosys","description":"Infosys Limited, is an Indian multinational corporation that provides business consulting, information technology and outsourcing services. It has its headquarters in Bangalore, Karnataka, India.[5]\nInfosys is the second-largest Indian IT company after Tata Consultancy Services by 2017 revenue and 596th largest public company in the world based on revenue.[6] On March 29, 2019, its market capitalisation was $46.52 billion.[7] The credit rating of the company is A− (rating by Standard & Poor's).[8]\n","country":"India","industry":"IT services, IT consulting","source":"https://en.wikipedia.org/wiki/Infosys"},{"id":"a7c33bdb-2e6d-4f5c-a23e-f6fa0d4d7038","name":"Infosys Consulting","description":"Infosys Consulting is a management consulting, IT consulting practice within the larger Infosys organization which works in strategy, IT transformation, change management and business analytics. Infosys Consulting operates globally and currently has offices in 18 countries across the Americas, Asia Pacific and Europe. The firm was officially launched in 2004 as a fully owned subsidiary of Infosys chaired by N. R. Narayana Murthy, one of the co-founders of Infosys.[5][6] For quarter-end March, 2016 Infosys Consulting and Package Implementation were reported as 33.2% of the whole of Infosys' revenue,[7] contributing to the reported earnings of 23 cents a share on revenue of $2.4 billion that December for Infosys.[8]\n","country":"India","industry":"Management Consulting Services","source":"https://en.wikipedia.org/wiki/Infosys_Consulting"},{"id":"1f281067-a1bd-4974-a5ae-43d9b05d3ba7","name":"Intas Biopharmaceuticals","description":"The Biologics Business Unit (BU) of Intas Pharmaceuticals Limited was formerly an independent biotechnology company and was known as Intas Biopharmaceuticals Ltd. Intas Pharmaceuticals limited is an Indian   company headquartered in Ahmedabad, India. The Biologics BU is located in Moraiya, Ahmedabad and is one of the leading biosimilar product manufacturers in Asia.\n","country":"India","industry":"Biotechnology","source":"https://en.wikipedia.org/wiki/Intas_Biopharmaceuticals"},{"id":"4d889ed1-86c5-45f9-ab79-3a7f72d4a260","name":"Intex Technologies","description":"Intex Technologies is an Indian smartphone, consumer electronics and accessories manufacturer company, founded in 1996.[3] It is headquartered in New Delhi, India.[4][5] Intex was India's second-largest mobile phone company by sales. The company offers computer products such as TFT-LCD monitors, notebooks, CRT monitors, and personal computers; and computer peripherals, including add-on cards and products, cabinets, Ethernet cards and switches, fax modems, keyboards, mice, SMPS and UPS systems, and webcams. It also provides consumer electronic products such as MP3 players, DVD players, headphones, home theater systems, and speakers and subwoofers; power electronics including home UPS systems; CRT and LCD televisions; and mobile phones and phone accessories.\n","country":"India","industry":"\nTelecommunications\nConsumer Electronics\nInformation technology\nSmartphones\n","source":"https://en.wikipedia.org/wiki/Intex_Technologies"},{"id":"75e72c76-6146-44c5-a572-275bbcb9b537","name":"J. K. Organisation","description":"The J. K. Organisation is an Indian industrial conglomerate, with headquarters in Delhi, Kanpur and Mumbai. It is run by the Singhania family, which rose to prominence in Kanpur, India, under Lala Kamlapat Singhania. The name JK is derived from the initials of Kamlapat and his father Seth Juggilal (1857–1922), who belonged to the family associated with the Marwari firm Sevaram Ramrikhdas of Mirzapur.[1] The JK group was founded in 1918.[2]\n","country":"India","industry":"cement, tyre, paper, Software, FMCG ,Dairy products","source":"https://en.wikipedia.org/wiki/J._K._Organisation"},{"id":"f0192a2a-a081-4010-843b-78a071d9cf3b","name":"Jackson Records","description":"Jackson Records is a film and music publishing label based in India. The label and its sub-labels/ imprints are owned and administered by Jackson Records Digital Entertainment LLP (formerly known as Digisys Media Network until July 2014). Jackson Records as a label started functioning from December, 2011.\n","country":"India","source":"https://en.wikipedia.org/wiki/Jackson_Records"},{"id":"12752e07-cb48-4559-9a1e-64bad7e6c399","name":"Jain Irrigation Systems","description":"Jain Irrigation Systems, often known as Jain Irrigation, JISL, or simply Jains, is a multinational conglomerate organisation based in Jalgaon, India. JISL employs over 12,000 employees, 11,000 Dealers and Distributors and has 33 manufacturing plants worldwide. It develops, manufactures, supports and sells diversified products, including drip and sprinkler irrigation systems and its components, integrated irrigation automation systems for monitoring and control, dosing systems, PVC and PE piping systems, plastic sheets, greenhouses, bio-fertilizers, solar power, solar water-heating systems, solar water pumps, turnkey biogas plants, photovoltaic systems and tissue culture plants. JISL also processes dehydrated vegetables, spices, concentrated & frozen fruits or pulp. It also provides turnkey projects and agronomical support services.  The company ranked 7th on the Fortune's ‘Change the World’ list[2] as of 2015.\n","country":"India","industry":"Agriculture, irrigation, pipe, food processing, solar energy","source":"https://en.wikipedia.org/wiki/Jain_Irrigation_Systems"},{"id":"554d56dd-51b4-4019-9b01-864621d510c0","name":"Jaipan Industries","description":"Jaipan Industries Limited is Indian home appliances company based in Mumbai, Maharashtra, India. It manufactures and markets various Home Appliances and Non stick cookware’s under the brand name of Jaipan.[3] It is also manufactures of consumer durable products and Mobile handsets.[4] It also markets its products in a number of countries like Sri Lanka, Mauritius, Bangladesh, Nepal, U.A.E.[5] It has more than 140 products, 125 distributors and more than 6000 dealers across India. Its products include food processors, mixers, juicers, hand mixers, blenders, irons, sandwich toasters, pop-up toasters, roti makers, mechanical fans, home theatres, gas heaters, gas burners, water purifiers, vacuum cleaners, tea kettles, rice cookers, dutch ovens, ovens, stainless cutlery and dinnersets.[6]\n","country":"India","industry":"Home appliances","source":"https://en.wikipedia.org/wiki/Jaipan_Industries"},{"id":"071acf29-5835-4dc8-8193-ffdbaf291680","name":"Jet Airways","description":"Jet Airways (India) Ltd was an Indian international airline based in Mumbai, India which, on 17 April 2019, ceased all flight operations with its last revenue flight operated by a Jet Konnect Boeing 737 arriving into Mumbai on 17 April 2019. From the third quarter of 2010 onward, Jet Airways was the largest commercial passenger airline in India with a passenger market share of 22.6%.[13] With its competitors, mainly SpiceJet and IndiGo, lowering ticket fares in the following years, it was forced to follow suit, hurting overall performance resulting in steep financial losses. It dropped to second place behind IndiGo in October 2017, with a passenger market share of 17.8%. The downward slide continued and resulted in bankruptcy.[14]\n","country":"India","source":"https://en.wikipedia.org/wiki/Jet_Airways"},{"id":"b937aec9-d929-4158-b967-43916d76c7d2","name":"Jio","description":"Reliance Jio Infocomm Limited, d/b/a Jio, is an Indian telecommunications company and subsidiary of Jio Platforms, headquartered in Mumbai, Maharashtra, India. It  operates a national LTE network with coverage across all 22 telecom circles. It does not offer 2G or 3G service, and instead uses only voice over LTE to provide voice service on its 4G  network.[6][7]\n","country":"India","industry":"Telecommunications","source":"https://en.wikipedia.org/wiki/Jio"},{"id":"ba305723-6562-4c22-bb13-ee5b94c3b94e","name":"Jio Payments Bank","description":"Jio Payments Bank is an Indian payments bank that started operating in 2018. Payment banks in India are a special category of bank that can accept deposits and make payments but cannot issue loans or other forms of credit including credit cards.\nJio Payments Bank Limited is a joint venture between the Reliance Industries and the State Bank of India with the stake of 70:30.[1]\n","country":"India","industry":"Financial services","source":"https://en.wikipedia.org/wiki/Jio_Payments_Bank"},{"id":"eb443134-0497-4ea3-9980-c1c0314ddd9e","name":"Joyalukkas","description":"Joyalukkas is an ISO certified Indian jewellery group based in Thrissur, Kerala and Dubai, UAE. The company is named after Joy Alukkas, the company's chairman and founder.[2] Joyalukkas group has 160 showrooms across the globe. [3] [4]\n","country":"India","industry":"Jewellers","source":"https://en.wikipedia.org/wiki/Joyalukkas"},{"id":"430d661e-e22a-4801-a844-e6cb95c2a6a6","name":"JSW Cement","description":"JSW Cement Limited is a subsidiary, new diversification foray of the 13 billion dollars JSW Group based in Mumbai.The company has three Cement production units -two grinding units in  Vijayanagara adjacent to JSW Steel plant near Bellary, Karnataka and Dolvi, Maharashtra.Integrated Cement plant in Nandyal Andhra Pradesh.The units have a combined capacity of 6 million tonnes per annum (mtpa).\n","country":"India","industry":"Cement","source":"https://en.wikipedia.org/wiki/JSW_Cement"},{"id":"627dba7a-7083-47b7-b7f5-d5701e85c4c4","name":"Jumbo King","description":"Jumbo King is a chain of fast food restaurants based primarily in Mumbai, specializing in the Maharashtrian regional dish vada pav. Established in 2001 by husband and wife Dheeraj and Reeta Gupta, the company was inspired by the fast food business model of McDonald's and Burger King.[3][4] Jumbo King Foods Pvt. Ltd is a franchisee-based company that operates across many areas of India. From its beginnings in Malad, a suburb of Mumbai, it has spread across the whole Mumbai Metropolitan Region (MMR), as well as Bangalore, Hyderabad, Indore, Lucknow, Aurangabad and Gujarat.[1]\n","country":"India","industry":"Fast food","source":"https://en.wikipedia.org/wiki/Jumbo_King"},{"id":"6d58ae7c-1924-45f0-aaeb-cb91e1f6dfaa","name":"JustOrbit","description":"JustOrbit is an online travel planning platform helping travelers plan their customized itinerary, share with co-travelers, discuss, finalize and book collectively. End-to-end travel planning solution. JustOrbit reduces the pain of the traveler of visiting multiple websites to finalize their trip by providing elements of planning & discussing under one roof. \n","country":"India","industry":"Trip Planning","source":"https://en.wikipedia.org/wiki/JustOrbit"},{"id":"1d4e45df-da70-4450-b5de-22adc7501c67","name":"K7 Total Security","description":"K7 Total Security, developed by K7 Computing Pvt. Ltd., is a malware prevention and antivirus software, and provides malware prevention and removal during a subscription period and uses signatures and heuristics to identify viruses. Other features include a software firewall, e-mail spam filtering and phishing protection.\n","country":"India","source":"https://en.wikipedia.org/wiki/K7_Total_Security"},{"id":"4d27f8ee-e3cd-4c27-a7c0-e2b3bb70c831","name":"Kaja Beedi","description":"\n\nKajah Beedi is  beedi brand from Thrissur in Kerala, India. The company is situated in Chavakkad in Thrissur District. The brand is owned by Kajah Beedi Company of Rajah Group. The company was started in 1948 by Hajee A Abdul Kader Sahib. Around 45,000 workers are working in this company.[1][2]\n","country":"India","source":"https://en.wikipedia.org/wiki/Kaja_Beedi"},{"id":"7b04a588-f167-4654-9dbb-0335e87efb48","name":"Kalnirnay","description":"Kalnirnay (Marathi: कालनिर्णय: timely decision) is a calmanac (Calendar +Almanac) published in India. The almanac gives simplified information about the Panchang, auspicious days, festivals, holidays, sunrise and sunset. It has recipes, stories on health and education, monthly Bhavishya and articles on Hindu astrology.[3]\n","country":"India","industry":"Almanac","source":"https://en.wikipedia.org/wiki/Kalnirnay"},{"id":"c2c518ba-204c-43ab-8fd3-89277e54d319","name":"Kalyan Jewellers","description":"Kalyan Jewellers is an Indian jewellery showroom chain.[1] From a single showroom, single city presence, today, Kalyan Jewellers is present across all major cities in the country and also has a presence in West Asia with over 8000 employees worldwide.[2]\n","country":"India","industry":"Jewellers","source":"https://en.wikipedia.org/wiki/Kalyan_Jewellers"},{"id":"9ec6fc82-9a34-4b32-9328-b7e18d6eb476","name":"KamaSutra (brand)","description":"KamaSutra Condoms is India's second largest condom brand. It is manufactured by J.K. Ansell Ltd. (JKAL), which is a 50:50 joint venture between Raymond Group, India's largest fabric and branded apparel company, and Ansell Limited. JKAL has a condom manufacturing unit in Aurangabad in the state of Maharashtra, India with a manufacturing capacity of 350 million pieces per annum. JKAL commenced operations in 1991 and launched KamaSutra condoms the same year. Prior to the formation of the joint venture in 1996, the condom division was part of J.K. Chemicals Ltd., a subsidiary of the Raymond Group.[1] \n","country":"India","source":"https://en.wikipedia.org/wiki/KamaSutra_(brand)"},{"id":"2561e712-45e9-4018-b03c-31a65f8bef53","name":"Kansai Nerolac Paints","description":"Kansai Nerolac Paints Limited (BSE: 500165, NSE: KANSAINER) (formerly known as Goodlass Nerolac Paints Ltd) is the largest industrial paint and third largest decorative paint company of India based in Mumbai.[3][4][5]\nIt is a subsidiary of Kansai Paint of Japan.[6] As of 2015, it has the third largest market share with 15.4% in the Indian paint industry.[7] It is engaged in the industrial, automotive and powder coating business. It develops and supplies paint systems used on the finishing lines of electrical components, cycle, material handling equipment, bus bodies, containers and furniture industries.\n","country":"India","industry":"Chemicals","source":"https://en.wikipedia.org/wiki/Kansai_Nerolac_Paints"},{"id":"eca86c64-cc20-41e1-bc6d-e99cd116b29b","name":"Karbonn Mobiles","description":"Karbonn Mobiles, is an Indian smartphone manufacturing company founded in March 2009. It is a vendor of feature phones, smartphones, tablets and mobile phone accessories.[2]\nKarbonn is a joint venture between United Telelinks Ltd., a Bengaluru-based firm and Jaina Marketing Pvt. Ltd., headquartered in New Delhi.[2] Karbonn Mobiles also has tie ups with leading telecom players like Airtel, Vodafone, Idea and Jio.[2]\nKarbonn is present in countries such as Bangladesh, Nepal, Sri Lanka and in the Middle East and Europe.[3]\n","country":"India","industry":"Smartphones","source":"https://en.wikipedia.org/wiki/Karbonn_Mobiles"},{"id":"7a90cae7-e81d-4c05-acd4-3ecbfa6a66d0","name":"Kaya Limited","description":"Kaya Clinic (also known as Kaya Skin Clinic) is a provider of skincare, haircare, and beauty solutions. It was founded in 2003 by Harsh Mariwala.[2]\n","country":"India","industry":"Skin Care","source":"https://en.wikipedia.org/wiki/Kaya_Limited"},{"id":"b556f5ef-744a-45dc-b5f2-0b0030880e61","name":"KEC International","description":"KEC International Limited (BSE: 532714) is India's second largest manufacturer of electric power transmission towers[7] and one of the largest[8] Power Transmission Engineering, Procurement & Construction (EPC) companies in the world. It is headquartered in Mumbai, India[9] and is part of the ₹255 billion (US$3.6 billion) RPG Group, engaged in EPC works for Power Transmission, Distribution, Railways, Cables, Solar, Civil and Smart Infrastructure. It has operations in the regions of SAARC, EAP, Africa, Middle East and the Americas.\n","country":"India","industry":"Transmission towers, Distribution, Railways, Solar, Civil & Cables","source":"https://en.wikipedia.org/wiki/KEC_International"},{"id":"9ed2a161-c51d-4ae7-9d26-575fd2741bf7","name":"Kent RO Systems","description":"Kent RO Systems is an Indian healthcare products company headquartered in Noida, Uttar Pradesh. It makes water purifiers based on the process of reverse osmosis purification. Over the years the company has diversified into other products such as air purifiers, vacuum cleaners, vegetable and fruit purifiers and water softeners.[2] The company exports to SAARC countries, Middle East, and Kenya. It expects a contribution of 15% of total turnover to come from exports in the near future.[3] The company won the Golden Peacock Eco Innovation Award for its contribution in developing innovative water purifying technology and preventing environment degradation in 2007.[4] In 2019,  Kent RO Systems received the best domestic water purifier award at the Water Digest Water Awards organized at the Lalit, New Delhi.[5]\n","country":"India","industry":"Consumer Durables, Healthcare","source":"https://en.wikipedia.org/wiki/Kent_RO_Systems"},{"id":"1322568c-2d75-40d2-bb69-2135d3723f98","name":"Kesoram Industries Ltd.","description":"Kesoram Industries Limited is one of the pioneer companies in India. It is under the flagship 'B K Birla Group Of Companies'. Its production ranges from tires to cement to rayon. According to ET500, its all India ranking was 121 for the year 2010 with a net income of Rs. 5020.63 Crore and a net profit of Rs. 648.29 Crore. In 2011, Kesoram Industries installed a small stationary packing unit. Kesoram Industries entered into a joint venture with Maharashtra Seamless Limited and Dhariwal Infrastructure Private Limited in 2012 for working a coal block allocated to it by the Central Government in the State of Maharashtra.[2] The company reported a net profit of Rs. 339.67 crore during the quarter of 2014-15 by selling a tyre plant to JK Tyres.[3]\n","country":"India","source":"https://en.wikipedia.org/wiki/Kesoram_Industries_Ltd."},{"id":"0bed77c9-ae02-4908-86e7-871bfe01ea1f","name":"Khazana Jewellery","description":"Khazana Jewellery is an organised jewellery retail house in South India. It was founded by Mr. Kishore Kumar Jain, and opened its first professionally managed retail showroom in Cathedral road, Chennai, in 1993. It has since expanded to over 48+ showrooms across India, and Dubai.[1]\n","country":"India","industry":"Jewellery","source":"https://en.wikipedia.org/wiki/Khazana_Jewellery"},{"id":"9c3beadc-644f-4dae-a581-a7098e2aeebc","name":"Kingfisher (beer)","description":"Kingfisher is an Indian beer brewed by United Breweries Group, Bangalore. The brand was launched in 1978. With a market share of over 36% in India, it is also available in 52 other countries.[1] The Heineken Group holds 42.4% equity shares in United Breweries Ltd.[2]\nKingfisher is ranked 74th among India's most trusted brands according to the Brand Trust Report 2012, a study conducted by Trust Research Advisory. In the Brand Trust Report 2013, Kingfisher was ranked 102nd among India's most trusted brands and subsequently, according to the Brand Trust Report 2014, Kingfisher was ranked 198th among India's most trusted brands.[3]\n","country":"India","source":"https://en.wikipedia.org/wiki/Kingfisher_(beer)"},{"id":"b0a55d43-3c4d-416a-88c6-631a699ea7ab","name":"Kirloskar Group","description":"The Kirloskar Group is an Indian conglomerate headquartered in Pune, Maharashtra, India.[1] The company exports to over 70 countries over most of Africa, Southeast Asia and Europe.[2] The flagship & holding company, Kirloskar Brothers Ltd established in 1888, is India's largest maker of pumps and valves.[3][4]\n","country":"India","industry":"Conglomerate","source":"https://en.wikipedia.org/wiki/Kirloskar_Group"},{"id":"a8875c52-7dcc-4119-9791-93e2e890edb4","name":"Kisna Diamond Jewellery","description":"Kisna Diamond Jewellery is an Indian diamond brand launched in 2005 by H.K.Jewels, which is the part of Hari Krishna Group Company.[1] Kisna[2][3][4] includes 1877 Designs in rings for men and women, earrings, pendants, necklace, bangles, bracelets, solitaire rings and nose pins.[5][6]\nRecently, Kisna received the brand of year award by GIF.[7][8]\n","country":"India","industry":"Diamonds and Jewellery","source":"https://en.wikipedia.org/wiki/Kisna_Diamond_Jewellery"},{"id":"6c4de7ae-1d2c-4acc-9532-5c14275bbb82","name":"Kokuyo Camlin","description":"Kokuyo Camlin Ltd., formerly known as \"Camlin Ltd.\", is an Indian stationery manufacturing company based in Mumbai. The company shares profits with Kokuyo of Japan, which holds around 51% stake in Kokuyo Camlin after buying it in 2012.[1]\n","country":"India","industry":"Stationery","source":"https://en.wikipedia.org/wiki/Kokuyo_Camlin"},{"id":"291e3915-82fa-444a-a64d-be3cea0ab196","name":"Kumbakonam Degree Coffee","description":"Kumbakonam Degree Coffee is a type of coffee from Kumbakonam, in the Thanjavur District of the state of Tamil Nadu, India.[1] Its speciality is the use of cows' milk without any adulterants.\n","country":"India","source":"https://en.wikipedia.org/wiki/Kumbakonam_Degree_Coffee"},{"id":"54209d5d-d627-4017-ae24-de33aca37c03","name":"Kuthampully Saree","description":"\n\nKuthampully Saree is a type of Sari traditionally made by weavers from Kuthampully village in Thiruvilwamala Grama Panchayat of Thrissur district of Kerala state in India. The Kuthampully Saree [1] is distinguished by its Saree borders.\n","country":"India","source":"https://en.wikipedia.org/wiki/Kuthampully_Saree"},{"id":"9369288a-95d7-4d0d-8060-3c26bbc5eda0","name":"Lakmé Cosmetics","description":"Lakmé is an Indian cosmetics brand which is owned by Hindustan Unilever. Having Kareena Kapoor and Ananya Pandey as the ambassador, it ranked at number 1 among the cosmetics brands in India.\n[1]\n[2][3] Lakme started as a 100% subsidiary of Tata Oil Mills (Tomco). It was named after the French opera Lakmé, which itself is the French form of Lakshmi (the goddess of wealth) who is renowned for her beauty. It was started in 1952 famously, because then Prime Minister Jawaharlal Nehru was concerned that Indian women were spending precious foreign exchange on beauty products and personally requested JRD Tata to manufacture them in India.[4] Simone Tata joined the company as director and went on to become the chairperson.[5] In 1996, Tata sold off their stakes in Lakmé Lever to HUL, for Rs 200 Crore[6](45 million US$).\n","country":"India","industry":"Personal care and Beauty salon","source":"https://en.wikipedia.org/wiki/Lakm%C3%A9_Cosmetics"},{"id":"cd31e0e2-3bec-490c-b8ee-f642df4434e4","name":"Lakshmi Machine Works","description":"Lakshmi Machine Works Limited is  India's largest textile machinery and CNC Machine Tool manufacturers, based in Coimbatore founded by Cavalier Dr. G.K. Devarajulu. It started its operation in 1962 in Periyanaickenpalayam in Coimbatore city with technical collaboration with Swiss-based textile machinery manufacturer Rieter for textile machines and German based Steel and Ammunition major Krupp. In mid 1980's the company bought over its Coimbatore based longtime rival and much older Textile and engineering giant Textool. The company is promoted and owned by the Lakshmi Mills family.\n","country":"India","industry":"Textile, Machine tool, Steel & GI Foundry","source":"https://en.wikipedia.org/wiki/Lakshmi_Machine_Works"},{"id":"24c34bfd-406b-4ac4-b4ef-9d75cd879da9","name":"Larsen & Toubro","description":"Larsen & Toubro Limited, commonly known as L&T is a Indian technology, engineering, construction, manufacturing and financial services conglomerate, with global operations headquartered in Mumbai, Maharashtra, India.[3] It was founded by two Danish engineers taking refuge in India.[4] The company has business interests in basic and heavy engineering, construction, realty, manufacturing of capital goods, information technology, and financial services. As at March 31, 2018, L&T Group comprises 93 subsidiaries, 8 associates, 34 joint-venture and 33 joint operations companies.[5]\n","country":"India","industry":"Conglomerate","source":"https://en.wikipedia.org/wiki/Larsen_%26_Toubro"},{"id":"af6d16c1-2bf1-4e22-a7f2-f3f5a8db23c5","name":"Lava International","description":"Lava International Limited, is an Indian Smartphone Manufacturer company in the mobile handset industry. The company was founded in 2009[3] as an offshoot of a telecommunication venture. It is headquartered in Noida, Uttar Pradesh, India and has overseas operations in Thailand, Nepal, Bangladesh, Sri Lanka, Indonesia, Mexico and the Middle East, Pakistan and Russia.[4] The company started its Africa operations by launching its product in Egypt in 2016.[5][6].\nLava is working towards establishing a mobile phone design centre in India and setting up new manufacturing facilities. \n","country":"India","industry":"\nSmartphones\nFeature phones\nConsumer electronics\nTelecommunications\n","source":"https://en.wikipedia.org/wiki/Lava_International"},{"id":"f6a24197-0b72-490b-88ad-05da03ff3834","name":"Levista (coffee)","description":"Levista is an Indian brand of coffee produced by SLN Coffee and sold in Karnataka and Tamil Nadu.[1]\n","country":"India","source":"https://en.wikipedia.org/wiki/Levista_(coffee)"},{"id":"053e7126-8ed1-4696-9405-242ed85eb8e1","name":"Liberty Shoes","description":"Liberty Shoes Limited (LSL) is an Indian shoe company, based in Karnal, Haryana.\n","country":"India","industry":"Shoe","source":"https://en.wikipedia.org/wiki/Liberty_Shoes"},{"id":"3428e92f-d0e3-4181-8e49-acbb89995d26","name":"Limeroad","description":"Limeroad is an Indian online marketplace[1], owned by A. M. Marketplaces Pvt Ltd.[4] The company is based in Gurugram, Haryana. \n","country":"India","source":"https://en.wikipedia.org/wiki/Limeroad"},{"id":"5f7c4428-8247-4f40-b344-3dfb868641c9","name":"Limtex","description":"Limtex is an Indian multinational company, headquartered in Kolkata, West Bengal, India and a subsidiary of Limtex Group. It exports $40 million in Indian tea annually. Limtex is the leading producer, manufacturer and exporter of Indian Tea both in the domestic and international market. It also has an IT division - Limtex Infotech, which was formed in 2005.\n","country":"India","industry":"Tea Trading, Manufacturing, IT","source":"https://en.wikipedia.org/wiki/Limtex"},{"id":"2d1fc75a-836f-4bdd-be8a-e9e7dbe0b1ce","name":"Linc Pen & Plastics","description":"Linc Pen & Plastics Limited is an Indian stationery manufacturing company based in Kolkata, India. Linc Pen manufactures and markets various writing products.\n","country":"India","source":"https://en.wikipedia.org/wiki/Linc_Pen_%26_Plastics"},{"id":"3ef4908f-90be-4ea5-bab1-f1b281b8487c","name":"Liril","description":"Liril is a popular soap brand sold, to a large degree, in India, and Asia, as well as a few places in Europe. The soap is currently manufactured by Hindustan UniLever Limited in India. Liril launched a blue variant called Icy Cool Mint in 2002. It also tried launching an Orange variant, called Liril Orange Splash in India in 2004. Neither of these variants created much splash in the market. The company even changed agencies handling the brand, from Lowe to McCann Erickson before going back to Lowe.\n","country":"India","source":"https://en.wikipedia.org/wiki/Liril"},{"id":"9898c0e2-48a1-4ffe-afe7-5f115be9c8c6","name":"Lohia Machinery","description":"LML (formerly Lohia Machines Ltd) is a defunct Indian scooter and motorcycle manufacturer formerly based in Kanpur, Uttar Pradesh.\n","country":"India","industry":"Motorcycle","source":"https://en.wikipedia.org/wiki/Lohia_Machinery"},{"id":"ad8a0c76-370e-4dac-ab67-37ed40cff111","name":"Lupin Limited","description":"Lupin Limited is an Indian multinational pharmaceutical company based in Mumbai, Maharashtra, India. It is one of the largest generic pharmaceutical companies by revenue globally.[10] The company's key focus areas include paediatrics, cardiovascular, anti-infectives, diabetology, asthma and anti-tuberculosis.\n","country":"India","industry":"Pharmaceuticals/OTC/FMCG","source":"https://en.wikipedia.org/wiki/Lupin_Limited"},{"id":"4fe53f00-b068-44b0-a31b-942ba961730c","name":"Luxor (pen company)","description":"Luxor International Private Ltd.[5] is an Indian manufacturing company of stationery products based in Noida, India. Luxor manufactures and markets writing instruments and office products under its own brand, also commercialising Pilot, Parker, and Waterman pens (the last two brands, after an agreement with Newell Brands) in India. In the past, Luxor also marketed Paper Mate products.[6]\n","country":"India","industry":"Stationery","source":"https://en.wikipedia.org/wiki/Luxor_(pen_company)"},{"id":"22376ad9-0836-4a68-98ea-47c933a94de1","name":"LYF","description":"LYF (pronounced \"life\"), also known as Reliance LYF, is an Indian Smartphone manufacturer company, headquartered in Mumbai, India. It manufactures 4G-enabled VoLTE smartphones which run on Android.[1][2][3] It is a subsidiary of Reliance Retail, the consumer electronics arm of Reliance Industries Limited.[4] It is operated along with the parent company's flagship venture, Jio.\nAccording to Counterpoint Research, in May 2016, LYF became the fifth largest smartphone player and second largest LTE phone supplier in India.[5][6][7]\n","country":"India","industry":"Consumer electronics","source":"https://en.wikipedia.org/wiki/LYF"},{"id":"11d9ff3d-7fa0-4f04-b6ea-8376f6f23d54","name":"Mahindra Group","description":"The Mahindra Group is an Indian multinational conglomerate holding company headquartered in Mumbai, Maharashtra. It has operations in over 100 countries around the globe. The group has a presence in aerospace, agribusiness, aftermarket, automotive, components, construction equipment, defence, energy, farm equipment, finance and insurance, industrial equipment, information technology, leisure and hospitality, logistics, real estate, retail, and two wheelers.  It is considered to be one of the most reputable Indian industrial houses[3] with market leadership in utility vehicles[4] as well as tractors in India.\n","country":"India","industry":"Conglomerate","source":"https://en.wikipedia.org/wiki/Mahindra_Group"},{"id":"01a6674e-57f7-4e3e-a9d7-78a88872d257","name":"Mahindra Two Wheelers","description":"Mahindra Two Wheelers Limited (MTWL) is a group venture owned by Mahindra & Mahindra Limited (M&M), which manufactures scooters and motorcycles. Mahindra Two Wheelers Limited was founded in 2008, when Mahindra & Mahindra Limited acquired the business assets of Kinetic Motor Company Limited.[1] MTWL has partnered with Taiwan's Sanyang Industry Company (SYM) to help develop its scooter portfolio, and with Italy-based Engines Engineering for research and product design.\n","country":"India","industry":"Motorcycle","source":"https://en.wikipedia.org/wiki/Mahindra_Two_Wheelers"},{"id":"b2855a24-b572-4217-9267-93403d135368","name":"Malabar Gold and Diamonds","description":"Malabar Gold and Diamonds is a BIS certified Indian jewellery group headquartered in Kozhikode, Kerala, India. The Malabar Group of Companies was founded by M. P. Ahammed in the year 1993.[2] Malabar Gold and Diamonds has more than 250 showrooms across 10 countries at present which makes it one of the largest chain of jewellery stores in the world.[3] The company also owns a network of luxury watch boutiques across India, which operates under the name Malabar Watches.[4][5]\n","country":"India","industry":"Jewellers","source":"https://en.wikipedia.org/wiki/Malabar_Gold_and_Diamonds"},{"id":"1b9d1ea0-c286-4437-806b-360662850151","name":"Manjushree Technopack","description":"Manjushree Technopack Limited is India's largest rigid plastic packaging company.[1][2][3] It is based in Bangalore.[4] It was founded by Vimal Kedia and Surendra Kedia.\n","country":"India","industry":"Packaging","source":"https://en.wikipedia.org/wiki/Manjushree_Technopack"},{"id":"46bd264a-7197-4a88-9bc1-2826e4ff6c1e","name":"Mankind Pharma","description":"Mankind Pharma is a pharmaceutical company in India based at New Delhi. The company has products in therapeutic areas ranging from antibiotics, to gastrointestinal, cardiovascular, dermal, and erectile dysfunction medications. They are covering Industrial sectores in Pharmaceuticals, Medical Research & Laboratories domain. Mankind Pharma Ltd is a public company.\n","country":"India","industry":"Pharmaceutical","source":"https://en.wikipedia.org/wiki/Mankind_Pharma"},{"id":"740e88af-6887-461a-b308-dfd63b5e4830","name":"Max Financial Services","description":"Max Financial Services Limited is an Indian public company headquartered in New Delhi, India. It is a subsidiary of Max Group, and is the holding company for the group's life insurance business, Max Life Insurance.[3] In February 2020, the company entered into a long-term strategic partnership with Axis Bank.[4][5] \n","country":"India","industry":"Life insurance","source":"https://en.wikipedia.org/wiki/Max_Financial_Services"},{"id":"95fe36da-d81f-4b84-8621-775f96d5f7fe","name":"Max Group","description":"Max Group is an Indian conglomerate headquartered in New Delhi, India, operating in the fields of life insurance, healthcare, hospitality, real estate and independent senior living.[4] It was founded in 1985 by Analjit Singh.[1]\n","country":"India","industry":"Conglomerate","source":"https://en.wikipedia.org/wiki/Max_Group"},{"id":"fc137189-fb09-4701-9cbb-67930959ea34","name":"Max India","description":"Max India Limited is an Indian public company headquartered in New Delhi, India.[2] It is a subsidiary of Max Group, and is a holding company of the group's healthcare and independent senior living businesses, which include Max Bupa, Max Healthcare, and Antara Senior Living.[3][4] \n","country":"India","industry":"Healthcare","source":"https://en.wikipedia.org/wiki/Max_India"},{"id":"3723a2c1-9040-4742-88b7-4809d6b24a2d","name":"Max Ventures and Industries","description":"Max Ventures and Industries Limited is an Indian public company of Max Group, headquartered in New Delhi, India.[2] It is the holding company for the group's real estate business, Max Estates; packaging business, Max Speciality Films; and the educational arm, Max Learning.[3][4] The company sold a 49% stake of the speciality film business to Toppan Printing, a global printing company headquartered in Tokyo, Japan.[5][6]\n","country":"India","industry":"Real estate, packaging films","source":"https://en.wikipedia.org/wiki/Max_Ventures_and_Industries"},{"id":"bf1ac10a-593e-425c-83e2-70cf765d8f32","name":"McDowell's No.1","description":"McDowell's No.1 previous Asare-Takyi distilleries is an Indian brand of spirits manufactured by United Spirits Limited (USL), a subsidiary of the Diageo. It is USL's flagship brand[1] and the largest umbrella spirits brand in the world, comprising three categories - whisky, brandy and rum (under the name McDowell's No.1 Celebration).[2][2] The brand also has bottled water[3] and soda.[4] The brand began with the launch of McDowell's No.1 Brandy in 1963-64.[5] The brand's slogan is Mera No.1 (My No.1).[6]\n","country":"India","source":"https://en.wikipedia.org/wiki/McDowell%27s_No.1"},{"id":"5ec224ea-a363-44d9-b6b1-67052821576a","name":"McDowell's No.1 Celebration","description":"McDowell's No.1 Celebration also known as Celebration Rum, is a rum manufactured by United Spirits Limited of India. In 2009, it was among world's top 3 best selling rum brands.[1]  In 2013 it overtook Old Monk as largest selling rum of India.[2][3] While in 2015 it also overtook Bacardi as world's largest selling rum brand.[4][5]\n","country":"India","source":"https://en.wikipedia.org/wiki/McDowell%27s_No.1_Celebration"},{"id":"f1128525-566a-4063-8f0c-13078616984f","name":"MDH (spice company)","description":"Mahashian Di Hatti Private Limited,[2][3] doing business as MDH, is an Indian spice producer and seller based in New Delhi, India. It is the second largest leader in the Indian market with 12% market share, following S Narendrakumar's Everest Spices.[4]\n","country":"India","industry":"Food, spices","source":"https://en.wikipedia.org/wiki/MDH_(spice_company)"},{"id":"30c3f26b-a05f-4fcf-a640-c35cf55f9a40","name":"Meswak","description":"\n\nMeswak (also referred to as Miswak) is a toothpaste brand that was launched in India by Balsara Hygiene in 1998.[1] The toothpaste is marketed as a herbal toothpaste[2] as it is made from extracts of the Salvadora persica plant.[3] The brand was relatively unknown until a television advertising campaign during the 1998 Coca-Cola Cup spread brand awareness.[4] In 2005, Meswak was sold by Balsara to Dabur along with other Balsara toothpaste brands Babool and Promise in a ₹1.43 billion (US$20 million) deal.[5][6] As of 2007, the Meswak brand was valued at ₹200 million (US$2.8 million).[7] In 2011, Dabur announced that Bipasha Basu would be Meswak's brand ambassador.[8]\n","country":"India","source":"https://en.wikipedia.org/wiki/Meswak"},{"id":"75fd45c3-71dc-4f8a-baf6-5832913e4bc7","name":"Metro Shoes","description":"Metro Shoes is multi-brand footwear retail chain in India.[1] In 2013, the company announced that it was able to expand the number of its retails stores due to low rental rates, particularly in tier II cities.[2] Metro Shoes has a countrywide network of exclusive Metro showrooms at more than 206 prime locations across 100 plus cities in India.[3]\n","country":"India","industry":"Retail, Fashion, E-commerce","source":"https://en.wikipedia.org/wiki/Metro_Shoes"},{"id":"ec06ad62-46e6-4fdd-a2cc-fa0c0ac4687c","name":"Micromax Informatics","description":"Micromax, is an Indian Smartphone manufacturer and consumer electronics company headquartered in Gurugram, Haryana, India.[1] It was established as an IT software company operating in the embedded devices domain. It later entered the mobile handset business.\nBy 2010, Micromax was one of the largest domestic companies making handsets in the low-cost feature phone segment in India.[2] As of Q3 2014, Micromax is the tenth largest smartphone vendor in the world.[3]  The company is facing stiff competition from Chinese companies that are penetrating the Indian market.[4] The company also owns YU Televentures, which sells the products under the brand name YU.[5]\n","country":"India","industry":"\nTelecommunications\nConsumer electronics\n","source":"https://en.wikipedia.org/wiki/Micromax_Informatics"},{"id":"f3cad579-b468-4e89-9607-5cc75ab24cf5","name":"Milk Mantra","description":"Milk Mantra is an Indian agricultural dairy products startup based in Odisha, India. Founded in August 2009 by former director at Tetley Srikumar Misra and first operational in 2012, it is India's first venture capital-backed agricultural startup. It was set up to solve the milk scarcity problem in the state.[2]\n","country":"India","industry":"Food, dairy, health food","source":"https://en.wikipedia.org/wiki/Milk_Mantra"},{"id":"48e34518-eb5c-4990-83f6-4eefe92a0f4a","name":"Mindtree","description":"Mindtree Limited is an Indian multinational information technology and outsourcing company headquartered in Bangalore, India and New Jersey, USA. It is a Larsen & Toubro group company. Founded in 1999, the company employs approximately 21,991 employees with annual revenue of $1 Billion.[4][5][6]\n","country":"India","industry":"IT services, IT consulting","source":"https://en.wikipedia.org/wiki/Mindtree"},{"id":"2f1fe4bb-105d-4246-8f7d-f7b141e6a8f8","name":"Moods Condoms","description":"Moods Condoms is a manufacturer of condoms made from natural rubber latex. It is manufactured HLL Lifecare Limited, a Government of India undertaking. HLL was started off in 1966 with the objective of producing condoms for the National Family Planning Program. Moods Condoms came into existence in mid-1968, when HLL Lifecare Limited decided to develop a product to target the premium and upper middle class segment of the urban population in India. HLL today is one of the world's largest manufacturers of condoms. As of December 2012, its annual production totals around 800 million pieces across the globe.[citation needed]\n","country":"India","source":"https://en.wikipedia.org/wiki/Moods_Condoms"},{"id":"51431371-ab6b-4541-b230-bdd45d1b778e","name":"Mother Dairy","description":"Mother Dairy Fruit & Vegetable Pvt Ltd is an Indian company that manufactures, markets and sells milk, milk products and other edible products.[1] Its milk products include cultured products, ice cream, paneer and ghee under the Mother Dairy brand. The company also sells edible oils, fresh fruits and vegetables, frozen vegetables, and processed food like fruit juices, jams, pickles, etc. Mother Dairy was founded in 1974, as a wholly owned subsidiary of the National Dairy Development Board (NDDB).\n","country":"India","industry":"\nDairy\nPulses\nFruits\nVegetables\nVegetable Oil\n","source":"https://en.wikipedia.org/wiki/Mother_Dairy"},{"id":"3d63a290-2f8e-4897-8614-e7d95254676d","name":"MRF (company)","description":"MRF Limited (MRF) is an Indian multinational and the largest manufacturer of tyres in India[1] and the fourteenth largest manufacturer in the world.[2] It is headquartered in Chennai, India.[3] The company manufactures rubber products including tyres, treads, tubes and conveyor belts, paints and toys.[4] MRF also runs the MRF Pace Foundation, Chennai and MRF Challenge in motorsport.\n","country":"India","industry":"TyresRubber products","source":"https://en.wikipedia.org/wiki/MRF_(company)"},{"id":"f8003748-24fb-47d6-a722-f983ad2514b9","name":"MTR Foods","description":"MTR Foods is a food products company based in Bengaluru, India. The company manufactures a range of packaged foods including breakfast mixes, ready to eat meals, masalas and spices, snacks and beverages. \n","country":"India","industry":"Food","source":"https://en.wikipedia.org/wiki/MTR_Foods"},{"id":"83890c96-eb87-4c4c-bb97-963a6398d6ee","name":"Mufti (company)","description":"Mufti is Mumbai, India based men clothing fashion brand, which was founded by Kamal Khushlani in 1998.[1][2] The company was started with a RS 10,000 loan from Khushlani's maternal aunt. It manufactures shirts, jeans, t-shirts, sweatshirts, sweaters and jackets.[3] It is owned and managed by Credo Brands Marketing Private Limited.[4] It owns 1,400 multi brand outlets and 120 large format stores.[5][6] In July 2018, Mufti signed Kartik Aaryan as a brand ambassador.[7][8]\n","country":"India","industry":"Apparel, Footwear, Men, India, Fashion, Denim","source":"https://en.wikipedia.org/wiki/Mufti_(company)"},{"id":"a3b8b893-83a6-4a6a-9e22-78edeea045d8","name":"Murugappa Group","description":"Founded in 1900, the INR 369 Billion (36,893 Crores) [3] Murugappa Group[4] is one of India's leading business conglomerates. The Group has 28 businesses including nine listed Companies traded in NSE & BSE. Headquartered in Chennai, the major Companies of the Group include Carborundum Universal Ltd., Cholamandalam Financial Holdings Ltd., Cholamandalam Investment and Finance Company Ltd., Cholamandalam MS General Insurance Company Ltd., Coromandel International Ltd., Coromandel Engineering Company Ltd., EID Parry (India) Ltd., Parry Agro Industries Ltd., Shanthi Gears Ltd., Tube Investments of India Limited., Net Access India Ltd and Wendt (India) Ltd.\n","country":"India","industry":"Conglomerate","source":"https://en.wikipedia.org/wiki/Murugappa_Group"},{"id":"b23fcfce-42c7-44ca-bc87-af7f8172a754","name":"National Aluminium Company","description":"National Aluminium Company Limited, abbreviated as NALCO, (incorporated in 1981) is a Navratna group ‘A’ CPSE having integrated and diversified operations in mining, metal and power under Ministry of Mines, Government of India. Presently, Government of India holds 52% equity of NALCO.\n","country":"India","industry":"Mining, Metals, Power","source":"https://en.wikipedia.org/wiki/National_Aluminium_Company"},{"id":"2b791147-a935-44e4-b857-1a7cb232cbb1","name":"Natural Ice Cream","description":"Natural Ice Cream is an ice cream brand owned by Mumbai-based Kamaths Ourtimes Ice Creams Pvt. Ltd.[1] It was founded by Raghunandan S Kamath who opened its first store at Juhu, Vile Parle (Mumbai) in 2020[2][3][4] The company manufactures under Kamaths Ourtimes and retail operations under its subsidiary company Kamaths Natural Retail Pvt. Ltd. Kamaths Ourtimes is an ISO 22000:2005 certified company.[5] The 2017 rebranding effort, which established the ‘Taste the Original’ tagline, was aimed at setting it apart from me-too brands popping up.[1] On completing 2 Years in  the brand launched an experiential concept store in Juhu named Naturals Now, which serves freshly churned ice cream straight out of the churner. [2]\n","country":"India","source":"https://en.wikipedia.org/wiki/Natural_Ice_Cream"},{"id":"25d6665e-6476-4aea-bab5-9dd6fed56a04","name":"Navayuga Engineering Company Limited","description":"Navayuga Engineering Company Limited (NECL), the flagship entity of the Navayuga Group started its operations in the year 1986 as a private limited company.\n","country":"India","source":"https://en.wikipedia.org/wiki/Navayuga_Engineering_Company_Limited"},{"id":"e37d91e4-9d83-45eb-bbee-3380e7b34428","name":"NBC Bearings","description":"NBC Bearings is the product of National Engineering Industries Limited (NEI), a part of the C K Birla Group, which manufactures a wide range of bearings for the automotive, industrial and railways sector. The company had a gross turnover of Rs 1352 crores in 2013-14.[1] NEI is capable of developing bearings from 6mm bore to 2000mm outer diameter, in over 1500 sizes. The company was founded by Mr B M Birla in 1946 in Jaipur, Rajasthan, India. Its products are exported to more than 30 countries.\n","country":"India","industry":"Bearing Manufacturer","source":"https://en.wikipedia.org/wiki/NBC_Bearings"},{"id":"8239ff25-c042-45b7-9ded-7dcc543af8fb","name":"Nilkamal Plastics","description":"Nilkamal Limited is a plastic products manufacturer based in Mumbai, India. It is the world's largest manufacturer of moulded furniture and Asia's largest processor of plastic moulded products.[2][3] Their product range consists mainly of custom plastic mouldings, plastic furniture, crates and containers. The company also has a chain of retail stores under the @home brand.[4][5][6][7]\n","country":"India","industry":"Furniture","source":"https://en.wikipedia.org/wiki/Nilkamal_Plastics"},{"id":"6370772f-1d2d-440a-bf35-6a22754de16a","name":"Nippo Batteries","description":"Indo National Limited is a company that manufactures batteries in India. The corporate office is in the South-Indian city of Chennai.The company spans 33 offices through the country. Nippo batteries reach millions of homes through 35 distributors, over 2800 stockists, 900 vans and 500 autos covering over 5 lakh (500,000) retail outlets. Nippo is the second largest dry cell battery manufacturer in India, with 28% of the market in 2006.[1] They even started exporting batteries from year 1976 and the first consignment exported to Yemen.[2]\n","country":"India","industry":"Electronics","source":"https://en.wikipedia.org/wiki/Nippo_Batteries"},{"id":"7ce5dfdc-432f-418e-aea6-bae56256869a","name":"Nirma","description":"Nirma is a group of companies based in the city of Ahmedabad in Gujarat, India that manufactures products ranging from Cements, cosmetics, soaps, detergents, salt, soda ash, LAB and Injectables. Karsanbhai Patel, an entrepreneur and philanthropist of Gujarat, started Nirma as a one-man operation. Today Nirma has over 25,000 employees and a turnover of over ₹15500 crore\n","country":"India","industry":"Fast-moving consumer goods","source":"https://en.wikipedia.org/wiki/Nirma"},{"id":"ca9aca8b-fb4d-4dfc-a97a-b45c87d92d22","name":"Nirodh","description":"Nirodh (a.k.a. Deluxe Nirodh) is the first condom brand produced in India.[1] Introduced in 1968, the condom is credited with the success of the family planning and birth control campaign in the country. From 2.40% in 1964, India's population growth rate dropped to 1.80% by 2005 with the help of Nirodh. As of 2015, population growth rate of India was 1.26%.[2][3]\n","country":"India","source":"https://en.wikipedia.org/wiki/Nirodh"},{"id":"3090d961-e4e9-45f7-b41d-f311cacb7b81","name":"Nivia Sports","description":"Nivia Sports is an Indian sports equipment manufacturer based in Jalandhar, Punjab, India, under the banner of FreeWill Sports Pvt Ltd.[4] The firm makes athletic equipment such as footwear, apparel, and accessories for football, cricket, hockey, badminton, basketball, volleyball, and tennis. It has partnered with many national sports events in India.\n","country":"India","industry":"Sports equipment","source":"https://en.wikipedia.org/wiki/Nivia_Sports"},{"id":"5328c610-eb2b-4f01-8a9e-d09502c05960","name":"NRB Bearing","description":"NRB is India's largest needle and cylindrical roller bearings producer headquartered in Mumbai.[5][6][7] NRB was incorporated in 1965 as an Indo-French venture with Nadella and pioneered the production of needle roller bearings in India. Its eight manufacturing facilities in India and Thailand produce needle roller bearings, cylindrical roller bearings, tapered roller bearings, special ball bearings, thrust bearings and other anti friction solutions such as planetary shafts and pins.[8]\n","country":"India","industry":"Roller bearings","source":"https://en.wikipedia.org/wiki/NRB_Bearing"},{"id":"858da5ac-4bb6-414e-a702-503a5476c5b4","name":"Nuziveedu Seeds","description":"it has played an important role in Indian agriculture by developing and supplying quality hybrids and varietal seeds to millions of farmers. Nuziveedu Seeds, which was originally established as a part of NSL Group, has served Indian farmers for more than four decades. The company has its presence in 17 states and markets approximately 350 varieties of seed products to more than 5.5 million farmers across the country.[1]\n","country":"India","industry":"Agribusiness","source":"https://en.wikipedia.org/wiki/Nuziveedu_Seeds"},{"id":"dc878ce3-463a-45c2-b60b-5048a1db872b","name":"Old Monk","description":"Old Monk Rum is an iconic vatted Indian dark rum, launched in 1954.[1] It is blended and aged for a minimum of 7 years. It is a dark rum with a distinct vanilla flavour, with an alcohol content of 42.8%.[2] It is produced in Ghaziabad, Uttar Pradesh.\n","country":"India","source":"https://en.wikipedia.org/wiki/Old_Monk"},{"id":"7f0c4671-bb28-488e-95a2-9bb9bad88e8a","name":"Onida Electronics","description":"Onida Electronics, also known as Mirc electronics is an Indian electronics and home applications manufacturing company of Mirc Electronics, based in Mumbai, India. Onida became well known in India for its colour CRT televisions and Smart TV. It all began with just a vision. In the year of 1981, Mr. GL Mirchandani and Mr. Vijay Mansukhani started a company called MIRC Electronics Limited with just a goal of manufacturing television sets and going beyond convention.\n","country":"India","industry":"Consumer electronics","source":"https://en.wikipedia.org/wiki/Onida_Electronics"},{"id":"029e6223-0bcb-469d-acb4-bed51b05801d","name":"OnMobile","description":"OnMobile is an Indian telecommunications company, headquartered in Bangalore. It offers products such as Videos, Tones, Games & Contests. Based on current deployments, OnMobile has over 100 million active subscribers and an addressable base of more than 1.68 billion mobile users across several geographies.[3]\n","country":"India","industry":"Telecommunications","source":"https://en.wikipedia.org/wiki/OnMobile"},{"id":"f0b19470-32b1-45c4-bd2f-cfea6aa72aa7","name":"Orb Energy","description":"Orb Energy is a solar energy company headquartered in Bangalore, India, founded by Damian Miller and NP Ramesh in 2006.[2]\n","country":"India","industry":"Photovoltaics, Solar Power","source":"https://en.wikipedia.org/wiki/Orb_Energy"},{"id":"712edfa0-10f2-4b5d-b24c-9090d22fa471","name":"Organic India","description":"Organic India is a multi-national company founded in 1997 by spouses Bharat Mitra and Bhavani Lev (née Holly Bronfman), daughter of Edgar Bronfman, in Lucknow, India, that produces organic herbal and Ayurvedic health products.[1][2] The company is  most known for their line of organically grown tulsi teas, which are sold in India, the US, Canada, and the UK.\n","country":"India","industry":"Organic foods, health supplements and Ayurvedic products","source":"https://en.wikipedia.org/wiki/Organic_India"},{"id":"e0bc6a50-e335-4fdb-8cd9-21cf228695af","name":"Orient Electric","description":"Orient Electric Limited (OEL) BSE: 541301 is part of the diversified Indian conglomerate CK Birla Group. It is one of the leading consumer electrical brands in India selling fans, lighting, home appliances and switchgears. It was formerly a division of the Orient Paper & Industries (BSE: 502420), which itself is a subsidiary of the $1.8 billion CK Birla Group. The Scheme of Arrangement between Orient Paper & Industries Limited and Orient Electric Limited and their respective shareholders and creditors was sanctioned by National Company Law Tribunal, Kolkata Bench on 9 November 2017. The company got listed on the Bombay Stock Exchange (BSE) & National Stock Exchange (NSE) on 14 May 2018.[5]\n","country":"India","industry":"Consumer Electronics","source":"https://en.wikipedia.org/wiki/Orient_Electric"},{"id":"ca4b034a-8779-45cd-b12a-0e3884561b60","name":"Oswald Labs","description":"Oswald Labs (formerly Oswald Foundation) is an India and Netherlands-based accessibility technology company that builds products for individuals with disabilities.[1][2] It specializes in enterprise web accessibility, offers smartphone apps, and also runs a startup accelerator.[3][4][5] It was established in 2016 by Anand Chowdhary, Nishant Gadihoke and Mahendra Raghuwanshi after their product, Oswald Extension, won an event at the AngelHack hackathon in New Delhi.[6]\n","country":"India","industry":"AccessibilityResearchSoftware","source":"https://en.wikipedia.org/wiki/Oswald_Labs"},{"id":"1a89f61a-591d-4340-a67a-700b0a79b9bb","name":"Oyo Rooms","description":"Oyo Rooms (stylised as OYO), also known as Oyo Hotels & Homes, is an Indian hotel chain. It is one of the largest and fastest-growing hospitality chains of leased and franchised hotels, homes and living spaces. [1][2][3][4] Founded in 2013 by Ritesh Agarwal, OYO initially consisted mainly of budget hotels. The startup expanded globally with thousands of hotels, vacation homes and millions of rooms in hundreds of cities in India, Malaysia,[5] UAE, Nepal,[6] China, Brazil, Mexico, UK, Philippines, Japan,[7] Saudi Arabia, Sri Lanka,[8] Indonesia, Vietnam, the United States[9] and more.[10][11] \n","country":"India","industry":"Hospitality","source":"https://en.wikipedia.org/wiki/Oyo_Rooms"},{"id":"5142272c-cef3-444c-adf6-4d84f3f06749","name":"Pankajakasthuri Herbals","description":"Pankajakasthuri Herbals India Private Limited is an Ayurvedic medicine manufacturing company based in Trivandrum, Kerala. Established in 1988, Pankajakasthuri manufactures and develops Ayurvedic products and medicines.[1] Pankajakasthuri is Kerala’s first ISO 9000 certified Ayurvedic medicine manufacturing company.[2] \n","country":"India","source":"https://en.wikipedia.org/wiki/Pankajakasthuri_Herbals"},{"id":"6b8b2cfb-bc11-4864-a450-59ff02fd4de6","name":"Parachute (brand)","description":"Parachute is a brand name for a range of coconut-based hair products manufactured by Marico.\n","country":"India","source":"https://en.wikipedia.org/wiki/Parachute_(brand)"},{"id":"64b0ca9b-35e4-4217-bdc9-853e86c3b22b","name":"Parle Products","description":"Parle Products Private Limited[1][2] is an Indian food products company. It owns the famous biscuit brand Parle-G. As of 2012[update], it had a 35% dominant share of the Indian biscuit market.[3] As of 2011, as per Nielsen, it was the largest selling biscuit brand in the world.[4]\n","country":"India","industry":"Food","source":"https://en.wikipedia.org/wiki/Parle_Products"},{"id":"a6e6561a-54ae-497d-9150-abf6ebe65ffa","name":"Parle-G","description":"Parle-G is a brand of biscuits manufactured by Parle Products in India. A 2011 Nielsen survey reported it is the best-selling brand of biscuits in the world.[1]\n","country":"India","source":"https://en.wikipedia.org/wiki/Parle-G"},{"id":"3e3680ad-eea0-4010-8809-caa98a6d31e8","name":"Patanjali Ayurved","description":"Patanjali Ayurved Limited, is an Indian consumer goods company, manufacturing units and headquarters are located in the industrial area of Haridwar, Uttarakhand while the registered office is located at Delhi.[4] The company manufactures mineral and herbal products. According to CLSA and HSBC, Patanjali is the fastest growing FMCG company in India. It is valued at ₹3,000 crore (equivalent to ₹35 billion or US$490 million in 2019) and some predict revenues of ₹5,000 crore (US$700 million) for the fiscal 2015–16.[5][6][7]\nPatanjali declared its annual turnover of the year 2016–17 to be estimated ₹10,216 crore (US$1.4 billion).[8] It was listed 13th in the list of India's most trusted brands (The Brand Trust Report) as of 2018, and ranks first in FMCG category.[9]\n","country":"India","industry":"\nConsumer goods\nHealthcare\n","source":"https://en.wikipedia.org/wiki/Patanjali_Ayurved"},{"id":"b97bdb18-bf6e-48f4-9b03-db8718e22a89","name":"Paytm","description":"Paytm (Meaning Pay through mobile and pronounced similar to ATM) is an Indian e-commerce payment system and financial technology company, based in Noida, India.\n","country":"India","industry":"E-commerceFinance","source":"https://en.wikipedia.org/wiki/Paytm"},{"id":"c2460505-6c1f-49ef-9e50-f5b255c1426f","name":"PC Jeweller","description":"PC Jeweller Limited (BSE: 534809) is a jeweller based in New Delhi, India. It started operations in April 2005 with one showroom at Karol Bagh Delhi and 84 showrooms in India.[1] It is a first generation business promoted by two brothers- Padam Chand Gupta and Balram Garg.[2] It presently has 84 stores in 70 cities and 19 states.[3]\n","country":"India","industry":"Conglomerate","source":"https://en.wikipedia.org/wiki/PC_Jeweller"},{"id":"5cd632ee-2876-43a2-9f38-81f13bdb1402","name":"Performax","description":"Performax Activewear is an Indian sports equipment manufacturer based in Mumbai, Maharashtra, India. The firm makes equipment like footwear, apparel, equipment and accessories for football, cricket, tennis, badminton, running, and cycling. The brand sells its products exclusively at Reliance Trends and AJIO which are also a subsidiary of Reliance Industries Limited and is designed by the French design house- Carlin Groupe.[1]\nPerformax has partnered with many clubs in India like Mumbai Indians [2] in the Indian Premier League and Northeast United FC [3] in the Indian Super League. The company was also announced as the sports manufacture sponsor of another ISL side, Chennaiyin FC [4] for their 2017-18 season.\n","country":"India","industry":"Sports equipment","source":"https://en.wikipedia.org/wiki/Performax"},{"id":"4b504664-1d7a-43e0-b27d-56494f576960","name":"PhonePe","description":"PhonePe Private Limited or PhonePe is an Indian e-commerce payment system and digital wallet company headquartered in Bangalore, India. It was founded in December 2015,[3] by Sameer Nigam and Rahul Chari. PhonePe app went live in  August 2016 and was the first payment app built on Unified Payments Interface (UPI).[6]\n","country":"India","industry":"InternetE-commerce","source":"https://en.wikipedia.org/wiki/PhonePe"},{"id":"e3be6d47-57b1-43c2-abec-c49b157c107a","name":"Piramal Glass","description":"Piramal Glass Limited (NSE: PIRGLASS, BSE: 532949) (formerly known as Gujarat Glass Pvt Ltd) is an Indian glass packaging company providing packaging for Pharmaceutical and Perfume Industry. Prior to acquisition in 1984 by Piramal Group, the company located its manufacturing plant in Kosamba, Gujarat. In 1990 Gujarat Glass Pvt Ltd merged with its parent company Nicholas Piramal India Ltd to become one of its many divisions.[2]\n","country":"India","industry":"Containers & Packaging","source":"https://en.wikipedia.org/wiki/Piramal_Glass"},{"id":"b70470f5-8bf6-4872-8604-d4627ccd700c","name":"Premier (company)","description":"Premier Ltd.[4] (formerly The Premier Automobiles Limited)[5] is a manufacturer of vehicles based in Mumbai, India.[6] The company is owned by the Walchand Group. Walchand established Premier Ltd. with the encouragement and support of architect of modern India, Sir. M. Vishweswarayya. In October 1947 Premier Ltd. manufactured the first Indian made trucks and cars rolled out onto the streets of a free India.[7]\n","country":"India","source":"https://en.wikipedia.org/wiki/Premier_(company)"},{"id":"8f6b117c-2910-43e9-8fa0-6101334f4d48","name":"Promise (brand)","description":"\n\nPromise is a brand of toothpaste that was launched in 1978 by Balsara hygiene in India. Initially, the brand was successful and commanded second highest marketshare after Colgate which was then the market leader. The success of the brand was attributed to the fact that it was positioned as a toothpaste made of clove oil, which is traditionally used in India to treat dental ailments. The brand's tagline was \"The unique toothpaste with time-tested clove oil\".[1] Its brand ambassador was Maya Alagh. In 1994, the company launched a 2-in-1 gel under the Promise brand, however this product failed because it was aimed at the youth segment which did not relate to Promise's strong clove taste.[2] In 2005, Promise was sold by Balsara to Dabur along with other Balsara toothpaste brands Babool and Meswak in a ₹1.43 billion (US$20 million) deal.[3][4]\n","country":"India","source":"https://en.wikipedia.org/wiki/Promise_(brand)"},{"id":"e6b0f696-0654-4c2b-8fee-b46de4c005c5","name":"Pulse (confectionery)","description":"Pulse (Pulse Candy), officially known as Pass Pass Pulse, is a hard candy manufactured by Noida-based DS Group and marketed under its umbrella brand 'Pass Pass'. Originally launched in a 'Kachcha Aam' (raw mango) flavour, the hard-boiled candy is filled with tangy salt and spices (alike Amchoor) in its central core. Pulse is available in Kachcha Aam, Guava, Orange, Pineapple and Litchi flavours. In India, Pulse is sold for ₹1 per 4g candy.[1]\n","country":"India","source":"https://en.wikipedia.org/wiki/Pulse_(confectionery)"},{"id":"26ed7c0f-3984-455d-87c9-71c84740a084","name":"Punjab Tractors Ltd.","description":"Swaraj division[1] is a tractor and farm equipment making company which is owned by Mahindra & Mahindra Ltd. Formerly known as Punjab Tractors Limited, the company was taken over by Mahindra Group in 2007 and subsequently in 2009, the name was changed to Swaraj Division.[2] \nPunjab Tractors was the first Indian company to indigenously manufacture agricultural tractors in India, aptly named as Swaraj - giving a new dimension to the concept of self-reliance put forth by MK Gandhi. The seeds of this organization were sown in Central Mechanical Engineering Research Institute (CMERI), Durgapur (West Bengal) in 1960s in the form of a design project, which later took the form of an organization in Mohali (Punjab), near Chandigarh.\n","country":"India","industry":"Agricultural & Farm Equipment Manufacturers","source":"https://en.wikipedia.org/wiki/Punjab_Tractors_Ltd."},{"id":"c2499b6b-a6b7-4dbb-a59f-1a026f807658","name":"Quick Heal","description":"Quick Heal Technologies Ltd is an IT security services provider headquartered in Pune, India. The company was formerly known as CAT Computer Services (P) Ltd and was started as a computer service center in 1995. The company was renamed as Quick Heal Technologies Pvt. Ltd. in 2007.[1]\n","country":"India","industry":"Computer Security, Virus protection","source":"https://en.wikipedia.org/wiki/Quick_Heal"},{"id":"91831c9b-13a7-4163-8538-935274a84028","name":"Rajesh Masala","description":"Rajesh Masala or Rajesh Spices is an Indian manufacturer, distributor and supplier of ground spices.[1][2] Rajesh Agrahari[3] and Chandrama Devi Agrahari are directors of Rajesh Masala.[4]\n","country":"India","industry":"Food, Spices","source":"https://en.wikipedia.org/wiki/Rajesh_Masala"},{"id":"d8bc72b2-48a0-4782-bd75-d597b5c42822","name":"Ramco Cements","description":"The Ramco Cements Limited (formerly Madras Cements Limited) is a company of the Ramco Group, a business group based in Chennai, India. The company also produces ready mix concrete and dry mortar products and operates wind farms.\n","country":"India","industry":"Building material  power generation","source":"https://en.wikipedia.org/wiki/Ramco_Cements"},{"id":"ef3b677c-3214-4747-b7c6-ed7faa4385e1","name":"Ramco Systems","description":"Ramco Systems Limited (BSE: 532370, NSE: RAMCOSYS, MSE–RSST) is a software and services provider based in India. Founded in 1992, it was initially part of Ramco Group but became an independent company in 1997.[2] Ramco Systems provides Enterprise Resource Planning, Human Capital Management, Logistics and Aviation Maintenance & Engineering (M&E) and Maintenance Repair & Overhaul (MRO) software.[3]\n","country":"India","industry":"Enterprise software","source":"https://en.wikipedia.org/wiki/Ramco_Systems"},{"id":"b33b115c-4013-4755-9c55-f792a81a29fa","name":"Ranbaxy Laboratories","description":"Ranbaxy Laboratories Limited (BSE: 500359) was an Indian pharmaceutical company that was incorporated in India in 1961 and remained an entity until 2014. The company went public in 1973. Ownership of Ranbaxy changed twice over the course of its history. In 2008, Japanese pharmaceutical company Daiichi Sankyo acquired a controlling share in Ranbaxy [2] and in 2014, Sun Pharma acquired 100% of Ranbaxy in an all-stock deal. The Sun Pharma acquisition brought all new management to Ranbaxy, which had been laden with controversy (see Controversies below). Sun is the world's fifth largest specialty generic pharmaceutical company.[3]\n","country":"India","industry":"Pharmaceuticals","source":"https://en.wikipedia.org/wiki/Ranbaxy_Laboratories"},{"id":"e1d4dcee-0c65-4d2f-9097-62cf12ef9f70","name":"Rane Group","description":"RANE GROUP headquartered in Chennai, is an Indian industrial conglomerate. Beginning as a dealer for automobile, trucks and auto-parts in Madras in the 1920s, Rane has grown to encompass ten different companies as of 2013.\n","country":"India","source":"https://en.wikipedia.org/wiki/Rane_Group"},{"id":"531212a0-6467-4066-b00d-3979be9686c1","name":"RBL Bank","description":"RBL Bank, formerly known as Ratnakar Bank, is an Indian private sector bank headquartered in Mumbai and founded in 1943.[3] It offers services across six verticals: corporate and institutional banking, commercial banking, branch and business banking, retail assets, development banking and financial inclusion, treasury and financial market operations.[4][5]\n","country":"India","industry":"BankingFinancial services","source":"https://en.wikipedia.org/wiki/RBL_Bank"},{"id":"c1d40282-f648-4123-8fd6-aff2d746c404","name":"Relaxo","description":"Relaxo Footwears Limited is an Indian multinational footwear manufacturer based in New Delhi. It is the largest footwear manufacturer in India in terms of volume and second-largest in terms of revenue,[3]  with a market share of more than 5 percent.[4] The company makes products under 10 brands including Flite, Sparx, Bahamas and Schoolmate.[5][6][7][8][9]\n","country":"India","industry":"Footwear","source":"https://en.wikipedia.org/wiki/Relaxo"},{"id":"82061286-1f4b-4172-8c34-c1b1ce32e7c7","name":"ReNew Power","description":"ReNew Power Limited is an Indian renewable energy company headquartered in Gurgaon, Haryana, India.[1][2] It is an independent power producer (IPP) with an installed capacity of more than 5600 MW [3] across the states of Rajasthan, Madhya Pradesh, Karnataka, Andhra Pradesh, Telangana, Maharashtra and Gujarat,[4] ReNew Power commissioned its first wind farm project in Mahidad - Rajkot district in Gujarat in 2012. Shri. Narendra Modi, the Prime Minister of India, inaugurated the 25.2 MW wind farm at Jasdan.[5]\n","country":"India","industry":"Renewable energy","source":"https://en.wikipedia.org/wiki/ReNew_Power"},{"id":"fc2ea4aa-d6d1-4230-aa63-d084cc9aea52","name":"Rolta","description":"Rolta is an Indian multinational company headquartered in Mumbai, India. The company focuses on IT solutions, Business Intelligence and BigData Analytics, Geospatial and Engineering.[1]\nThe company is listed on the Bombay Stock Exchange and National Stock Exchange of India.[2] The Company's GDRs are listed on the Main Board of London Stock Exchange.[3] The Company’s ‘Senior Notes’ are listed on Singapore Stock Exchange.[4]\n","country":"India","industry":"IT services, IT consulting","source":"https://en.wikipedia.org/wiki/Rolta"},{"id":"0f19e094-dd9f-4bf5-a9ad-641436fbe17f","name":"Roots Industries","description":" Roots Industries India Limited is an Indian automobile brand and is the first largest auto horn manufacturer in the world. The company manufactures a wide range of products which includes industrial cleaning systems, scrubber driers, vacuum cleaners, golf carts, electric carts, 14 seater electric buses, electric trikes, and battery operated vehicles. It was founded in 1970 by K. Ramasamy.[1][2] [3][4][5][6]\n","country":"India","source":"https://en.wikipedia.org/wiki/Roots_Industries"},{"id":"32a8deeb-10ed-4d3c-b57d-34fa020f9551","name":"Royal Enfield (India)","description":"Royal Enfield is an Indian motorcycle manufacturing brand with the tag of \"the oldest global motorcycle brand in continuous production\"[3] manufactured in factories in Chennai in India. Licensed from Royal Enfield by the indigenous Indian Madras Motors, it is now a subsidiary of Eicher Motors Limited, an Indian automaker.[4] The company makes the Royal Enfield Bullet, and other single-cylinder and twin-cylinder motorcycles.[5] First produced in 1901, Royal Enfield is the oldest motorcycle brand in the world still in production, with the Bullet model enjoying the longest motorcycle production run of all time.\n","country":"India","industry":"Automotive","source":"https://en.wikipedia.org/wiki/Royal_Enfield_(India)"},{"id":"a19ee24e-ba5a-48aa-b27e-729e2ff24996","name":"RRB Energy","description":"RRB Energy Limited is a privately owned company that serves in the realm of wind power generation based out of New Delhi.[1] The production plants of the company are based in Delhi and Tamil Nadu.[2] RRB Energy has nationwide presence in India from Tamil Nadu, Maharashtra, Madhya Pradesh, Karnataka, Gujarat and Rajasthan. The company also has a government approved R&D facility which develops higher MW capacity turbines.[3]\n","country":"India","industry":"Wind power industry","source":"https://en.wikipedia.org/wiki/RRB_Energy"},{"id":"addf18aa-ebf4-4014-bcad-4010daa4947f","name":"Rupa Company","description":"Rupa is among the largest knitwear brands in India that produces innerwear, casual wear, thermal wear and sleep wear for men, women and kids. While Frontline is its flagship brand, Rupa family also consists of brands like Softline, Euro, Bumchums, Torrido, Thermocot, Macroman, Footline and Jon. Rupa was established by Mr P R Agarwala, Mr G P Agarwala and Mr K B Agarwala with a vision to serve the erstwhile hosiery market, which was at a very nascent stage at that time and mainly addressed by the unorganized players. Over the years, it has emerged as a key player in Indian Innerwear segment known for its comfort and pricing. \n","country":"India","industry":"Inner wear & casual wear","source":"https://en.wikipedia.org/wiki/Rupa_Company"},{"id":"c6338191-46c2-4d31-958a-6ffc05435343","name":"SAS Motors","description":"SAS Motors Limited (Angad) is a public limited company incorporated from April 2003 with the mission of making low-cost farm mechanization technology available to Indian farmers.  Its flagship product is ‘Angad’ 240 D tractor. The company is engaged in sourcing, assembling, manufacturing, and marketing of ‘Angad’.  SAS Motors also provides a range of agricultural equipment\n","country":"India","source":"https://en.wikipedia.org/wiki/SAS_Motors"},{"id":"e077a823-03da-4808-b404-9f77ae2437ca","name":"Satya Paul","description":"Satya Paul is an Indian designer label known for indigenous prints. It was founded on 1 April 1985 by Satya Paul. The brand is acclaimed for ingenuity in its design sensibility and a vivid color palette.  The brand has grown from strength to strength and is now present across  India. Founded by designer Satya Paul and helmed by Sanjay Kapoor (Founder - Genesis Luxury) along with Paul's son Puneet Nanda (Creative Director of Satya Paul till 2010).[1][2][3][4]\n","country":"India","industry":"Fashion","source":"https://en.wikipedia.org/wiki/Satya_Paul"},{"id":"18b3b255-ac3e-4c1c-b213-0a28fb82dd48","name":"Savita Oil Technologies Limited","description":"Savita Oil Technologies Limited (BSE: 524667, NSE: SOTL)[3] (formerly known as Savita Chemical) is an Indian automotive, industrial lubricant and petroleum specialty oils production company with its headquarters at Mumbai, Maharashtra.[4][5] It has primarily engaged in manufacturing of petroleum specialties such as transformer oils, liquid paraffin and white oils, petroleum jellies, synthetic petroleum sulfonates and other specialties.[6][7] Savita Oil has been ranked #42 in Fortune Next 500 list under lube oil and lubricants category, by Fortune India.[8]\nThe company is also involved in manufacturing of automotive and industrial lubricants.[9] In 2018, the company relaunched Savsol, a domestic brand of lubricants and engine oils.[7][4][10][11]\n","country":"India","industry":"Oil and Automotive","source":"https://en.wikipedia.org/wiki/Savita_Oil_Technologies_Limited"},{"id":"a519439a-5f4f-4ffa-98aa-773bfc257bcf","name":"Seniority (company)","description":"Seniority is a Pune (India) based retail company.[1][2] Founded by Ayush Agrawal ,[3][4] and Tapan Mishra, Seniority provides health and lifestyle products for senior citizens in India.[1][2][3]\n","country":"India","source":"https://en.wikipedia.org/wiki/Seniority_(company)"},{"id":"a98ba678-a3d9-4c98-8795-14c7e9c24782","name":"SEVEN (brand)","description":"SEVEN is an Indian lifestyle brand that manufactures and markets casual and sportswear clothing and footwear. The brand was launched in February 2016 by famous Indian cricketer and former captain of the Indian national cricket team, Mahendra Singh Dhoni. Dhoni is the brand ambassador of SEVEN and also owns footwear side of the business.[1][2]\n","country":"India","source":"https://en.wikipedia.org/wiki/SEVEN_(brand)"},{"id":"4a6758fb-468e-4ac5-9047-7c8a6d447ad0","name":"Shakti Pumps","description":"Shakti Pumps India Limited  is a manufacturer of submersible pumps for domestic, industrial, horticultural and agricultural use[citation needed]. Shakti pumps exports to more than 100 countries,[citation needed] with branches in the USA, Australia and UAE.The company is listed in the Bombay Stock Exchange and the National Stock Exchange of India.[1] The company has two manufacturing facilities with a capacity of 500,000 pumps per year.[citation needed] Shakti Pumps is also one of the largest manufacturers and exporters of solar pumps in India.[citation needed]\n","country":"India","industry":"Pumps","source":"https://en.wikipedia.org/wiki/Shakti_Pumps"},{"id":"6e1901c2-9124-4797-aa21-a1a2d255f121","name":"Shalimar Paints","description":"Shalimar Paints BSE: 509874 is an Indian paints manufacturing company. The company is engaged in manufacturing and marketing of decorative paints and industrial coatings. Some of India’s buildings and structures such as the Howrah Bridge, Rashtrapati Bhawan, Salt Lake Stadium, All India Institute of Medical Sciences, and many others, continue to be painted with Shalimar Paints.[3]\n","country":"India","industry":"Paint","source":"https://en.wikipedia.org/wiki/Shalimar_Paints"},{"id":"d5f5e704-f1de-4a62-832d-3ca926b4e495","name":"ShopClues","description":"ShopClues is an online marketplace owned by Clues Network Pvt. Ltd.[3] It was established in July 2011 in Silicon Valley by Sanjay Sethi, Sandeep Aggarwal and Radhika Aggarwal.[4] Based in Gurgaon, India,[5] the company claims to have over 600,000 merchants and 28 million products on its platform, serving over 32,000 pincodes across the country.[6]\n","country":"India","industry":"Internet","source":"https://en.wikipedia.org/wiki/ShopClues"},{"id":"f9360929-7a0e-419f-ac9f-462cb0a97157","name":"Simmtronics","description":"Simmtronics Semiconductor Ltd is an Indian privately held, multinational computer technology company that develops, manufactures,[1] \nsells and supports - memory module, motherboard,[2] \ntablet PC,[3][4] \nSimmbook,[5] \nlow cost PC[6] \nand other computer related parts.\n","country":"India","industry":"Electronics Industry","source":"https://en.wikipedia.org/wiki/Simmtronics"},{"id":"14af0a31-8ad8-4b04-aa2a-8188d0b6b80d","name":"Sipani","description":"Sipani Automobiles Ltd. (known as SAIL [Sunrise Automotive Industries Ltd.] until 1978)[1] was an Indian car manufacturer established in 1973, located in Bangalore.[2] They mainly manufactured subcompact cars with fibreglass bodies. They also took over Auto Tractors Limited in 1991 and manufactured diesel engines and tractors in the old ATL factory in Pratapgarh, Uttar Pradesh.[3]\n","country":"India","industry":"Automotive","source":"https://en.wikipedia.org/wiki/Sipani"},{"id":"43ffca9d-07b4-4785-b5a7-ce38bf4caec8","name":"Siti Networks","description":"Siti Networks Ltd (formerly known as Wire and Wireless (India) Limited (WWIL)) is a multi system operator (MSO) owned by the Essel Group. The company provides digital cable television services in India and is headquartered in Noida, Uttar Pradesh.[1][2][non-primary source needed]\n","country":"India","industry":"Media & Entertainment","source":"https://en.wikipedia.org/wiki/Siti_Networks"},{"id":"fc72b42c-729f-46c1-a43f-74426431a14a","name":"Skipper Limited","description":"Skipper Limited [BSE|538562] is an Indian transmission and distribution structures (towers and poles) manufacturing company. Skipper Limited was set up in 1981 and is a part of the SK Bansal Group.[4] Skipper Limited manufactures power transmission and telecom towers, tubular and hi-mast poles, railway electrification structures, solar structures (solar module mounting structures), electric resistant welded (ERW) tubes and polymer products (pipes and fittings). Skipper undertakes activity from angle rolling to fabrication and galvanising, proto assembly, load testing and EPC line construction. Skipper Limited is also in the power distribution and transmission infrastructure sector and the polymer pipes and fittings industry.[5] Skipper Limited exports its products to more than twenty countries including South America, Europe, Africa, Middle East, South and Southeast Asia, and Australia.[6]\n","country":"India","industry":"2015\n","source":"https://en.wikipedia.org/wiki/Skipper_Limited"},{"id":"96766843-8bbf-4291-9ac3-a3e839919824","name":"Smith & Jones instant noodles","description":"Smith & Jones is the brand name of instant noodles & sauces manufactured and distributed by Capital Foods Ltd India.[1][2]\n","country":"India","source":"https://en.wikipedia.org/wiki/Smith_%26_Jones_instant_noodles"},{"id":"c131b998-5cd9-492d-bf5c-c3ef59ba070c","name":"Snapdeal","description":" Snapdeal  is an Indian e-commerce company based in New Delhi, India. The company was started by Kunal Bahl and Rohit Bansal in February 2010.[4]\n","country":"India","industry":"Internet","source":"https://en.wikipedia.org/wiki/Snapdeal"},{"id":"2761358e-cfa3-42ee-aa86-c69a7fead5e2","name":"Society Tea","description":"Society Tea is an Indian tea brand, headquartered in Mumbai, Maharashtra, India. It is part of a group founded in 1933. The company is the tea-seller in the state of Maharashtra, with a 10% market share[1] within the state. Besides Maharashtra, the brand is also present in other Indian states like Goa, Andhra Pradesh, Karnataka and Tamil Nadu.[2] \n","country":"India","industry":"Food","source":"https://en.wikipedia.org/wiki/Society_Tea"},{"id":"b7e155eb-f7fa-462d-9f7d-823c6dedcd85","name":"Sonodyne","description":"Sonodyne is an Indian electronics company founded in the 1960s by Ashoke Mukherjee. It specializes in amplifiers, speakers and active speakers. Their studio products division operates in over 40 nations.[1]\n","country":"India","source":"https://en.wikipedia.org/wiki/Sonodyne"},{"id":"dec30165-8a9f-460e-99ca-9fb8488b5056","name":"Spice Digital","description":"Spice Digital Limited (formerly registed as Cellebrum Technologies) is an Indian telecommunications company headquartered in Noida, India, a subsidiary of Spice Connect. The company specializes in Mobile Value Added Services, along with Telco Solutions, enterprise solutions[buzzword], financial technology, GST Suvidha Provider (GSP), and digital transformation products and services.\n","country":"India","industry":"[[FinTech_in_India|Telecom Solutions[buzzword] & FinTech]]","source":"https://en.wikipedia.org/wiki/Spice_Digital"},{"id":"9c6a5209-093a-46ae-956f-977b35e762da","name":"SpiceJet","description":"SpiceJet is an Indian low-cost airline headquartered in Gurgaon, Haryana. It is the second largest airline in the country by number of domestic passengers carried, with a market share of 13.6% as of March 2019.[4] The airline operates 630 daily flights to 64 destinations, including 54 Indian and 15 international destinations from its hubs at Delhi and Hyderabad.\n","country":"India","source":"https://en.wikipedia.org/wiki/SpiceJet"},{"id":"3655363a-2419-4918-96c1-cae9ea66d67a","name":"Sterlite Technologies","description":"STL - Sterlite Technologies Limited (Formerly Sterlite Tech) NSE:  STRTECH[4] formed in 1988 is a digital  technology company with offices in India, China, US, SEA, Europe and MEA. It is listed on Bombay Stock Exchange and National Stock Exchange of India . It has 358[5] patents and is active in over 150 countries.\n","country":"India","industry":"TelecommunicationsTechnologyDatacentersVirtualized NetworksNetwork equipment","source":"https://en.wikipedia.org/wiki/Sterlite_Technologies"},{"id":"cd2639b1-8d7b-4c3c-aabf-f9c7ad73cfc4","name":"Stir Crazy Thane","description":"Stir Crazy Thane is an oriental restaurant based in Thane, India at Viviana Mall, founded by hotelier Rohit Narang of Mars Group in collaboration with Master Chef Sanjeev Kapoor.[1][2][3]\n","country":"India","industry":"Restaurants","source":"https://en.wikipedia.org/wiki/Stir_Crazy_Thane"},{"id":"f32ca4f6-0ca8-4564-ad9e-2c0bc7f1474d","name":"Stovekraft","description":"Stovekraft is an Indian company that manufactures cooking appliances under Pigeon and Gilma brands. The company was founded in 1999 and is headquartered in Bangalore, Karnataka. Among its cooking appliances are mixer grinders, pressure cookers, cooktops, toasters, chimneys and kitchen utensils.[3][4] It sells its products in 23 states in India and 12 countries overseas. Around 80 percent of Stovekraft's employees reportedly are women.[5]\n","country":"India","source":"https://en.wikipedia.org/wiki/Stovekraft"},{"id":"8bcace76-8868-4d50-b455-fa5bd526820a","name":"Su-Kam Power Systems","description":"Su-Kam Power Systems Ltd. was an Indian power solutions provider which sold its products in more than 90 countries.[3] The company provided power back-up solutions for both domestic as well as industrial markets, and focuses on eco-friendly energy solutions like solar power. Some of the major products include solar charge controller,[4] solar power conditioning units, solar grid-tie inverters,[5] solar off-grid power systems, home inverters, home UPS, Online UPS, line interactive UPS, batteries, battery chargers and Battery Equalizers.[3]\n","country":"India","industry":"Energy","source":"https://en.wikipedia.org/wiki/Su-Kam_Power_Systems"},{"id":"c3144968-7d28-4159-900f-17f5192b960f","name":"Sun Direct","description":"Sun Direct is an Indian direct broadcast satellite service provider. Its satellite service, launched in December 2007,[1] transmits digital satellite television and audio to households in India. Sun Direct usesSun Direct call MPEG-4 digital compression, transmitting HD Channels on GSAT-15 Sun Direct at 93.5°E. and SD Channels on MEASAT-3 at 91.5°E.[2]\n","country":"India","industry":"Satellite television","source":"https://en.wikipedia.org/wiki/Sun_Direct"},{"id":"937ff8ba-d4ec-4538-93e7-d0d7a9b2b68f","name":"Sun Pharmaceutical","description":"Sun Pharmaceutical Industries Limited (NSE: SUNPHARMA, BSE: 524715) is an Indian multinational pharmaceutical company headquartered in Mumbai, Maharashtra, that manufactures and sells pharmaceutical formulations and active pharmaceutical ingredients (APIs) primarily in India and the United States. The company offers formulations in various therapeutic areas, such as cardiology, psychiatry, neurology, gastroenterology and diabetology. It also provides APIs such as warfarin, carbamazepine, etodolac, and clorazepate, as well as anti-cancers, steroids, peptides, sex hormones, and controlled substances.[3]\n","country":"India","industry":"Pharmaceuticals","source":"https://en.wikipedia.org/wiki/Sun_Pharmaceutical"},{"id":"0fd312dc-8f8b-43dd-822a-c87c30e990b7","name":"Sunita Kohli","description":"Sunita Kohli is an Indian interior designer, architectural restorer and furniture manufacturer. She had restored and decorated Rashtrapati Bhavan (the President's House), Parliament House Colonnade (1985–1989), the Prime Minister's Office and Hyderabad House in New Delhi.[1][2][3]\n","country":"India","source":"https://en.wikipedia.org/wiki/Sunita_Kohli"},{"id":"1a26cc88-a0c8-4ba8-b626-5efdd1e1c4d9","name":"Suzlon","description":"Suzlon Energy Ltd. is a wind turbine supplier based in Pune, India. It was formerly ranked by MAKE as the world's fifth largest wind turbine supplier.[2] It has since dropped out of the Global top ten rankings (as of 2014) due to extensive losses and inability to repay debts.[3] \nThe company's website claims to have over 17,000 MW of wind energy capacity installed globally, with operations across 18 countries and a workforce of over 8,000.[4] Despite financial issues, it continues to be a major manufacturer of wind turbines;[5] in 2016, the company posted a profit EBITDA after accruing losses over seven consecutive years.[6]\n","country":"India","industry":"Renewable energy","source":"https://en.wikipedia.org/wiki/Suzlon"},{"id":"1a918866-cfee-4986-a83a-3b60248f064e","name":"Sylvania (brand)","description":"Sylvania  is a Canadian multinational electronics corporation headquartered in Etobicoke, Ontario, Canada. Owned by Osram Sylvania and Feilo Sylvania in different parts of the world.  The two license the brand to other companies for various products.  The Sylvania brand was originally owned by Sylvania Electric Products.[1]\n","country":"India","industry":"Consumer electronicsHome appliances","source":"https://en.wikipedia.org/wiki/Sylvania_(brand)"},{"id":"b084aec0-5048-42e3-86c9-d2e81e37d845","name":"Taj Hotels","description":"Taj Hotels is a chain of luxury hotels and a subsidiary of the Indian Hotels Company Limited;[2] headquartered at Express Towers, Nariman Point in Mumbai.[3] Incorporated by the founder of the Tata Group, Jamsetji Tata, in 1903,[4][5] the company is a part of the Tata Group, one of India's largest business conglomerates. The company employed over 20,000 people in the year 2010.[6][7]\n","country":"India","industry":"Hospitality","source":"https://en.wikipedia.org/wiki/Taj_Hotels"},{"id":"493b9063-583c-4280-8be2-20b45ed2cbe2","name":"Tanishq","description":"Tanishq is a  jewellery brand of India. It is a division of Titan Company,[1] a company promoted by the Tata Group in collaboration with the Tamil Nadu Industrial Development Corporation (TIDCO). Tanishq's headquarters is at Bengaluru (Bangalore) in Karnataka.[2][3]\n","country":"India","industry":"Jewellers","source":"https://en.wikipedia.org/wiki/Tanishq"},{"id":"93139cbc-61e8-4059-9747-6bffc8241e0f","name":"Tata Cliq","description":"Tata Cliq, (stylised as Tata CLiQ) is an Indian e-commerce company based in Mumbai, India.[2] It is owned by Tata UniStore Limited, of Tata Group.[3]. TataCLiQ operates in categories such as Electronics, Fashion, Footwear and Accessories. Tata Group's E-commerce platform Tata CLiQ also launched a premium and luxury fashion and lifestyle destination, Tata CLiQ Luxury and It have house a wide range of apparel and accessories for men and women by luxury and bridge-to-luxury brands.\n","country":"India","industry":"\nE-commerce\nInternet\nRetail\nLuxury Retail\n","source":"https://en.wikipedia.org/wiki/Tata_Cliq"},{"id":"ae19b95f-efc5-460f-9950-58ea6e2ec93b","name":"Tata Consumer Products","description":"Tata Consumer Products Limited, formerly Tata Global Beverages Limited, is an Indian multinational non-alcoholic beverages company headquartered in Mumbai, Maharashtra, India and a subsidiary of the Tata Group. It is the world's second-largest manufacturer and distributor of tea and a major producer of coffee.[6]\n","country":"India","industry":"Food processing","source":"https://en.wikipedia.org/wiki/Tata_Consumer_Products"},{"id":"2c0e5caa-a06e-4178-9cc4-2d17f656dabe","name":"Tata Group","description":"Tata Group (/ˈtɑːtɑː/) is an Indian multinational conglomerate holding company headquartered in Mumbai, Maharashtra, India. Founded in 1868 by Jamsetji Tata, the company gained international recognition after purchasing several global companies. One of India's largest conglomerates, Tata Group is owned by Tata Sons.[3][4] It is one of the biggest industrial groups in the country, founded 153 years back in 1868. \nEach Tata company operates independently under the guidance and supervision of its own board of directors and shareholders.\n","country":"India","industry":"Conglomerate","source":"https://en.wikipedia.org/wiki/Tata_Group"},{"id":"1bd64f2b-2cdd-4064-9ccd-47a32a3ce5f0","name":"Tata Motors","description":"Tata Motors Limited, formerly Tata Engineering and Locomotive Company (TELCO), is an Indian multinational   automotive manufacturing company headquartered in Mumbai, Maharashtra, India. It is a part of Tata Group, an Indian conglomerate. Its products include passenger cars, trucks, vans, coaches, buses, sports cars, construction equipment and military vehicles.[3]\n","country":"India","industry":"Automotive","source":"https://en.wikipedia.org/wiki/Tata_Motors"},{"id":"808bf0f3-cb41-4711-a914-32b6e1515b70","name":"Tata Salt","description":"Tata Salt was launched in 1983 by Tata Chemicals as India's first packaged iodised salt brand.\nThe brand is now the biggest packaged salt brand in India, with a market share of 17%.\n","country":"India","industry":"FMCG, Food","source":"https://en.wikipedia.org/wiki/Tata_Salt"},{"id":"28389352-8f1b-43e9-b54b-0b1ca5ba595b","name":"Tata Sky","description":"Tata Sky (stylised as TATA | sky) is an Indian direct broadcast satellite service provider in India, using MPEG-4 digital compression technology, transmitting using INSAT-4A and GSAT-10 satellite.[1] Incorporated in 2006, Tata Sky is a joint venture between the Tata Group and The Walt Disney Company with Temasek Holdings as a minor partner. It was started as a joint venture between Tata Group and 21st Century Fox (now owned by The Walt Disney Company).\n","country":"India","industry":"Satellite television","source":"https://en.wikipedia.org/wiki/Tata_Sky"},{"id":"b6086621-b4da-4649-95b1-5009e63ba8b0","name":"The Brand Trust Report","description":"The Brand Trust Report, India Study is an annual study by N. Chandramouli based on a primary research conducted across Indian cities based on a proprietary 61-attribute \"Trust Matrix\". The research studies trust attitudes and preferences of brand influencers and also lists the most trusted brands in India. The research report is available in hardcover.\n","country":"India","source":"https://en.wikipedia.org/wiki/The_Brand_Trust_Report"},{"id":"2173671e-d326-4e3f-af84-64e4d8b91ad2","name":"The Himalaya Drug Company","description":"The Himalaya Drug Company is an Indian company established by Muhammad Manal in 1930 and based in Bengaluru, Karnataka, India. It produces health care products under the name Himalaya Herbal Healthcare whose products include ayurvedic ingredients. It is spread across locations in India, United States, Middle East, Asia, Europe and Oceania.,[3] while its products are sold in 106 countries across the world.[4]\nThe company has more than 290 researchers that utilise ayurvedic herbs and minerals.[5] A Hepatic drug, named Liv.52, is its flagship product, first introduced in 1955. Liv.52 to date has now over 215 clinical trials backing it.[4][6]\n","country":"India","industry":"Pharmaceuticals","source":"https://en.wikipedia.org/wiki/The_Himalaya_Drug_Company"},{"id":"e0a40c90-83ae-455f-b6e1-03062f89086c","name":"The Oberoi Group","description":"The Oberoi Group is a hotel group with its head office in Delhi.[2] Founded in 1934, the company owns and/or operates 31 luxury hotels and two river cruise ships in six countries, primarily under its Oberoi Hotels & Resorts and Trident brands.\n","country":"India","industry":"Hospitality","source":"https://en.wikipedia.org/wiki/The_Oberoi_Group"},{"id":"bbbd24c1-686b-41e4-abfa-ba3b29eba593","name":"The Oriental Insurance Company","description":"The Oriental Insurance Company Ltd.  is a public sector general insurance company of India. The headquarter of the company is located in New Delhi. It has 31 regional offices and more than 1800 active branches across the country. The company also has branches in Nepal, Kuwait, and Dubai. The company had recorded  a gross premium of Rs. 7282.54 crores in the financial year 2013-2014. For the Financial year 2016-17, the Company procured a global premium of Rs. 11,100 crores.[1] The Company offers more than 170 General Insurance products. The IRDA Registration No. of the Company is \"556\".[2]\n","country":"India","industry":"Financial services","source":"https://en.wikipedia.org/wiki/The_Oriental_Insurance_Company"},{"id":"8f8091da-3ef7-4833-b623-43712eb25278","name":"The Times Group","description":"Bennett, Coleman and Company Limited,[3][4] commonly known as The Times Group, is India’s largest media conglomerate, according to Financial Times as of March 2015.[5] The Audit Bureau of Circulations reported in May 2014 that the Times of India had the largest circulation of any English-language newspaper in the world, with 3,321,702 average qualifying sales.[5][6] The company remains a family-owned business as the descendants of Jain own a majority stake in The Times Group. The Times Group has over 11,000 employees and revenue exceeding $1.5 billion.[2]\n","country":"India","industry":"\nMass media\nNewspaper\n","source":"https://en.wikipedia.org/wiki/The_Times_Group"},{"id":"e183d1cc-2c5d-41b0-ac88-5f4d54a45240","name":"Thermax","description":"Thermax Limited, (BSE: 500411, NSE: THERMAX) an engineering company involved in energy and environment.\n","country":"India","industry":"Energy, Environment and Chemical","source":"https://en.wikipedia.org/wiki/Thermax"},{"id":"4d342dd2-ed7a-4695-a38f-b1bfcc072e2e","name":"Times Internet","description":"Times Internet is an Indian company which owns, operates and invests in various Internet-led products, services and technology. It is the digital arm of the Times Group, the largest media conglomerate in India.[1][non-primary source needed]\n","country":"India","industry":"Internet services","source":"https://en.wikipedia.org/wiki/Times_Internet"},{"id":"1d07840e-fbb9-44b8-a83e-edb3055a844e","name":"Titan Company","description":"Titan Company Limited (earlier known as Titan Industries Limited) is an Indian consumer goods company that mainly manufactures fashion accessories such as watches, jewellery and eyewear. Part of the Tata Group, the company is headquartered in Electronic City, Bangalore.[6].\nIt commenced operations in 1984 under the name Titan Watches Limited. In 1994, Titan diversified into jewellery with Tanishq and subsequently into eyewear with Titan Eyeplus. In 2013, Titan entered the fragrances segment with the brand Skinn[7] and later that year, it ventured into the helmets category under its brand Fastrack.[8].\n","country":"India","industry":"Lifestyle","source":"https://en.wikipedia.org/wiki/Titan_Company"},{"id":"1877775f-2de4-4885-ac1b-c73a37047fd0","name":"Torque Pharmaceuticals","description":"Torque pharmaceuticals is an Indian pharmaceutical company with production units at Issapur, Derabassi in Punjab and at Jharmajri, Baddi in Himachal Pradesh. It manufactures medicines for prevention and treatment of various health related problems. The product range comprises antibiotics, nutritional supplements and cough syrup to antipyretics and anti-inflammatory products.\n","country":"India","source":"https://en.wikipedia.org/wiki/Torque_Pharmaceuticals"},{"id":"b7686537-975c-4f82-b0a7-0d9716785087","name":"Torrent Cables","description":"Torrent Cables Limited is a cable manufacturer company based in Ahmedabad, India.\n","country":"India","industry":"Cables","source":"https://en.wikipedia.org/wiki/Torrent_Cables"},{"id":"6fc8d361-cbf9-4314-814e-4908ed977ed6","name":"Torrent Pharmaceuticals","description":"Torrent Pharmaceuticals Ltd. is the flagship company of the Torrent Group. Based in the Indian city of Ahmedabad. It was promoted by U. N. Mehta, initially as Trinity Laboratories Ltd, and was later renamed Torrent Pharmaceuticals Ltd.\n","country":"India","industry":"Pharmaceuticals","source":"https://en.wikipedia.org/wiki/Torrent_Pharmaceuticals"},{"id":"a41465dd-c3e9-4107-bd49-7ac4536d7fb2","name":"Tractors and Farm Equipment Limited","description":"Tractors and Farm Equipment Limited (TAFE), is a tractor manufacturer in Chennai, India.\n","country":"India","industry":"Agriculture, Manufacturing","source":"https://en.wikipedia.org/wiki/Tractors_and_Farm_Equipment_Limited"},{"id":"993d5b91-48d0-4c12-b2bf-dc93af6c3f41","name":"Tribhovandas Bhimji Zaveri","description":"Tribhovandas Bhimji Zaveri Ltd. (TBZ) is a noted Indian jeweller and jewellery retail chain based in India.[2] Established in 1864 (153 years ago) by Tribhovandas Bhimji Zaveri in Zaveri Bazaar, the jewellery district of Mumbai, it was subsequently headed by his son, Gopaldas Tribhovandas Zaveri, and now Shrikant Zaveri, is the present chairman and managing director of the group. The company today, has 37 showrooms in 23 cities across eleven states, including Mumbai, Surat, Kochi, Bhopal, Hyderabad, Kolkata, and Rajkot[3][4] The company proposed an Initial Public Offer (IPO) in July 2011.[5]\n","country":"India","source":"https://en.wikipedia.org/wiki/Tribhovandas_Bhimji_Zaveri"},{"id":"37b170df-bbc2-49df-aa73-4622f1c573cf","name":"Trio (Indian soft drink)","description":"Trio is a popular South Indian soft drink, especially popular in Tamil Nadu.[1]\n","country":"India","source":"https://en.wikipedia.org/wiki/Trio_(Indian_soft_drink)"},{"id":"155c7139-51f3-46c9-ad8c-09fb016080c7","name":"TTK Prestige","description":"TTK Prestige Limited is an Indian company that manufactures kitchen appliances and cookware, under the Prestige brand. The company is best known for its pressure cookers.[5]\n","country":"India","source":"https://en.wikipedia.org/wiki/TTK_Prestige"},{"id":"2ebbfdff-7c05-4edf-898f-c073bcd96cff","name":"TVS Motor Company","description":"TVS Motor Company (T.V.S) is an Indian multinational motorcycle company headquartered at Chennai, India. It is the third largest motorcycle company in India with a revenue of over ₹20,000 crore (US$2.8 billion) in 2018–19. The company has an annual sales of 3 million units and an annual capacity of over 4 million vehicles. TVS Motor Company is also the 2nd largest exporter in India with exports to over 60 Countries.\n","country":"India","industry":"Automotive","source":"https://en.wikipedia.org/wiki/TVS_Motor_Company"},{"id":"32798616-46c0-49f6-83d7-94549f011446","name":"TYKA Sports","description":"TYKA is a sportswear and sports equipment brand introduced by TK Sports Private Limited in 2009. Primarily being the kit partner for various cricket teams across the world, TYKA is now associated with various football teams.\n","country":"India","industry":"Sports wear, accessories","source":"https://en.wikipedia.org/wiki/TYKA_Sports"},{"id":"5a1ddb6d-ae5d-406e-82bd-78dd808a17fd","name":"Ullu App","description":"Ullu App is an on-demand streaming platform, owned and maintained by Vibhu Agarwal.[1] The Video on Demand is currently available for Android, iOS and not available for Apple TV, Amazon Fire TV, Android TV and Roku.\n","country":"India","industry":"Streaming","source":"https://en.wikipedia.org/wiki/Ullu_App"},{"id":"206958e9-9152-49ae-acaa-462fc41d9754","name":"UltraTech Cement","description":"UltraTech Cement Limited is an Indian cement company based in Mumbai.[3]\n","country":"India","industry":"Building materials","source":"https://en.wikipedia.org/wiki/UltraTech_Cement"},{"id":"3572f015-7bd3-4f63-8a0e-4220d4b6079c","name":"Uncle Chipps","description":"Uncle Chipps is a brand of potato chips that is marketed in India.[1] It was launched on 1992 by Amrit Agro Ltd. which was later taken over by Frito Lay (owned by PepsiCo), India in 2000.[2]\n","country":"India","source":"https://en.wikipedia.org/wiki/Uncle_Chipps"},{"id":"7b929bf2-ab11-4a4c-85bc-478a4b68d410","name":"Unichem Laboratories","description":"Unichem Laboratories was founded in 1944 by Padmabhushan Late Mr. Amrut V Mody, a pioneer in the Indian pharmaceuticals business. The Initial Public Offering of Unichem Laboratories Limited was in the year 1963 and the Company was consequently listed on BSE Limited and NSE Limited.\n","country":"India","industry":"Pharmaceutical & healthcare","source":"https://en.wikipedia.org/wiki/Unichem_Laboratories"},{"id":"55fc4392-7fbb-4431-8e16-b75a01f3b591","name":"Union Bank of India","description":"Union Bank of India (UBI; BSE: 532477) is one of the largest government-owned banks of India. After the amalgamation with Corporation Bank and Andhra Bank, which came into effect on 1 April 2020, the amalgamated entity becomes the fourth largest bank in terms of branch network and fifth largest in terms of business.The Central government owns over 90% of its share capital. It is listed on the Forbes 2000, and has assets of US$13.45 billion. UBI now has around 9500 branches after the amalgamation. Four of these are overseas in Hong Kong, Dubai, Antwerp, and Sydney. UBI also has representative offices at Shanghai, Beijing and Abu Dhabi. Lastly, UBI operates in the United Kingdom through its wholly owned subsidiary, Union Bank of India (UK).Union Bank of India was the anchor bank for both Andhra bank and corporation bank. Amagalamation of Union bank of India, Andhra Bank and Corporation Bank became effective on 1 April 2020 as announced by finance Minister of India Nirmala Sitharaman. Union bank of India has workforce of around 75000 employees and officers.\n","country":"India","industry":"Banking, financial services","source":"https://en.wikipedia.org/wiki/Union_Bank_of_India"},{"id":"aecdc2eb-0e29-47df-8afd-64333e54f267","name":"User:Navneet.chauhan87/Goldi solar","description":"Goldi Solar Private Limited (Formerly Goldi Green Technologies Pvt. Ltd.) is an Indian company based in Surat and is a bloomberg Tier 1 solar panel manufacturing company in India.[1] The company’s primary business focus is manufacturing solar PV modules and also carries out engineering, procurement and construction services and operations & maintenance of solar power plants. Goldi Solar serves customers worldwide.[2] Goldi Solar is an ISO 9001:2015, ISO 14001:2015 and OHSAS 18001:2007 certified company.[3] ","country":"India","industry":"Solar energy","source":"https://en.wikipedia.org/wiki/User:Navneet.chauhan87/Goldi_solar"},{"id":"b1d202cc-fe87-4745-a384-37e6a963d8d6","name":"User:Vensatry/sandbox","description":"Barbeque Nation is an Indian restaurant chain owned by Barbeque Nation Hospitality Ltd. The first restaurant opened in Mumbai in January 2006. The restaurant chain also has private equity firm CX Partners as its investor.[1] Shortly after its start in Mumbai, it opened in other cities such as Ahmedabad, Amritsar, Bengaluru, Bareilly, Bhubaneshwar, Calicut, Chandigarh, Chennai, Coimbatore, Dehradun, Erode, Faridabad, Gurgaon, Guwahati, Hubli,  Hyderabad, Jaipur, Jalandhar, Jammu, Kanpur, Kochi, Kolhapur, Kolkata, Lucknow, Ludhiana, Madurai, Mangalore, Manipal, Meerut, Mohali, Mumbai, Mysuru, Nagpur, Nashik, Nellore, New Delhi, Panji, Patiala, Puducherry, Pune, Raipur, Salem, Surat,Thiruvananthapuram, Thrissur, Trichy, Udaipur, Vadodara, Vijayawada and Visakhapatnam in India. In Nov 2016, started an outlet in Al Barsha, Dubai, United Arab Emirates. Recently it increased in number of outlets by opening in Patna, Bihar.\n","country":"India","industry":"Restaurants","source":"https://en.wikipedia.org/wiki/User:Vensatry/sandbox"},{"id":"731b08d3-126f-4179-8ce6-4b9862bf3dc1","name":"V-Guard Industries","description":"V-Guard Industries Ltd is a major electrical appliances manufacturer in India, and the largest in the state of Kerala with an annual turnover of ₹23.21 billion (US$340 million) in financial year 2017–18.[1] The company manufactures voltage stabilizers, electrical cable, electric pumps, electric motors, geysers, solar water heaters, electric fans and UPSs. It was founded in 1977 by Kochouseph Chittilappilly as a small voltage stabilizer manufacturing unit.\n","country":"India","source":"https://en.wikipedia.org/wiki/V-Guard_Industries"},{"id":"b3fdeb89-ab5d-408a-95bb-47474bf212c6","name":"Vadilal","description":"Vadilal Industries Ltd is an Indian ice cream and flavoured milk manufacturer. The company is also one of the largest processed food manufacturers in India[citation needed] with significant exports of frozen vegetables and ready to eat snacks, curries, and breads.[citation needed]\n","country":"India","industry":"Conglomerate","source":"https://en.wikipedia.org/wiki/Vadilal"},{"id":"49651e80-32e8-47ae-8aaa-002fa10cd1aa","name":"Vallée de Vin","description":"Vallée de Vin is an Indian winery which was founded in 2006.[1] Vallee de Vin was set up in collaboration with Ravi Jain, Deepak Roy and Neeraj Deorah.[2]  \nVallée de Vin offers five varietals of Zampa still wines, its flagship brand of premium wines and Zampa Soirée range of two premium sparkling wines. Labels from the brand are  available in Mumbai, Pune, Delhi, Gurgaon and Goa.[1] In 2012, Vallée de Vin merged with Grover Vineyards to form Grover Zampa, which is today the second largest vineyard in India after Sula Vineyards.[3]\n","country":"India","industry":"Wine","source":"https://en.wikipedia.org/wiki/Vall%C3%A9e_de_Vin"},{"id":"55bec649-e48e-47a6-86e9-87964514a682","name":"Vicco Group","description":"Vicco Group of Companies (Vishnu Industrial Chemical Company[2]) was founded by late Shri K.V. Pendharkar in 1952. Under the umbrella of Vicco Group, Vicco Laboratories is a manufacturer of Indian Ayurvedic herbal hygiene, healthcare and other products like herbal tooth pastes, herbal tooth powders, natural turmeric and sandalwood oil based skin cream, herbal shaving creams and a natural ayurvedic pain relief cream Vicco Narayani.[3]\n[4]\n[5]\n","country":"India","industry":"Conglomerate","source":"https://en.wikipedia.org/wiki/Vicco_Group"},{"id":"01c91b31-a4d1-4257-901e-050392f18ab1","name":"Videocon Group","description":"Videocon Industries Limited was a large diversified Indian company headquartered in Mumbai.[3] The group has 17 manufacturing sites in India and plants in Mainland China, Poland, Italy and Mexico. It was the third largest picture tube manufacturer in the world.[4] The group is a US$5.5 billion global conglomerate. Videocon has various brands under its portfolio.[5]\n","country":"India","industry":"Conglomerate","source":"https://en.wikipedia.org/wiki/Videocon_Group"},{"id":"3cba774b-ee29-44c1-86d6-7cbd014db14b","name":"Vikram Solar","description":"Vikram Solar Limited is an Indian company based in Kolkata and the second-largest solar energy company in India by revenue.[1] The company’s primary business focus is manufacturing solar PV modules and also carries out engineering, procurement and construction services and operations & maintenance of solar power plants. It is a subsidiary of Vikram Group, which also has subsidiaries in the tea processing, textiles and engineering industries.[2][3][4][5]","country":"India","industry":"Solar energy","source":"https://en.wikipedia.org/wiki/Vikram_Solar"},{"id":"3e9b82fa-78bc-40fc-aae5-1b661d42b8d0","name":"VIP Industries","description":"VIP Industries Ltd, is an Indian luggage Manufacturer company which manufactures luggage and travel accessories. It is based in Mumbai, India and is the world's second largest and Asia's largest luggage maker.[7] The company has more than 8,000 retail outlets across India and a network of retailers in 50 countries. It acquired United Kingdom based luggage brand Carlton in 2004.[8][9]\n","country":"India","industry":"Luggage","source":"https://en.wikipedia.org/wiki/VIP_Industries"},{"id":"d8c66b56-edd5-43fe-9054-b8f0ac87c175","name":"Vistara","description":"Tata SIA Airlines Limited, operating as Vistara, is an Indian  full-service airline, based in Gurgaon, with its hub at Indira Gandhi International Airport. The carrier, a joint venture between Tata Sons and Singapore Airlines, commenced operations on 9 January 2015 with its inaugural flight between Delhi and Mumbai. The airline had carried more than two million passengers by June 2016[2] and as of May 2019, has a 4.7% share [3] of the domestic carrier market, making it the 6th largest domestic airline.[4] The airline serves 34[5] destinations with a fleet of Airbus A320, Boeing 787 and Boeing 737-800NG[6] aircraft.\n[7]\n","country":"India","source":"https://en.wikipedia.org/wiki/Vistara"},{"id":"a54a21da-a9ec-4694-af9b-5a5a92f16dbe","name":"VKC Footwear","description":"VKC Group is a footwear manufacturing and marketing  company, based in the Kozhikode district of Kerala state, in India.\n","country":"India","industry":"Footwear Manufacturing","source":"https://en.wikipedia.org/wiki/VKC_Footwear"},{"id":"2c4fc890-ac61-4f03-8ee5-c92890a48113","name":"Vodafone Idea","description":"Vodafone Idea Limited[9][10] is an Indian telecom operator[11] with its headquarters based in Mumbai, Maharashtra and Gandhinagar, Gujarat.[12][13] Vodafone Idea is a pan-India integrated GSM operator offering 2G, 3G and 4G, 4G+ and VoLTE mobile services under two brands named Vodafone and Idea. Vodafone Idea also provides services including Mobile payments, IoT, enterprise offerings and entertainment, accessible via both digital channels as well as on-ground touch points, centres across the country.[14] As of 31 December 2019, Vodafone Idea has a subscriber base of 332.65 million,[7] making it second largest mobile telecommunications network in India and fifth largest mobile telecommunications network in the world.[10] Vodafone Idea has a broadband network of 340,000 sites, distribution reach of 1.7 million retail outlets.[14]\n","country":"India","industry":"Telecommunications","source":"https://en.wikipedia.org/wiki/Vodafone_Idea"},{"id":"182e6986-504c-4bef-8e3d-50dd905995fe","name":"Voltas","description":"Voltas Limited, is an Indian Home appliances company specialising in air conditioning and cooling technology.\nThe company is broadly structured into projects and products business. The projects business is divided into Domestic Projects Group (DPG) and International Operations Business Group (IOBG). Meanwhile, the products business is classified into Unitary Products Business Group (UPBG), Mining & Construction Equipment Division (MCED), and Textile Machinery Division. (TMD).\n","country":"India","industry":"\nHome appliances\nConsumer electronics\n","source":"https://en.wikipedia.org/wiki/Voltas"},{"id":"e86fcdd6-dc18-4f16-91a0-18f5f5c35914","name":"Voodoo Cream Liqueur","description":"Voodoo Cream Liqueur is the first Indian cream liqueur, made from fresh Indian cow cream, whisky and other Italian ingredients. The trademark is owned by Nouveau group in collaboration with Flavor Chimca, Italy [1] Voodoo cream liqueur is blended & bottled at Adinco Distillers, Goa, and was first produced in 2009.[2] It has a declared alcohol content of 17% alcohol by volume. Voodoo Cream Liqueur is similar to Bailey's, Amarula, and Carolans.[3]\n","country":"India","source":"https://en.wikipedia.org/wiki/Voodoo_Cream_Liqueur"},{"id":"6b7db0dd-5a5e-482f-bd99-9c077b29303c","name":"VRL Group","description":"VRL Logistics Limited (formerly Vijayanand Roadlines Ltd.),[5] commonly known as the VRL Group, is an Indian conglomerate headquartered in Hubballi, Karnataka, India with operations in around 23 states and 4 union territories in the country. Business operations of VRL Group include road transportation, logistics, publishing etc.\n","country":"India","source":"https://en.wikipedia.org/wiki/VRL_Group"},{"id":"82725807-4637-45c2-9d93-82f2454e9c8c","name":"Wadia Group","description":"The Wadia Group is one of the oldest conglomerates of India. The group was founded by Parsi Lovji Nusserwanjee Wadia in 1736. Lovji Wadia secured contracts with the British East India Company to build ships and docks in Bombay in 1736.[3] This, and subsequent efforts, would result in Bombay becoming a strategic port for the British colonial undertakings in Asia. \nThe Bombay dry-dock, the first dry-dock in Asia, was built by Lovji and his brother Sorabji in 1750.\n","country":"India","industry":"Conglomerate","source":"https://en.wikipedia.org/wiki/Wadia_Group"},{"id":"0ba05896-9f02-4cd8-921f-ae64607ee7a5","name":"Wheel (detergent)","description":"Wheel is a brand of laundry detergent manufactured by Hindustan Unilever Ltd. This product was created specifically by Hindustan Unilever to counter Nirma, the low cost detergent, which had taken the ground away from Surf, the top selling detergent at that time from Hindustan Unilever. Salman Khan, a Bollywood superstar, endorsed it . It was introduced in 1987.\n","country":"India","source":"https://en.wikipedia.org/wiki/Wheel_(detergent)"},{"id":"ea17ab48-781d-43eb-bf40-42f713f6888f","name":"Wildcraft","description":"Wildcraft, is an Indian manufacturing company headquartered in Bengaluru. The company's products are sold in over 175 exclusive stores and 4,000 multi-branded stores in India and abroad.[1] The co-founders of the company are Siddharth Sood and Gaurav Dublish.\n","country":"India","industry":"Retail","source":"https://en.wikipedia.org/wiki/Wildcraft"},{"id":"4ec65aac-bf0a-4d52-9864-ba690e2f936a","name":"Wipro","description":"Wipro (formerly, Western India Palm Refined Oil Limited, legally  Wipro Limited) is an Indian multinational corporation that provides information technology, consulting and business process services. It is headquartered in Bangalore, Karnataka, India.[3]\nIn 2013, Wipro separated its non-IT businesses and formed the privately owned Wipro Enterprises.[4]\n","country":"India","industry":"Conglomerate","source":"https://en.wikipedia.org/wiki/Wipro"},{"id":"577d15df-50df-46df-8f44-b91dba9d402c","name":"Wok Express","description":"Wok Express is one of India's first Pan Asian affordable food brands in the QSR (quick-service restaurants) space that caters to the mass audience.[1] Wok Express was launched in Mumbai on May 2015, having started the first outlet at Bandra, further expanding to Churchgate & Bandra Kurla Complex, business neighbourhoods of Mumbai, within the same year.\n","country":"India","industry":"Food and beverages","source":"https://en.wikipedia.org/wiki/Wok_Express"},{"id":"e08ec8eb-06c9-4f52-9814-4cd501c6d359","name":"Wow! Momo","description":"Wow! Momo is an Indian chain of fast food restaurants headquartered in Kolkata, West Bengal, India, specializing in momos,  dumpling popular in Nepal, Tibet and India.[1][2] It was established in 2008 by Sagar Daryani and Binod Homagai, alumni of St. Xavier's College, in Kolkata.[3][4]\n","country":"India","industry":"Food and beverageFast food restaurantsFood delivery","source":"https://en.wikipedia.org/wiki/Wow!_Momo"},{"id":"e3685d66-446c-46ea-93e4-e9db52fb78a1","name":"Xolo (company)","description":"Xolo, stylised as XOLO is an Indian mobile brand by Lava International, headquartered in Noida.[1] It manufactures personal electronics devices such as smartphones, tablets and laptops, and accessories such as powerbanks.\nIn April 2012, Xolo launched India's first smartphone with an Intel processor, the Xolo X900.[2][3]\n","country":"India","source":"https://en.wikipedia.org/wiki/Xolo_(company)"},{"id":"ce4793cc-d223-43cb-b3d7-33f3e373b8b2","name":"Yepme","description":"Yepme is an online shopping company headquartered in Gurugram, Haryana, India. It was established in April 2011.[1] The company specializes in the online retailing of men's and women's garments and accessories. In August 2011, the company positioned itself as a fully-fledged private label fashion brand.[1][2]\n","country":"India","industry":"Online shopping & Online Services","source":"https://en.wikipedia.org/wiki/Yepme"},{"id":"213fb08d-4b04-4f85-9e30-f0e779b2a04b","name":"YU Televentures","description":"YU Televentures is an Indian consumer electronics brand that was created on 18 December 2014[1] as a joint venture between Cyanogen Inc and Micromax Informatics Limited. Also, YU holds official Cyanogen OS rights in India.[2] Where in December 2016 the CyanogenMod developer group discontinued the Cyanogen OS. Micromax co-founder Rahul Sharma owns a 99% controlling stake in YU while the remaining 1% is held by two other co-founders, Vikas Jain and Sumeet Arora.[citation needed]\n","country":"India","industry":"Telecommunications, Consumer Electronics","source":"https://en.wikipedia.org/wiki/YU_Televentures"},{"id":"69c2294b-022d-49f8-8f02-19949c889612","name":"Zandu Realty","description":"Zandu Realty Limited (formerly Zandu Pharmaceutical Works Limited)[3] is an international pharmaceutical company based in Mumbai, India.[4] Company's core business of manufacturing and dealing in ayurvedic and medicinal preparations.\n","country":"India","industry":"Pharmaceutical, Real Estate","source":"https://en.wikipedia.org/wiki/Zandu_Realty"},{"id":"0c317560-fd49-4686-9c5d-5afc8b46ff00","name":"Zeta India","description":"Zeta is an Indian FinTech company, co-founded by entrepreneurs Bhavin Turakhia and Ramki Gaddipati in 2015. The company offers a full stack, cloud native, API-first neo-banking platform. It also has a digital core and a payment engine for issuance of credit, debit and prepaid products.[1][2][3]\n","country":"India","source":"https://en.wikipedia.org/wiki/Zeta_India"},{"id":"ad709822-4200-46e3-9f99-e8a020fb275b","name":"Zoho Corporation","description":"Zoho Corporation Private Limited is an Indian software development company. The organisation focuses on web-based business tools and information technology, including an office tools suite, Internet of things management platform, and a suite of IT management software. The company was founded in 1996 by Sridhar Vembu and Tony Thomas in Pleasanton, California, and currently holds its presence in seven countries with its global headquarters in Chennai, Tamil Nadu, India and corporate headquarters in Pleasanton.\n","country":"India","industry":"software industry ","source":"https://en.wikipedia.org/wiki/Zoho_Corporation"},{"id":"49b9394d-8fa6-4b2e-baa8-8bd7b6cc5fe3","name":"Zync Global","description":"Zync Global Pvt Ltd is an Indian company that offers tablets,[1] phablets,[2] and GSM mobile services in India. Apart from tablet manufacturing, the company is moving into the mobile and accessories manufacturing.\n","country":"India","industry":"Telecommunications","source":"https://en.wikipedia.org/wiki/Zync_Global"}]