[{"id":"6b4eb045-f92b-4a62-9630-40c712f6b5ba","name":"Society Tea","description":"Society Tea is an Indian tea brand, headquartered in Mumbai, Maharashtra, India. It is part of a group founded in 1933. The company is the tea-seller in the state of Maharashtra, with a 10% market share[1] within the state. Besides Maharashtra, the brand is also present in other Indian states like Goa, Andhra Pradesh, Karnataka and Tamil Nadu.[2] \n","country":"India","industry":"Private"},{"id":"8605dce7-724d-49df-a5f6-7f28dfbc81df","name":"1-India Family Mart","description":"1-India Family Mart is a chain of value retail stores in India operated by Nysaa Retail Pvt. Ltd.[3][4] The chain has the total of 100 stores across East and North of India.[5] 1-India Family Mart has established the first store in Uttar Pradesh and later has expanded operations across Bihar, Chhattisgarh, Uttrakhand, Jharkhand, Madhya Pradesh, Odisha and the North East.[6][7]\n","country":"India","industry":"Private"},{"id":"25335d51-e551-4567-87ac-2379406fe889","name":"Aashirvaad","description":"Aashirvaad is a brand of staple food and kitchen ingredients owned by ITC Ltd.[1] The Aashirvaad range of products include Atta with halal certification, Salt, Spices and Instant mixes.\n","country":"India","industry":""},{"id":"b3b66b74-0a2d-4a15-a172-42b56964cad6","name":"Aavin","description":"Aavin is the trademark of Tamil Nadu Co-operative Milk Producers' Federation Limited, a Tamil Nadu-based milk producer's union. Aavin procures milk, processes it and sells milk and milk products to consumers.\n","country":"India","industry":"Cooperative"},{"id":"689328e6-3166-4551-8e9c-0faa286db1f7","name":"Action Construction Equipment","description":"Action Construction Equipment Ltd. is an Indian material handling and construction equipment manufacturing company, incorporated in 1995.[1][2][3][4]\n","country":"India","industry":"Private Company"},{"id":"838fad82-38c1-4c8a-a942-50225bda8d78","name":"Aditya Birla Payments Bank","description":"Aditya Birla Payments Bank Limited (ABPB) was a payments bank started as a joint venture by Aditya Birla Nuvo Ltd. and Idea Cellular.[1] Launched on February 22, 2018, it is the fourth payments bank to begin operations since issuance of licenses to 11 firms by the Reserve Bank of India in August 2015.[2][3] Payments Banks are a special category of banks that can accept deposits of up to 1 lakh but cannot give loans or credit cards.[4]\n","country":"India","industry":"Financial services"},{"id":"39308d1b-a824-478f-bb1c-44aa72a86955","name":"Air Deccan","description":"Air Deccan is an Indian regional commuter airline currently operating from Ahmedabad, Gujarat. It flies to a total of four destinations using Beech 1900D aircraft, as of November 2019.[4]\n","country":"India","industry":"\n\n\n\nIATA\n\nICAO\n\nCallsign\n\n\nDN\n\nDKN\n\nAIR DECCAN\n"},{"id":"d748a89f-1f63-4aae-accc-359d49ea10af","name":"Air India","description":"Air India is the flag carrier airline of India, headquartered at New Delhi.[9] It is owned by Air India Limited, a government-owned enterprise, and operates a fleet of Airbus and Boeing aircraft serving 102 domestic and international destinations. The airline has its hub at Indira Gandhi International Airport, New Delhi, alongside several focus cities across India. Air India is the largest international carrier out of India with an 18.6% market share.[10] Over 60 international destinations are served by Air India across four continents. The airline became the 27th member of Star Alliance on 11 July 2014.\n","country":"India","industry":"\n\n\n\nIATA\n\nICAO\n\nCallsign\n\n\nAI[1]\n\nAIC[1]\n\nAIR INDIA[2]\n"},{"id":"3d63dc14-235d-4378-9bcc-fc3e8153d7e7","name":"Air Ink","description":"AIR-INK is a proprietary brand of ink and composites products made by condensing carbon-based gaseous effluents generated by air pollution due to incomplete combustion of fossil fuels.[1] Founded by Graviky Labs, a spin-off group of MIT Media Lab, AIR-INK produces its materials through a step-by-step process which primarily involves capturing of emissions, separation of carbon from the emissions, and then mixing of this carbon with different types of oils and solutions to achieve advanced material properties. It uses a patented device and technique called 'KAALINK' to carry out the filtration of soot, which contains carbon and other polluting agents like heavy metals and Polycyclic aromatic hydrocarbon.\n","country":"India","industry":"Material Science, Industrial inks"},{"id":"34734518-a2ff-457b-981c-64fb2bdbfc73","name":"Airtel digital TV","description":"Bharti Telemedia Limited d/b/a Airtel digital TV is an Indian direct-broadcast satellite service provider owned and operated by Bharti Airtel.[3] Its satellite service, launched in October 2008, transmits digital satellite television and audio to households in India.[4] It has a total subscriber base of 10.07 million as of 30 March 2015.[5][6]\n","country":"India","industry":"Subsidiary"},{"id":"b225276a-2057-4c09-8763-96a493addbc3","name":"Airtel Payments Bank","description":"Airtel Payments Bank is a public limited company with its headquarters in New Delhi, India. The company is a subsidiary of Bharti Airtel. It is the first company in India to receive a payments bank license from the Reserve Bank of India and it became the first live payments bank in the country.[2] On April 11, 2016 the Reserve Bank of India issued the license under Section 22 (1) of Banking Regulation Act, 1949 to Airtel Payments Bank.[3] Airtel Payments Bank is a joint venture between Bharti Airtel Ltd. and Kotak Mahindra Bank Ltd.. Kotak Mahindra Bank holds 19.9% stake in the Airtel Payments Bank.\n","country":"India","industry":"Public company"},{"id":"ccc11db5-9916-4f77-be02-13b7a6a6c3a5","name":"Alembic Pharmaceuticals Ltd","description":"Alembic Pharmaceuticals Ltd. is an Indian multinational pharmaceutical company headquartered in Vadodara city of Gujarat – India.[2] Alembic Pharmaceuticals Ltd. is involved in manufacture of pharmaceutical products, pharmaceutical substances and intermediates. It is also termed to be a market leader in macrolides segment of anti-infective drugs in India.[2]\n","country":"India","industry":"Public"},{"id":"1c603fbd-0af1-46a5-ac52-c02f4b4411ae","name":"Error","description":"","country":"India","industry":""},{"id":"85a619db-d441-41b2-aa1b-05384d07bbef","name":"Error","description":"","country":"India","industry":""},{"id":"8fb8f37e-30af-4770-a104-3fbda298cacf","name":"Amco Batteries","description":"AMCO Batteries Limited is an automobile and commercial Battery manufacturing company headquartered in Chennai, Tamil Nadu.[2][3] It is a part of Rs. 15,000-crore Amalgamations Group, one of India's biggest light engineering groups in India.[4][5] Started in year 1932, today AMCO is the leading supplier of two-wheeler batteries to companies like Honda, Hero Motor Corp, Bajaj Auto, TVS, Yamaha, Royal Enfield, Mahindra Two Wheelers etc. It also supplies four-wheeler batteries to TAFE Tractors, Eicher Tractors, Sonalika Tractors etc. The product profile of AMCO includes Automotive, Inverter, Genset and UPS Batteries. It manufactures wide variety of batteries across all these product categories. AMCO is a market leader in two-wheeler battery segment[citation needed] with most of the two-wheelers coming with AMCO Battery's O.E, fitment. The company also manufactures four-wheeler Batteries with product range consisting of Factory Charged, Dry Charged and Maintenance Free batteries.\n","country":"India","industry":"Battery"},{"id":"7e1f6d54-0a06-47a8-b665-be1e988e8f52","name":"Error","description":"","country":"India","industry":""},{"id":"64988bff-e592-44f0-a82c-551c9b7e51bf","name":"Amrutanjan Healthcare","description":"Amrutanjan Healthcare Limited is an Indian pharmaceutical company established by Kasinadhuni Nageswara Rao in Mumbai in 1893.\n","country":"India","industry":"Public"},{"id":"dcec9b99-af61-438b-ae96-a4ec2773f5ff","name":"Error","description":"","country":"India","industry":""},{"id":"c2139b96-d144-474b-9167-0199b171168f","name":"Anikspray","description":"Anikspray or Anik Spray was one of the most popular skimmed milk powder brand in India originally developed by Lipton India and later sold to other players.\nThe brand is still active; however, it has lost major market share, due to the fierce competition in the post-1991 liberalization era.\nThe milk powder was made from fresh milk to guarantee instant lump-free mixing when in contact with water. Therefore it became popular in the Indian kitchen, given the convenience and distinct taste - especially, when used to prepare Chai (Indian milk tea) as an easy replacement to fresh milk.[1][2]\n","country":"India","industry":""},{"id":"50d73585-1f3e-4fd1-8c55-b17cb227f9c0","name":"Error","description":"","country":"India","industry":""},{"id":"eb70f258-f944-4a53-87dd-f569d280e3a0","name":"Error","description":"","country":"India","industry":""},{"id":"9dffa46a-2271-4c2b-ad2e-68d38e958a9e","name":"Arise India","description":"Arise India Ltd. is a manufacturer of electrical goods based in Delhi, India and provides a range of consumer electronics. The company deals with a variety of products including televisions, inverters (UPS and sinewave), water pumps (monobloc, submersible, and centrifugal), home and kitchen appliances (mixer grinder, induction cook tops, juicer mixer grinders, water heaters, and smart Android based televisions.\n","country":"India","industry":"Private"},{"id":"b0d0f7a7-3ae0-4b8e-8587-fe7bc9a1ac9f","name":"Error","description":"","country":"India","industry":""},{"id":"9a0d7a5b-9ad5-4474-966f-ef67e345802d","name":"Error","description":"","country":"India","industry":""},{"id":"c1a27ecf-8de8-41ca-bc95-86037d24d516","name":"Asia MotorWorks","description":"Asia Motor Works Ltd (AMW) is an Indian automotive company that manufactures commercial vehicles, auto components, fully built vehicles and forged components. Founded in 2002, AMW has won Commercial Vehicle (CV) of the year 2008 from NDTV Profit Car and Bike Awards[3] & \"CV Innovation of the Year\" for 2010 from CV Magazine & Zee Business News.[4]\n","country":"India","industry":"Private"},{"id":"238abe93-3ff3-40cc-8bca-187bcd9ff5d6","name":"Error","description":"","country":"India","industry":""},{"id":"2a04d1f1-c6d4-4fb2-8588-a748b6105d41","name":"Error","description":"","country":"India","industry":""},{"id":"68e47218-4a51-40bb-bb03-c9c70bb5941d","name":"Axis Bank","description":"Axis Bank is the third-largest[citation needed] Indian bank offering a wide assortment of financial products. The bank has its head office in Mumbai, Maharashtra. It has 4,800 branches, 17,801 ATMs and 4,917 cash recyclers spread across the country as of 31 March 2020 and nine international offices. The bank employs over 1,30,000 people and had a market capitalization of ₹2.31 trillion (US$32 billion) (as on 31 March 2020).[5] It sells financial services to large and mid-size corporates, SME and retail businesses.[1]\n","country":"India","industry":"Public limited"},{"id":"2078ffc0-27ff-48be-b9ff-9a2e9765a4b4","name":"Axis Forex Online","description":"Axis Forex is an online money transfer service by the Axis Bank that provides outward remittance services.[1][2]\n","country":"India","industry":"Financial Services"},{"id":"792ef4f5-366f-4083-8864-7c545306e54e","name":"Error","description":"","country":"India","industry":""},{"id":"d1f7dc88-6763-4daf-81cb-0727968534fe","name":"Error","description":"","country":"India","industry":""},{"id":"60b59c74-f0b5-4ff8-afb2-cc515c729f65","name":"Bajaj Consumer Care","description":"Bajaj Consumer Care Ltd.(Formerly known as Bajaj Corp Ltd.) (Marathi: बजाज कंझ्युमर लिमिटेड) is an Indian consumer goods company with major brands in hair care. It is part of the Bajaj Group, founded by Jamnalal Bajaj.  Bajaj Group has interests in varied industries including Sugar, Consumer Goods, Power Generation and Infrastructure Development.\n","country":"India","industry":"Consumer goods,"},{"id":"edcd3a91-6e92-4e71-86fe-88472420e483","name":"Error","description":"","country":"India","industry":""},{"id":"7c2baf64-549a-4572-9c07-266c3544e249","name":"Error","description":"","country":"India","industry":""},{"id":"2ce61726-8858-46bd-b6b5-e55e25e1a7da","name":"Balaji Wafers","description":"Balaji Wafers and Namkeen group, based in Rajkot, Gujarat, India, manufactures and distributes potato chips and other grain-based bagged snacks in various flavours.[3] Started as a micro-business, it has evolved into a ₹2,000 crore (US$280 million) company of products with an indigenous taste.[4]\n","country":"India","industry":"Private limited"},{"id":"066e9c3b-bd14-4796-83ac-2a5f37fcd72d","name":"Error","description":"","country":"India","industry":""},{"id":"c02113db-7c7b-4f71-89ed-a354d46adeef","name":"Banas Dairy","description":"Coordinates: 24°08′09″N 72°26′27″E﻿ / ﻿24.135827°N 72.440929°E﻿ / 24.135827; 72.440929\n","country":"India","industry":"Cooperative"},{"id":"b9780326-e9aa-4228-b878-5e0c4c5b653d","name":"Error","description":"","country":"India","industry":""},{"id":"093aca42-221b-4e75-b0b9-22654318a571","name":"Bellatrix Aerospace","description":"\n\nBellatrix Aerospace is a private Indian aerospace manufacturer and smallsat launcher headquartered in Bangalore, India. The company was established in 2015.[1] They are planning the first launch of their Chetak rocket in 2023[2]. The two-stage Chetak rocket is powered by a number of their own Aeon engines. The Chetak rocket will use liquid methane as fuel.[3]\nRecently they have reported plans to use water as fuel.[1] \n","country":"India","industry":""},{"id":"f4b7e8c4-7d64-4a5c-83f1-664a1a020d34","name":"Error","description":"","country":"India","industry":""},{"id":"9db94e91-1be1-4136-a9e3-1ee5cbf32a80","name":"Error","description":"","country":"India","industry":""},{"id":"01853a1f-c672-4c6c-a35b-7684f2df8657","name":"Bharat Aluminium Company","description":"Bharat Aluminium Company Ltd. (BALCO) is an Indian aluminium company. BALCO was incorporated in the year 1965 as a Public Sector Undertaking (PSU) and it was the Public sector until 2001, when it was taken over by Vedanta Resources, a company listed on the London Stock Exchange. The Company has been closely associated with the Indian Aluminium Industry, in a pivotal role. Mr. Vikas Sharma is the current CEO & Whole Time Director of the company.[1]\n","country":"India","industry":"1965; 55 years ago (1965)"},{"id":"dc21a9de-0c8c-4ed8-b3a0-5b52d9c19a45","name":"Error","description":"","country":"India","industry":""},{"id":"be59e38d-4a56-4669-a037-b5129b398bcc","name":"Error","description":"","country":"India","industry":""},{"id":"748ce6df-baf1-4f1c-81e2-e1ddeb7c129a","name":"Bharti Airtel","description":"Bharti Airtel Limited, also known as Airtel, is an Indian global telecommunications services company based in New Delhi, India. It operates in 18 countries across South Asia and Africa, and also in the Channel Islands. Airtel provides GSM, 3G, 4G LTE, 4G+ mobile services, fixed line broadband and voice services depending upon the country of operation. Airtel had also rolled out its VoLTE technology across all Indian telecom circles.[8] It is the third largest mobile network operator in India and the second largest mobile network operator in the world with over 411.42 million subscribers.[3][4][5] Airtel was named India's 2nd most valuable brand in the first ever Brandz ranking by Millward Brown and WPP plc.[9]\n","country":"India","industry":"Public"},{"id":"17eb2ace-9e7e-4e37-b150-1a3f7827b63b","name":"Bhima Jewellers","description":"Bhima Jewellers is a jewellery retail company based in India. It was established by late Sri Bhima Bhattar in the year 1925.[2] Currently the group has 36 jewellery shops[3]  across South India and with a work-force greater than 2000 people. Bhima Jewellers were the first jewellery store to introduce ready made jewellery concept under the guidance of its founder Bhima Bhattar.[4]\n","country":"India","industry":"Jewelers"},{"id":"30c4830b-f0f7-4fda-be6d-771756c62943","name":"Error","description":"","country":"India","industry":""},{"id":"326841cd-f51b-45a0-8475-008327b60fa1","name":"Error","description":"","country":"India","industry":""},{"id":"3ef2c56e-bc90-46de-9021-2f863f787d3e","name":"Biocon","description":"Biocon Limited is an Indian biopharmaceutical company based in Bangalore, India.[2] The Company manufactures generic active pharmaceutical ingredients (APIs) that are sold in over 120 countries [no proof provided] across the globe, including the developed markets of the United States and Europe.[2] It also manufactures novel biologics, as well as, biosimilar insulins and antibodies, which are sold in India as branded formulations. Biocon's biosimilar products are also sold in both bulk and formulation forms in several emerging markets [provide reference]. In research services, Syngene International Limited (Syngene), a publicly listed subsidiary of Biocon.\n","country":"India","industry":"Public"},{"id":"bd7863da-4dbd-4b8d-b796-03dfd8099d42","name":"Error","description":"","country":"India","industry":""},{"id":"88c1f0fb-c376-4c1e-9fbc-5c63cdfa77b8","name":"Bisk Farm","description":"Bisk Farm is a brand which is owned by SAJ Food Products (P) Ltd, a part of the Aparna Group of Companies. It is a fast-moving consumer goods (FMCG) company, headquartered in the city of Kolkata in the Indian State of West Bengal.\n","country":"India","industry":"Manufacturing"},{"id":"eec02525-1d53-4634-aee4-aff4ae359e79","name":"Error","description":"","country":"India","industry":""},{"id":"81d5ea9b-a8aa-4737-8179-03515b1b65cf","name":"Error","description":"","country":"India","industry":""},{"id":"880f1c35-1deb-425b-8358-99934cc1def6","name":"Blue Star (company)","description":"Blue Star Limited is a company specialising in designing, developing, manufacturing and marketing a wide variety of products in the air conditioning and commercial refrigeration industry and is headquartered in Mumbai, India. It is the country's second largest homegrown player in the air conditioning space.[4]\n","country":"India","industry":"Public"},{"id":"ec61e9b5-48e9-4c55-ae28-c8bf204d9206","name":"Error","description":"","country":"India","industry":""},{"id":"b04857a0-d78b-4d78-ac04-30f7e7b29c8e","name":"Error","description":"","country":"India","industry":""},{"id":"3ed6860f-2701-4f11-94d5-3bb79582c2b1","name":"Bovonto","description":"Bovonto is a soft drink popular in Tamil Nadu, India.\n","country":"India","industry":"Kali Aerated Water Works"},{"id":"1224f4bd-0a0b-4c7f-9bbc-957d218d863c","name":"Error","description":"","country":"India","industry":""},{"id":"d9c9fc3f-b14d-4662-a888-24de95622704","name":"Error","description":"","country":"India","industry":""},{"id":"e113527c-f747-4444-9787-39f9199ee2be","name":"The Brand Trust Report","description":"The Brand Trust Report, India Study is an annual study by N. Chandramouli based on a primary research conducted across Indian cities based on a proprietary 61-attribute \"Trust Matrix\". The research studies trust attitudes and preferences of brand influencers and also lists the most trusted brands in India. The research report is available in hardcover.\n","country":"India","industry":"N. Chandramouli[1]"},{"id":"4973ab6c-e923-4020-8c0d-a1a2c87bc519","name":"Error","description":"","country":"India","industry":""},{"id":"bfa24993-f628-413f-bc2d-872e5e5e7fd3","name":"Brihans Natural Products","description":"Brihans Natural Products Ltd. is an Indian natural cosmetics and consumer products company based in Shaniwar Peth, Pune, Maharashtra, India. The company manufactures skin care, hair care and health care products.[2]\n","country":"India","industry":"Natural products"},{"id":"586d763c-c23d-44ba-9509-125bf3a4df53","name":"Britannia Industries","description":"Britannia Industries Limited is an Indian food-products corporation. Founded in 1892 and headquartered in Kolkata, it is one of India's oldest existing companies. It is now part of the Wadia Group headed by Nusli Wadia. The company sells its Britannia and Tiger brands of biscuits, breads and dairy products throughout India and in more than 60 countries across the world.[2] Beginning with the circumstances of its takeover by the Wadia group in the early 1990s, the company has been mired in several controversies connected to its management. However, it enjoys a large market share and is exceedingly profitable.\n","country":"India","industry":"Britannia Biscuit Company Limited"},{"id":"48666dd1-8d09-411f-8f46-16c1ea3d701d","name":"Error","description":"","country":"India","industry":""},{"id":"0879700e-c4c1-4787-889e-2bcbff30f739","name":"Café Coffee Day","description":"Café Coffee Day (CCD) is an Indian café chain. It is a subsidiary of Coffee Day Enterprises Limited. Coffee Day serves 1.6 billion cups of coffee annually in six countries. Internationally, CCDs are present in Austria, Czech Republic, Malaysia, Nepal and Egypt.[2]\n","country":"India","industry":"Café Coffee Day"},{"id":"de914f67-1fea-4f30-a26b-9949ff42f7e6","name":"Error","description":"","country":"India","industry":""},{"id":"dd257fc9-633c-4681-bc68-5bc78effbed0","name":"CEAT (company)","description":"Cavi Electrici e Affini Torino, commonly known by the abbreviation CEAT, is the flagship company of RPG Group. It was established in 1924 in Turin, Italy. As of date, CEAT is one of India's leading tyre manufacturers and has presence in global markets. CEAT produces over 165 million tyres a year and manufactures tyres for passenger cars, two-wheelers, trucks and buses, light commercial vehicles, earth-movers, forklifts, tractors, trailers, and auto-rickshaws.The current capacity of CEAT tyres' plants is over 800 tonnes per day.[3]\n","country":"India","industry":"Public"},{"id":"4c2bc5ae-cef9-4ca5-aa4d-c334c1bd736d","name":"Error","description":"","country":"India","industry":""},{"id":"826491d7-c214-4fad-b76c-d70a7e592c5c","name":"Error","description":"","country":"India","industry":""},{"id":"3673c515-818c-42ed-9d6e-e4aaacccf3ba","name":"Changalikodan","description":"Changalikodan Nendran Banana or famously known as Changalikodan is a banana variety originated and cultivated in Chengazhikodu village of Thrissur District in Kerala state of India.  Changalikodan, now are cultivated on the banks of the Bharathapuzha river. It is grown in Erumapetty, Wadakkancherry, Mundoor, Kaiparambu, Desamangalam and Thayyur of Thrissur District. It is the Kaazhchakula to the presiding deity of the Guruvayur Temple Sree Krishna Temple. The average bunch bears 20 to 25 fruits per hand. Newly, bananas are being brought from Honolulu. In Honolulu they use them as flavor for the traditional American dish - hamburger, and of course for Coca-Cola mustard type bottles. Changalikodan got Geographical indication registration from the Geographical Indications Registry, Chennai.[1] The Chengalikodan Banana Growers’ Association, Erumapetty, was given the registration.\n","country":"India","industry":""},{"id":"09d09b8d-fb45-4664-a230-5a54ad0bdbaa","name":"Error","description":"","country":"India","industry":""},{"id":"f76d0162-0443-49a1-b1b9-56c0e3cf9051","name":"Error","description":"","country":"India","industry":""},{"id":"4980d155-dd49-4ca2-b55c-4e18daf2e14d","name":"Chinkara Motors","description":"Chinkara Motors, officially Chinkara Motors PVT Ltd, is a Mumbai, Maharashtra-based auto, marine, ATV and aviation manufacturer.\n","country":"India","industry":"automotive, marine, aviation, ATV"},{"id":"dc517b5d-82de-4f3c-9e6c-042a4555a068","name":"Error","description":"","country":"India","industry":""},{"id":"e056e97d-1115-4513-89a5-0c0d8c3babca","name":"Cibaca (brand)","description":"Cibaca is an oral hygiene brand in India. Originally owned by Ciba Geigy which marketed Cibaca toothpastes and toothbrushes, the brand was bought by Colgate-Palmolive in 1994.[1] After the acquisition, Colgate relaunched the brand as Colgate Cibaca to indicate the change of ownership.[2] The brand is strong in rural India, where it sells in high volumes.[3]\n","country":"India","industry":""},{"id":"82340770-13ec-4945-adf4-05d059bed6b6","name":"Error","description":"","country":"India","industry":""},{"id":"156f51d2-5533-496a-9eac-bb24fd9c5ed4","name":"Error","description":"","country":"India","industry":""},{"id":"b0f61ab9-68af-40d4-ad42-506066af330b","name":"Cords Cable Industries Limited","description":"Cords Cable Industries Limited (BSE: 532941, NSE: CORDSCABLE, ISIN: INE792I01017) is the largest instrumentation cable maker in India.[1]\n","country":"India","industry":""},{"id":"485f4376-97a2-4ea0-9ebf-da3d10a5891a","name":"Cosco (India) Limited","description":"Cosco (India) Ltd. is an Indian Sports Equipment Manufacturer based in Delhi.[4]\n","country":"India","industry":"Public"},{"id":"a40ecc86-32af-46e0-969e-29c5a6e7793b","name":"Error","description":"","country":"India","industry":""},{"id":"6e9ffe04-3faa-4f1e-a8a2-637c03cc074c","name":"Error","description":"","country":"India","industry":""},{"id":"2be1a5c0-466d-414f-8a67-231f15ebe9e9","name":"Cyient","description":"Cyient Limited (formerly Infotech Enterprises Limited) is focused on engineering, manufacturing, data analytics, and networks & operations. Infotech Enterprises Ltd. was established in 1991 in Hyderabad, India.[1] Infotech Enterprises was re-branded Cyient in 2014 and featured among the top 30 outsourcing companies in the world as of 2018.[2]\n","country":"India","industry":"BSE: 532175NSE: CYIENT"},{"id":"92f8cb0b-6120-49f3-b1ca-e79002362cf6","name":"Error","description":"","country":"India","industry":""},{"id":"1660b2cc-6828-442b-8b74-cda6c22f104b","name":"Dalda","description":"Dalda is a brand of hydrogenated vegetable oil popular in South Asia.\n","country":"India","industry":""},{"id":"46138f3b-82bc-4c5c-8e3e-50e99b925e9d","name":"Error","description":"","country":"India","industry":""},{"id":"513d742e-b531-4f7e-bb35-3c816c078bbc","name":"Error","description":"","country":"India","industry":""},{"id":"868024d0-8a33-4a6e-ae1d-755466486e58","name":"Dish TV","description":"DishTV India (stylised as dishtv) is an Indian direct broadcast satellite service provider in India owned and operated by the Zee Group and the Videocon Group. DishTV was launched by the Zee Group on 2 October 2003. It ranked # 437 and # 5 on the list of media companies in Fortune India 500 roster of India's largest corporations in 2011.[3] Dish TV was also voted India's most trusted DTH brand according to the Brand Trust Report 2014, a study conducted by Trust Research Advisory.[4][5] On 22 March 2018, Dish TV completed a merger with Videocon d2h, creating the largest DTH provider in India.\n","country":"India","industry":"Private"},{"id":"7ffd1725-8f0a-4a85-9cde-a7e3b8c419c5","name":"Error","description":"","country":"India","industry":""},{"id":"527cbcc1-89d3-4655-9382-83e77f69af68","name":"DSK Group","description":"DSK Group was a business conglomerate headquartered in Pune, India having its presence in domains including real estate, automobile, technology, sports, information technology, and education. The Group was founded by Deepak Sakharam Kulkarni, born and studied in Pune, is the Chairman and Managing Director of the Group.[1] The Group was a multi-crore business with a turnover of over INR 4,000 crores.[2] It had operations in India (Pune, Mumbai, Nashik, Bengaluru and Chennai) and the US.[3]\n","country":"India","industry":"Private"},{"id":"7264bd3b-bf6a-4ec3-a034-4901c1f2888c","name":"Error","description":"","country":"India","industry":""},{"id":"fce648f3-d284-4b64-a35a-cf97277d2a91","name":"Error","description":"","country":"India","industry":""},{"id":"dadfe09d-e266-443b-af3d-b52fa667f72d","name":"Dwarkin","description":"\n\nDwarkin formally known as Dwarkin & Son, founded in 1875, was a pioneering Indian enterprise for the sale of Western and Indian musical instruments, which attained a legendary status in the music world at Kolkata (then known, in English, as Calcutta), particularly with the development of the hand-held harmonium.\n","country":"India","industry":""},{"id":"1b681d21-2bb8-4e0d-98c6-77dbbf22b90c","name":"Easyday","description":"Easyday is an Indian retail brand that runs chains of consumer retail supermarkets and convenience stores. The brand is wholly owned by Future Retail Ltd[1]. Bharti Enterprises announced its foray into retail in February 2007[2] and the first store was opened in Punjab in April 2008.[3] Easyday presently has 523 stores across 12 states.[4]\n","country":"India","industry":"Private company's subsidiary's retail chain"},{"id":"ad0c82f8-27ce-4044-872d-9e1ac41305dc","name":"Error","description":"","country":"India","industry":""},{"id":"efe7a3fe-9fa5-4b0e-b49e-3f90966ecc7e","name":"Ekart","description":"Ekart logistics or Ekart courier is an Indian courier delivery services company, headquartered in Bangalore, Karnataka.[1][4] A subsidiary of electronic commerce company Flipkart Pvt. Ltd., it is run by Instakart services Pvt. Ltd.[5][6]\n","country":"India","industry":"Ekart logistics[1]"},{"id":"7efe8ff3-c4e5-464e-9045-9508719d2196","name":"Error","description":"","country":"India","industry":""},{"id":"0d30db47-58bb-4679-8c07-6fb4048c20cd","name":"Epic (web browser)","description":"Epic is a privacy-centric web browser. It was developed by Hidden Reflex (a software product company founded by Alok Bhardwaj, based in Washington DC and Bangalore, India) from Chromium source code.[3] Epic is always in \"private browsing mode\". Exiting the browser deletes all browser data. Even during browsing as little as possible is stored. Epic developers removed all Google tracking code, binaries from the chromium source code to compile a clean executable and blocks other companies from tracking users.[4]\n","country":"India","industry":""},{"id":"307eb32e-734d-4ed5-a857-a204f35a85a7","name":"Error","description":"","country":"India","industry":""},{"id":"e424ee70-0890-4db2-b268-69560f7fd27e","name":"Everest Spices","description":"Everest Food Products Pvt Ltd (Everest Spices) is an Indian manufacturer, distributor and exporter of ground spices and spice mixtures under the brand name Everest.[1]\n","country":"India","industry":"Food"},{"id":"3c5fa7c0-4a9d-4722-926f-afceda7a9670","name":"Error","description":"","country":"India","industry":""},{"id":"bd48bea8-0719-4c72-bd5f-d839884fd08e","name":"Fabindia","description":"Fabindia (or Fabindia Overseas Pvt. Ltd.) is an Indian chain store retailing garments, furnishings, fabrics and ethnic products handmade by craftspeople across rural India. Established in 1960 by John Bissell, an American working for the Ford Foundation, New Delhi, Fabindia started out exporting home furnishings, before stepping into domestic retail in 1976, when it opened its first retail store in Greater Kailash, New Delhi. Today it has over 250 stores across India and abroad, and is managed by his son, William Nanda Bissell.\n","country":"India","industry":"Private/Community owned"},{"id":"8df47183-abbb-46d4-92da-d70fd5e1ac71","name":"Error","description":"","country":"India","industry":""},{"id":"bcf14b01-3b35-4ae8-a66a-d5c6c87037f3","name":"Error","description":"","country":"India","industry":""},{"id":"998f98b9-fb79-4d83-a4ce-f0adeb2ddd76","name":"Finolex Cables","description":"Finolex Cables Ltd is an Indian manufacturer of electrical and telecommunication cables based in Pune, Maharashtra.[5] It is the flagship company of the Finolex Group, established in 1958.\n","country":"India","industry":"Public company (BSE: 500144 NSE: FINCABLES)"},{"id":"17d4056c-dd38-40fc-a3f4-5844ba3549e4","name":"Error","description":"","country":"India","industry":""},{"id":"db88ea9a-e0b5-4031-a794-250fc11fbcde","name":"Error","description":"","country":"India","industry":""},{"id":"d7338766-bb1a-4d39-85e3-c0558e465915","name":"Forest Essentials","description":"Forest Essentials is an Indian cosmetics, skincare and perfume company that specialises in Ayurvedic preparations for its products. It was founded in 2000 by Mira Kulkarni in New Delhi, India.[1]\n","country":"India","industry":"Private"},{"id":"7c62873d-656c-41ea-adab-9c5b783f0c01","name":"Error","description":"","country":"India","industry":""},{"id":"40b5a351-cbdb-44b8-8ef4-7ba5976ede31","name":"General Insurance Corporation of India","description":"GIC Re or GIC of India is a state owned enterprise in India. It was incorporated on 22 November 1972 under Companies Act, 1956. GIC Re has its registered office and headquarters in Mumbai. It was the sole reinsurance company in the Indian insurance market until the insurance market was open to foreign reinsurance players by late 2016 including companies from Germany, Switzerland and France. GIC Re's shares are listed on BSE Limited and National Stock Exchange of India Ltd. GIC Re was ranked in Forbes'[4] list of World's Best Employers and Top Regarded Companies in 2019. \n","country":"India","industry":"Public-sector undertaking"},{"id":"a28045db-03d4-4ac5-8a48-c7e299b9bb67","name":"Error","description":"","country":"India","industry":""},{"id":"10d35598-0255-4a6c-aaf1-ec30d269f500","name":"GoAir","description":"GoAir is an Indian low-cost airline based in Mumbai, Maharashtra. It is owned by the Indian business conglomerate Wadia Group. In October 2017 it was the fifth largest airline in India with an 8.4% passenger market share.[3] It commenced operations in November 2005 and operates a fleet of Airbus A320 aircraft in all economy configuration. As of March 2020, the airline operates over 330 daily flights to 36 destinations, including 27 domestic and 9 international destinations, from its hubs at Mumbai, Delhi, Bangalore, Kolkata and Kannur.[4][5]\n","country":"India","industry":"\n\n\n\nIATA\n\nICAO\n\nCallsign\n\n\nG8\n\nGOW\n\nGO AIR\n"},{"id":"1680b528-eaef-4754-be58-546b9d02b505","name":"Error","description":"","country":"India","industry":""},{"id":"b802f74c-bcc4-4f5a-8863-abf6ddb78af8","name":"Godrej Group","description":"Godrej Group, is an Indian conglomerate company headquartered in Mumbai, Maharashtra, India, managed and largely owned by the Godrej family. It was founded by Ardeshir Godrej and Pirojsha Burjorji Godrej in 1897, and operates in sectors as diverse as real estate, consumer products, industrial engineering, appliances, furniture, security and agricultural products.[4] Subsidiaries and affiliated companies include Godrej Industries and its subsidiaries Godrej Consumer Products, Godrej Agrovet, and Godrej Properties, as well as the private holding company Godrej & Boyce Mfg. Co. Ltd.\n","country":"India","industry":"Private"},{"id":"b2a30f3a-e4fd-4f7a-84c8-2c31fe4f8f68","name":"Error","description":"","country":"India","industry":""},{"id":"56f9c2f4-58cd-4728-b2fd-68dac33ccd80","name":"Gold Winner","description":"\n\nGold Winner is a sunflower oil brand produced by Kaleesuwari Refinery Pvt Ltd. The history of the company goes back to 1970s with a small grocery store started by G. Munusamy Nadar. He bought Kaleesuwari Refinery Private Limited near Chennai[1] in 1993 and has markets in India, Singapore, Malaysia, Brunei, Kuwait, UAE, Australia, UK and Sri Lanka. The company also sells other products such as vanaspati, soybean oil and groundnut oil CARDIALIFE.[2] In 2005, it has received HACCP (Hazard Analysis Critical Control Points) certification which certifies that the oil does not have any physical, chemical or biological contamination and valid for 5 years. It was also awarded ISO 9001:2000 for its oil manufacturing plant at Vengaivasal, near to Chennai by TUV Management Services Gmbh, Germany.[3]\n","country":"India","industry":""},{"id":"bf76c456-af9f-4bbe-8989-516807b9974a","name":"Goldmedal Electricals Pvt. Ltd.","description":"Goldmedal Electricals Pvt. Ltd. is one of the leading home-grown fast moving electrical goods company in India. Established in 1979, the company offers a wide range of electrical products including LED lights, modular switches, home automation systems, entertainment devices, security systems, wires & cables and electrical accessories for residential and commercial establishments.\nGoldmedal Electricals is headquartered in Mumbai, Maharashtra[3] and has a pan India presence with branches in all 29 states of India. The company has 13 company-owned experience centres across the country.\n","country":"India","industry":"Not listed"},{"id":"ceba426f-ae6b-4a06-aed8-dd26fb4e75fc","name":"Gyan Dairy","description":"\n\nGyan Dairy is a North Indian diary company headquartered in UP, India and is known for the processing and distribution of dairy products produced in regionally located facilities. Gyan Dairy manufactures, markets and sells a full line of dairy products such as Milk, Lassi, Curd, Butter, and Ghee. Its tagline \"always fresh, always pure\" was unveiled in 2017, along with the company's theme song 'Shuddh aur taaza, Gyan ka waada'.[1]\n","country":"India","industry":""},{"id":"f7ccefca-38e7-4e10-80ec-1e1ea5a90bdc","name":"Error","description":"","country":"India","industry":""},{"id":"83c7f0c0-cea7-4d09-8b39-039ab34df8fe","name":"Error","description":"","country":"India","industry":""},{"id":"14bff107-069f-4506-b409-387c24c22cfa","name":"Haldyn Glass","description":"Haldyn Glass Gujarat Limited (HGGL) is a public limited company in India (BSE: 515147) [1] (ISIN Code 506D01012) manufacturing clear glass bottles and containers. The company is owned by Haldyn Glass Limited and has its manufacturing plant in  Vadodara, Gujarat while its administrative office is located in Goregaon East, Mumbai.\n","country":"India","industry":""},{"id":"5bca8d0f-fbfd-4f15-85cb-348fe0694735","name":"Hamdard (Wakf) Laboratories","description":"Hamdard Laboratories (India),  is a Unani and Ayurvedic pharmaceutical company in India (following the independence of India from Britain, \"Hamdard\" Unani branches were established in Bangladesh(erstwhile East Pakistan) & Pakistan). It was established in 1906 by Hakeem Hafiz Abdul Majeed in Delhi, and became a waqf (non-profitable trust) in 1948. Some of its most famous products include Sharbat Rooh Afza, Safi, Roghan Badam Shirin, Sualin, Joshina and Cinkara. It is associated with Hamdard Foundation, a charitable educational trust.\n","country":"India","industry":"Non-profit"},{"id":"b47cb266-ad56-49f4-ac5f-ba81bcc003af","name":"Error","description":"","country":"India","industry":""},{"id":"418ed890-f4c6-4ca2-a415-e44ca16e5753","name":"Error","description":"","country":"India","industry":""},{"id":"1f754bb5-bcec-463c-9c45-57d5e8ce55ac","name":"HCL Technologies","description":"HCL Technologies Limited, is an Indian multinational information technology (IT) service and consulting company headquartered in Noida, Uttar Pradesh. It is a subsidiary of HCL Enterprise. Originally a research and development division of HCL, it emerged as an independent company in 1991 when HCL entered into the software services business.[5]\nThe company has offices in 44 countries including the United Kingdom, the United States, France, and Germany with a worldwide network of R&D, \"innovation labs\" and \"delivery centers\", and 147,123 employees and its customers include 250 of the Fortune 500 and 650 of the Global 2000 companies. \n","country":"India","industry":"HCL Technologies Campus"},{"id":"18c3338a-cb40-4a35-83fe-fbeec481ddda","name":"HDFC Bank","description":"HDFC Bank Ltd. is an Indian banking and financial services company headquartered in Mumbai, Maharashtra. It has a base of 104154 permanent employees as of 30 June 2019.[8] HDFC Bank is India’s largest private sector lender by assets.[9] It is the largest bank in India by market capitalisation as of March 2020.[10]\n","country":"India","industry":"Private"},{"id":"a5c2036a-f909-47a4-9bf7-5a9149394d37","name":"Hero Cycles","description":"Hero Cycles Limited, based in Ludhiana Punjab, India is a manufacturer of bicycles and bicycle related products.[7] Mr Pankaj M Munjal[8] is the Chairman & Managing Director of Hero Cycles.\n","country":"India","industry":"Private company"},{"id":"835cb40a-9949-4ca8-a8d7-4f0adff18572","name":"Error","description":"","country":"India","industry":""},{"id":"70327f72-8d3a-4d7e-bfc5-58fa58187634","name":"Hero Motors Company","description":"Hero Motors Company (HMC), is group identity of businesses controlled by Pankaj M Munjal.[5][6]\n","country":"India","industry":"Private company"},{"id":"2a5a02e2-096b-42e2-aa56-1a8f6b25dcbb","name":"Error","description":"","country":"India","industry":""},{"id":"27ff633a-2a79-4f52-acf8-ab3cbda96a54","name":"Hindalco Industries","description":"Hindalco Industries Ltd., an Indian aluminium and copper manufacturing company, is a subsidiary of the Aditya Birla Group.[4] Its headquarters are at Mumbai, Maharashtra, India. It is the Flagship company in the metals business.\n","country":"India","industry":"Public"},{"id":"097c7924-50d6-4778-94ee-503db267edb6","name":"Error","description":"","country":"India","industry":""},{"id":"a00d639b-0b78-4858-8451-5096eda4340c","name":"Hindustan Motors","description":"Pin1Code\n\n","country":"India","industry":"Private"},{"id":"65f1b098-29d6-430c-9ade-c62b57a28fbb","name":"Hindustan National Glass & Industries Limited","description":" Hindustan National Glass & Industries Limited  (HNGIL) is an Indian container glassmaker based in Kolkata. The company is the largest and one of the oldest glass manufacturing companies in India.[citation needed] \n","country":"India","industry":"BSE: 515145 [1]"},{"id":"df56a95b-0c6f-4e0c-a430-27fa9c6822c3","name":"Error","description":"","country":"India","industry":""},{"id":"b027bb28-67bb-4e4e-a9e1-55b297f3652d","name":"Hindustan Platinum","description":"Hindustan Platinum Private Limited (HPPL), is a manufacturer and refiner of precious metal products at Navi Mumbai set up in 1961. The company is located at TTC Industrial Area, Pawane, Navi Mumbai.\n","country":"India","industry":"Precious metals"},{"id":"217e6cd1-1450-4926-9c37-736906d2de09","name":"HLL Lifecare","description":"HLL Lifecare Limited (formerly Hindustan Latex Limited) (HLL) is an Indian healthcare product manufacturing company based in Thiruvananthapuram, Kerala, India.[1]  A Government of India-owned corporation (Public-sector undertaking).\n","country":"India","industry":"state-owned enterprise"},{"id":"d2aa627f-e16c-478c-86ed-72b065a41a96","name":"Error","description":"","country":"India","industry":""},{"id":"a9d0ed0b-8d3a-49b6-a80c-d926b7ed473e","name":"Hoichoi","description":"Hoichoi is an Indian On-demand video streaming platform, owned and maintained by SVF Entertainment Pvt Ltd, launched on 20 September 2017.\nHoichoi is currently available for Android, iOS, Apple TV, Amazon Fire TV and recently for Android TV and Roku as well. It is the first OTT platform from Bengal focusing exclusively on Bengali language content, worldwide.[2]\n","country":"India","industry":"Private Company, Dot-com company"},{"id":"8ffebbe2-ca2f-4320-93e0-c32e0000984f","name":"Error","description":"","country":"India","industry":""},{"id":"c15a2a9f-30ba-4dc7-8817-dd674bf6f1dc","name":"I-shakti","description":"i-Shakti was launched in October 2006 by Tata Chemicals to satisfy the iodised salt needs of the Indian masses.[1]\nThe brand is now the second biggest packaged salt brand in India after Tata Salt, with a market share of around 14.3%.\n","country":"India","industry":"2006"},{"id":"f89fbb31-dae3-4856-8bdc-254d3e205804","name":"IBall (company)","description":"iBall is an Indian consumer electronics company owned by Anil Parasrampuria, Varun Daga & Shreans Daga headquartered in Mumbai, Maharashtra, India, which imports computer peripherals, smartphones and tablets from original equipment manufacturers (OEMs).[1][2][3][4] iBall started operations in September 2001, initially selling computer mice. As of 2011[update], the company sold consumer electronics products in 27 different product categories.[5][6][7][8]\nIn 2014, iBall launched the Andi Uddaan smartphone for women. An SOS button located at the back of the phone sounds a loud siren and automatically sends text messages (SMS) to five pre-selected contacts when pressed.[9]\n","country":"India","industry":"Private"},{"id":"6da11f11-7ec8-45d0-a4de-e4f8960eef01","name":"Error","description":"","country":"India","industry":""},{"id":"b7baea7b-00e2-411b-9ad3-9324933a1d7e","name":"Error","description":"","country":"India","industry":""},{"id":"e43b0359-ec0d-472e-8e51-07e4fa5bb30d","name":"Idea Cellular","description":"Idea Cellular Limited[4] \n(commonly referred to as Idea, and stylised as !dea) was an Indian mobile network operator based at Mumbai, Maharashtra. Idea was a pan-India integrated GSM operator and had 220.00 million subscribers as of June 2018.[5]\n","country":"India","industry":"Public"},{"id":"5a1708dd-a6f8-4116-b96b-f8efc1e37906","name":"Error","description":"","country":"India","industry":""},{"id":"50d74be4-b213-44bc-aeb1-faea35ae45fb","name":"Incredible India","description":"Incredible India (styled as Incredıble!ndıa) is the name of an international tourism campaign maintained by the Government of India since 2002, to promote tourism in India.\n","country":"India","industry":""},{"id":"9e16d533-448f-47b0-a7e8-14bda6d78552","name":"Indane (LPG)","description":"Indane,[3][4] is a Liquefied Petroleum Gas (LPG) brand developed and owned by Indian Oil Corporation in India. It is the world's second largest LPG marketer.[5] The brand was conceived in 1964 to bring modern cooking to Indian kitchens. The first Indane LPG connection was released on 22 October 1965 at Kolkata. Indane serves more than 90 million families through a network of 9100 distributors. 27% of its customers reside in semi-urban or rural markets and every second LPG cooking gas connection in India is that of Indane. The sales network is backed by 45 Indane Area Offices. The brand has been awarded the title of \"Superbrand\" by Superbrand India.[6]\n","country":"India","industry":"Liquefied Petroleum Gas (LPG)[1]"},{"id":"a8001e58-bf8a-435d-8792-20d1524c4d04","name":"Error","description":"","country":"India","industry":""},{"id":"39500896-69b5-4fd0-96d0-64039ac2e393","name":"India Is","description":"India Is is a series of photography and video challenges organized by the Public Diplomacy Division (PDD) of the Ministry of External Affairs (MEA), Government of India.[1][2] Both of the contests invite photo and video entries, respectively, on given themes.[3]\n","country":"India","industry":"Official Logo"},{"id":"7f1248b4-5bfa-460f-94b8-4d4e953d56fc","name":"India's Most Attractive Brands","description":"India's Most Attractive Brands - 2013 is an annual study based on a primary research conducted across 16 Indian cities [3] based on TRA's (Trust Research Advisory)[4] proprietary 36-attribute Attractiveness Matrix.[5] The research report is available in hardcase. The research studies the magnetic property of attractiveness that a brand displays and its influences and preferences on brand influencers. The report also lists the 1200 of India's Most Attractive Brands.\n","country":"India","industry":"N Chandramouli[1]"},{"id":"786f324e-8395-4ced-9766-c4436199ac0b","name":"Error","description":"","country":"India","industry":""},{"id":"f87882ea-5624-4f5d-9681-d81a6059bab7","name":"Indian Overseas Bank","description":"Indian Overseas Bank (IOB) is a major public sector bank based in Chennai, India, with about 3,400 domestic branches,\nabout 6 foreign branches and representative office\n","country":"India","industry":"Public"},{"id":"39926da0-9b87-4a7d-8f7d-d16adfd9b3d7","name":"IndiGo","description":"IndiGo is an Indian low-cost airline headquartered in Gurgaon, Haryana. It is the largest airline in India by passengers carried and fleet size, with a 47.5% domestic market share as of November 2019.[4] It is also the largest individual Asian low-cost carrier in terms of jet fleet size and passengers carried, and the sixth largest carrier in Asia with over 64 million passengers carried in financial year 2018–19. The airline operates 1500 flights  everyday[5] to 87 destinations – 63 domestic and 24 international.[6] It has its primary hub at Indira Gandhi International Airport, Delhi.[7]\n","country":"India","industry":"\n\n\n\nIATA\n\nICAO\n\nCallsign\n\n\n6E\n\nIGO\n\nIFLY\n"},{"id":"c09c2db0-8bf0-4ca0-8d4a-02f47bbe8391","name":"Indosolar","description":"Indosolar Limited is an Indian photovoltaic cell and solar panel manufacturer. It is the largest PV cell manufacturer in India by capacity.[3]\n","country":"India","industry":"Robin Garments Private LimitedRobin Solar Private Limited"},{"id":"a9ac8a1c-666b-4e75-8435-49eaac27fdea","name":"Error","description":"","country":"India","industry":""},{"id":"e4f47927-2bea-4ca1-aa06-402a870bee97","name":"Error","description":"","country":"India","industry":""},{"id":"ba05dcf2-47ab-4737-b969-c110a5aa390c","name":"Intas Biopharmaceuticals","description":"The Biologics Business Unit (BU) of Intas Pharmaceuticals Limited was formerly an independent biotechnology company and was known as Intas Biopharmaceuticals Ltd. Intas Pharmaceuticals limited is an Indian   company headquartered in Ahmedabad, India. The Biologics BU is located in Moraiya, Ahmedabad and is one of the leading biosimilar product manufacturers in Asia.\n","country":"India","industry":"Limited"},{"id":"fb9fafb3-4999-4635-a034-d053dc662f8d","name":"Error","description":"","country":"India","industry":""},{"id":"f9ce7531-f1b7-4671-ab75-ddad913dc908","name":"Error","description":"","country":"India","industry":""},{"id":"96262344-e7e5-41ad-be48-0557bbb35989","name":"Jackson Records","description":"Jackson Records is a film and music publishing label based in India. The label and its sub-labels/ imprints are owned and administered by Jackson Records Digital Entertainment LLP (formerly known as Digisys Media Network until July 2014). Jackson Records as a label started functioning from December, 2011.\n","country":"India","industry":"Jackson Records Digital Entertainment LLP"},{"id":"e31ff9c2-bdcb-49f8-9d7d-ac0d73c4088b","name":"Error","description":"","country":"India","industry":""},{"id":"ef356d9e-22ab-42e5-b2b6-5844404552ae","name":"Jaipan Industries","description":"Jaipan Industries Limited is Indian home appliances company based in Mumbai, Maharashtra, India. It manufactures and markets various Home Appliances and Non stick cookware’s under the brand name of Jaipan.[3] It is also manufactures of consumer durable products and Mobile handsets.[4] It also markets its products in a number of countries like Sri Lanka, Mauritius, Bangladesh, Nepal, U.A.E.[5] It has more than 140 products, 125 distributors and more than 6000 dealers across India. Its products include food processors, mixers, juicers, hand mixers, blenders, irons, sandwich toasters, pop-up toasters, roti makers, mechanical fans, home theatres, gas heaters, gas burners, water purifiers, vacuum cleaners, tea kettles, rice cookers, dutch ovens, ovens, stainless cutlery and dinnersets.[6]\n","country":"India","industry":"Public (BSE: 505840)"},{"id":"08a41bf8-ed44-4761-9fc3-284fab851a2c","name":"Jet Airways","description":"Jet Airways (India) Ltd was an Indian international airline based in Mumbai, India which, on 17 April 2019, ceased all flight operations with its last revenue flight operated by a Jet Konnect Boeing 737 arriving into Mumbai on 17 April 2019. From the third quarter of 2010 onward, Jet Airways was the largest commercial passenger airline in India with a passenger market share of 22.6%.[13] With its competitors, mainly SpiceJet and IndiGo, lowering ticket fares in the following years, it was forced to follow suit, hurting overall performance resulting in steep financial losses. It dropped to second place behind IndiGo in October 2017, with a passenger market share of 17.8%. The downward slide continued and resulted in bankruptcy.[14]\n","country":"India","industry":"\n\n\n\nIATA\n\nICAO\n\nCallsign\n\n\n9W[1]\n\nJAI[1]\n\nJET AIRWAYS[2]\n"},{"id":"8635a83f-6e93-4f8e-9dbf-72695ac048bb","name":"Jio","description":"Reliance Jio Infocomm Limited, d/b/a Jio, is an Indian telecommunications company and subsidiary of Jio Platforms, headquartered in Mumbai, Maharashtra, India. It  operates a national LTE network with coverage across all 22 telecom circles. It does not offer 2G or 3G service, and instead uses only voice over LTE to provide voice service on its 4G  network.[6][7]\n","country":"India","industry":"Subsidiary of Reliance Industries"},{"id":"873745b8-15de-48ce-8112-84b3f2324755","name":"Jio Payments Bank","description":"Jio Payments Bank is an Indian payments bank that started operating in 2018. Payment banks in India are a special category of bank that can accept deposits and make payments but cannot issue loans or other forms of credit including credit cards.\nJio Payments Bank Limited is a joint venture between the Reliance Industries and the State Bank of India with the stake of 70:30.[1]\n","country":"India","industry":"Public"},{"id":"ee527e0d-e82d-4316-be89-b42f886fc33c","name":"Error","description":"","country":"India","industry":""},{"id":"0bfe1b8b-d468-4634-b23d-ea2c3bfb4b97","name":"JSW Cement","description":"JSW Cement Limited is a subsidiary, new diversification foray of the 13 billion dollars JSW Group based in Mumbai.The company has three Cement production units -two grinding units in  Vijayanagara adjacent to JSW Steel plant near Bellary, Karnataka and Dolvi, Maharashtra.Integrated Cement plant in Nandyal Andhra Pradesh.The units have a combined capacity of 6 million tonnes per annum (mtpa).\n","country":"India","industry":"Cement"},{"id":"e6cafde9-67fc-4665-902b-6cddcea11e0e","name":"Error","description":"","country":"India","industry":""},{"id":"2bec24d8-4ce0-435f-86a9-d0e449107740","name":"Error","description":"","country":"India","industry":""},{"id":"3ece4d0c-a735-49f8-b447-b684da22ab64","name":"K7 Total Security","description":"K7 Total Security, developed by K7 Computing Pvt. Ltd., is a malware prevention and antivirus software, and provides malware prevention and removal during a subscription period and uses signatures and heuristics to identify viruses. Other features include a software firewall, e-mail spam filtering and phishing protection.\n","country":"India","industry":"K7 Computing"},{"id":"49a53413-73de-4fab-aea7-efd1de69f670","name":"Error","description":"","country":"India","industry":""},{"id":"226cd708-8bde-4a91-93ca-684e1e3fc00a","name":"Kalnirnay","description":"Kalnirnay (Marathi: कालनिर्णय: timely decision) is a calmanac (Calendar +Almanac) published in India. The almanac gives simplified information about the Panchang, auspicious days, festivals, holidays, sunrise and sunset. It has recipes, stories on health and education, monthly Bhavishya and articles on Hindu astrology.[3]\n","country":"India","industry":"Private company"},{"id":"ec368466-b83a-43f7-ba83-55df88303788","name":"Kalyan Jewellers","description":"Kalyan Jewellers is an Indian jewellery showroom chain.[1] From a single showroom, single city presence, today, Kalyan Jewellers is present across all major cities in the country and also has a presence in West Asia with over 8000 employees worldwide.[2]\n","country":"India","industry":"India limited"},{"id":"367e51fb-a079-40d6-8a1f-cba352ce8e31","name":"KamaSutra (brand)","description":"KamaSutra Condoms is India's second largest condom brand. It is manufactured by J.K. Ansell Ltd. (JKAL), which is a 50:50 joint venture between Raymond Group, India's largest fabric and branded apparel company, and Ansell Limited. JKAL has a condom manufacturing unit in Aurangabad in the state of Maharashtra, India with a manufacturing capacity of 350 million pieces per annum. JKAL commenced operations in 1991 and launched KamaSutra condoms the same year. Prior to the formation of the joint venture in 1996, the condom division was part of J.K. Chemicals Ltd., a subsidiary of the Raymond Group.[1] \n","country":"India","industry":"J.K. Ansell Ltd. (JKAL)"},{"id":"1cf11b97-fa45-4e45-a070-7fc2189e3374","name":"Error","description":"","country":"India","industry":""},{"id":"367e6aff-bed8-45c0-b670-a4d947264aae","name":"Karbonn Mobiles","description":"Karbonn Mobiles, is an Indian smartphone manufacturing company founded in March 2009. It is a vendor of feature phones, smartphones, tablets and mobile phone accessories.[2]\nKarbonn is a joint venture between United Telelinks Ltd., a Bengaluru-based firm and Jaina Marketing Pvt. Ltd., headquartered in New Delhi.[2] Karbonn Mobiles also has tie ups with leading telecom players like Airtel, Vodafone, Idea and Jio.[2]\nKarbonn is present in countries such as Bangladesh, Nepal, Sri Lanka and in the Middle East and Europe.[3]\n","country":"India","industry":"Private"},{"id":"64e89213-cade-4fd8-89a7-1022fa60a6aa","name":"Error","description":"","country":"India","industry":""},{"id":"5b6a314f-3a02-48e0-8f71-e4610b6ffc67","name":"KEC International","description":"KEC International Limited (BSE: 532714) is India's second largest manufacturer of electric power transmission towers[7] and one of the largest[8] Power Transmission Engineering, Procurement & Construction (EPC) companies in the world. It is headquartered in Mumbai, India[9] and is part of the ₹255 billion (US$3.6 billion) RPG Group, engaged in EPC works for Power Transmission, Distribution, Railways, Cables, Solar, Civil and Smart Infrastructure. It has operations in the regions of SAARC, EAP, Africa, Middle East and the Americas.\n","country":"India","industry":"Public (BSE: 532714)"},{"id":"f1d2c545-3053-4fa2-9ec9-5847eab9a4db","name":"Error","description":"","country":"India","industry":""},{"id":"fedca229-7412-408d-a90d-d6dbc3164b8b","name":"Kesoram Industries Ltd.","description":"Kesoram Industries Limited is one of the pioneer companies in India. It is under the flagship 'B K Birla Group Of Companies'. Its production ranges from tires to cement to rayon. According to ET500, its all India ranking was 121 for the year 2010 with a net income of Rs. 5020.63 Crore and a net profit of Rs. 648.29 Crore. In 2011, Kesoram Industries installed a small stationary packing unit. Kesoram Industries entered into a joint venture with Maharashtra Seamless Limited and Dhariwal Infrastructure Private Limited in 2012 for working a coal block allocated to it by the Central Government in the State of Maharashtra.[2] The company reported a net profit of Rs. 339.67 crore during the quarter of 2014-15 by selling a tyre plant to JK Tyres.[3]\n","country":"India","industry":"Private"},{"id":"c4edc135-5bb1-475e-9bf9-e6cfac1860fd","name":"Error","description":"","country":"India","industry":""},{"id":"6ec1d9a6-dbcd-459c-92b8-d374cf447192","name":"Kingfisher (beer)","description":"Kingfisher is an Indian beer brewed by United Breweries Group, Bangalore. The brand was launched in 1978. With a market share of over 36% in India, it is also available in 52 other countries.[1] The Heineken Group holds 42.4% equity shares in United Breweries Ltd.[2]\nKingfisher is ranked 74th among India's most trusted brands according to the Brand Trust Report 2012, a study conducted by Trust Research Advisory. In the Brand Trust Report 2013, Kingfisher was ranked 102nd among India's most trusted brands and subsequently, according to the Brand Trust Report 2014, Kingfisher was ranked 198th among India's most trusted brands.[3]\n","country":"India","industry":"Lager"},{"id":"bdfd92dd-6877-4cbe-a9b3-7729f14ca189","name":"Kirloskar Group","description":"The Kirloskar Group is an Indian conglomerate headquartered in Pune, Maharashtra, India.[1] The company exports to over 70 countries over most of Africa, Southeast Asia and Europe.[2] The flagship & holding company, Kirloskar Brothers Ltd established in 1888, is India's largest maker of pumps and valves.[3][4]\n","country":"India","industry":"Private"},{"id":"aa8aa21b-f851-4330-bdfc-71780e4ac2ea","name":"Kisna Diamond Jewellery","description":"Kisna Diamond Jewellery is an Indian diamond brand launched in 2005 by H.K.Jewels, which is the part of Hari Krishna Group Company.[1] Kisna[2][3][4] includes 1877 Designs in rings for men and women, earrings, pendants, necklace, bangles, bracelets, solitaire rings and nose pins.[5][6]\nRecently, Kisna received the brand of year award by GIF.[7][8]\n","country":"India","industry":"Diamonds and Jewellery"},{"id":"595ddb2a-19da-4325-afd0-acd6a7f1da99","name":"Sunita Kohli","description":"Sunita Kohli is an Indian interior designer, architectural restorer and furniture manufacturer. She had restored and decorated Rashtrapati Bhavan (the President's House), Parliament House Colonnade (1985–1989), the Prime Minister's Office and Hyderabad House in New Delhi.[1][2][3]\n","country":"India","industry":"Sunita Kohli"},{"id":"f2316f9b-a1e3-4e79-a2ae-78287444c51b","name":"Kokuyo Camlin","description":"Kokuyo Camlin Ltd., formerly known as \"Camlin Ltd.\", is an Indian stationery manufacturing company based in Mumbai. The company shares profits with Kokuyo of Japan, which holds around 51% stake in Kokuyo Camlin after buying it in 2012.[1]\n","country":"India","industry":"Dandekar & Co.  Camlin Ltd."},{"id":"284b57aa-e98b-4645-a146-1a83bc1961ca","name":"Kumbakonam Degree Coffee","description":"Kumbakonam Degree Coffee is a type of coffee from Kumbakonam, in the Thanjavur District of the state of Tamil Nadu, India.[1] Its speciality is the use of cows' milk without any adulterants.\n","country":"India","industry":""},{"id":"7f9880d2-1a96-4f09-9600-1a9ba484dc84","name":"Error","description":"","country":"India","industry":""},{"id":"573650b6-e54d-4861-b4a3-7d20ecfa4391","name":"Lakmé Cosmetics","description":"Lakmé is an Indian cosmetics brand which is owned by Hindustan Unilever. Having Kareena Kapoor and Ananya Pandey as the ambassador, it ranked at number 1 among the cosmetics brands in India.\n[1]\n[2][3] Lakme started as a 100% subsidiary of Tata Oil Mills (Tomco). It was named after the French opera Lakmé, which itself is the French form of Lakshmi (the goddess of wealth) who is renowned for her beauty. It was started in 1952 famously, because then Prime Minister Jawaharlal Nehru was concerned that Indian women were spending precious foreign exchange on beauty products and personally requested JRD Tata to manufacture them in India.[4] Simone Tata joined the company as director and went on to become the chairperson.[5] In 1996, Tata sold off their stakes in Lakmé Lever to HUL, for Rs 200 Crore[6](45 million US$).\n","country":"India","industry":"Private"},{"id":"f35aff74-25d0-453b-8218-5664a161c548","name":"Error","description":"","country":"India","industry":""},{"id":"75cf2ca5-ec90-4e34-9db7-69222d8b5cdf","name":"Error","description":"","country":"India","industry":""},{"id":"7be1edc8-42dd-49b6-8e00-f386138939a3","name":"Lava International","description":"Lava International Limited, is an Indian Smartphone Manufacturer company in the mobile handset industry. The company was founded in 2009[3] as an offshoot of a telecommunication venture. It is headquartered in Noida, Uttar Pradesh, India and has overseas operations in Thailand, Nepal, Bangladesh, Sri Lanka, Indonesia, Mexico and the Middle East, Pakistan and Russia.[4] The company started its Africa operations by launching its product in Egypt in 2016.[5][6].\nLava is working towards establishing a mobile phone design centre in India and setting up new manufacturing facilities. \n","country":"India","industry":"Private"},{"id":"113a06b4-be6d-4c90-ac16-854d4dfc3972","name":"Error","description":"","country":"India","industry":""},{"id":"a1860ee8-1d67-4a7c-9e73-7ff3fdee2e24","name":"Liberty Shoes","description":"Liberty Shoes Limited (LSL) is an Indian shoe company, based in Karnal, Haryana.\n","country":"India","industry":"Public, (BSE 526596, NSE LIBERTSHOE)"},{"id":"ac89f566-4ae4-42e8-9d3b-d64eaf25be5c","name":"Error","description":"","country":"India","industry":""},{"id":"06d3de29-f866-4262-9e7b-581d4465c7f1","name":"Limtex","description":"Limtex is an Indian multinational company, headquartered in Kolkata, West Bengal, India and a subsidiary of Limtex Group. It exports $40 million in Indian tea annually. Limtex is the leading producer, manufacturer and exporter of Indian Tea both in the domestic and international market. It also has an IT division - Limtex Infotech, which was formed in 2005.\n","country":"India","industry":"1977"},{"id":"2c33f4b4-31dd-42f8-b38d-4796beb54723","name":"Error","description":"","country":"India","industry":""},{"id":"7c09c311-f423-407f-bb5b-d2b89e8f3980","name":"Liril","description":"Liril is a popular soap brand sold, to a large degree, in India, and Asia, as well as a few places in Europe. The soap is currently manufactured by Hindustan UniLever Limited in India. Liril launched a blue variant called Icy Cool Mint in 2002. It also tried launching an Orange variant, called Liril Orange Splash in India in 2004. Neither of these variants created much splash in the market. The company even changed agencies handling the brand, from Lowe to McCann Erickson before going back to Lowe.\n","country":"India","industry":""}]